[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:26:15
 
 function zQuestionCognitiveDifficulty(): ZodEnum<QuestionCognitiveDifficultyEnum> {
   return z.enum(QUESTION_COGNITIVE_DIFFICULTIES)
-    .describe("Question's cognitive difficulty level");
+    .describe("");
 }
 
killedBy: Question DTO Shape cognitiveDifficulty should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { Object (description) }

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:36:15
 
 function zQuestionCategory(): ZodEnum<QuestionCategoryEnum> {
   return z.enum(QUESTION_CATEGORIES)
-    .describe("Question's category");
+    .describe("");
 }
 
killedBy: Question Modification DTO Shape category should have correct description when accessing the description.
statusReason: expected '' to be 'Question\'s category' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:52:52
   return z.array(z.url())
     .min(QUESTION_SOURCE_URLS_MIN_ITEMS)
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
-    .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
+    .refine(areValuesUniqueFromStrings, { message: "" })
     .describe("List of unique source URLs for the question")
     .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected '' to be 'Source URLs must be unique' // Object.is equality

[Killed] ObjectLiteral
shared/zod/validators/question.dto.zod.validators.ts:54:11
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
     .describe("List of unique source URLs for the question")
-    .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
+    .meta({});
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct metadata when accessed.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:54:54
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
     .describe("List of unique source URLs for the question")
-    .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
+    .meta({ example: ["https://example.com/source1", ""] });
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct metadata when accessed.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:88:33
 function zQuestionThemeIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return z.preprocess(
     normalizeToArray,
-    z.array(zMongoId().describe("Theme ID to filter questions by")).min(1),
+    z.array(zMongoId().describe("")).min(1),
   )
     .optional()
killedBy: Question DTO Zod Validators zQuestionThemeIdsFilter should have the correct inner element description when called.
statusReason: expected '' to be 'Theme ID to filter questions by' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:100:54
     z.array(zMongoId().describe("Question ID to filter by"))
       .min(QUESTION_IDS_FILTER_MINIMUM)
       .max(QUESTION_IDS_FILTER_MAXIMUM)
-      .refine(areValuesUniqueFromStrings, { message: "IDs must be unique" }),
+      .refine(areValuesUniqueFromStrings, { message: "" }),
   )
     .optional()
killedBy: Question DTO Zod Validators zQuestionIdsFilter should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected '' to be 'IDs must be unique' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:109:15
 function zQuestionIsAdultContentFilter(): ZodOptional<ZodCodec<ZodString, ZodBoolean>> {
   return zStringBoolean()
     .optional()
-    .describe("Filters questions by adult content: 'true' returns only questions flagged as adult content, 'false' returns only questions without it; omit to include both.");
+    .describe("");
 }
 
killedBy: Question DTO Zod Validators zQuestionIsAdultContentFilter should have the correct description when called.
statusReason: expected '' to be 'Filters questions by adult content: \…' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:119:15
 
 function zQuestionCreatedAt(): ZodISODateTime {
   return zIsoDateTime()
-    .describe("Question's creation date");
+    .describe("");
 }
 
killedBy: Question DTO Zod Validators zQuestionCreatedAt should have the correct description when called.
statusReason: expected '' to be 'Question\'s creation date' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:124:15
 
 function zQuestionUpdatedAt(): ZodISODateTime {
   return zIsoDateTime()
-    .describe("Question's last update date");
+    .describe("");
 }
 
killedBy: Question DTO Zod Validators zQuestionUpdatedAt should have the correct description when called.
statusReason: expected '' to be 'Question\'s last update date' // Object.is equality
