[Killed] ObjectLiteral
application/dto/admin-find-question-themes-query/admin-find-question-themes-query.dto.shape.ts:24:11
     .optional()
     .default(QUESTION_THEME_SORT_ORDER_DEFAULT)
     .describe(QUESTION_THEME_SORT_ORDER_DESCRIPTION)
-    .meta({ example: QUESTION_THEME_SORT_ORDER_DEFAULT }),
+    .meta({}),
   [LIMIT_QUERY_KEY]: zLimit(),
   status: zQuestionThemeStatus().optional(),
killedBy: Admin Find Question-Themes Query DTO Shape sort-order should have correct metadata when accessing the metadata.
statusReason: expected { Object (description) } to strictly equal { …(2) }
