[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:10:15
 function zIsFullyTranslated(): ZodOptional<ZodCodec<ZodString, ZodBoolean>> {
   return zStringBoolean()
     .optional()
-    .describe("Filters resources by translation completeness: 'true' returns only fully translated resources, 'false' returns only incomplete ones. " +
+    .describe("" +
       "A resource is fully translated when all mandatory LocalizedText/LocalizedTexts fields have a value " +
       "in every applicable locale, and all optional LocalizedText/LocalizedTexts fields are either absent (never translated) " +
killedBy: zIsFullyTranslated should have the correct description when describing the schema.
statusReason: expected 'A resource is fully translated when a…' to be 'Filters resources by translation comp…' // Object.is equality

[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:12:7
     .optional()
     .describe("Filters resources by translation completeness: 'true' returns only fully translated resources, 'false' returns only incomplete ones. " +
       "A resource is fully translated when all mandatory LocalizedText/LocalizedTexts fields have a value " +
-      "in every applicable locale, and all optional LocalizedText/LocalizedTexts fields are either absent (never translated) " +
+      "" +
       "or have a value in every applicable locale. " +
       "Applicable locales come from the resource's applicableLocales field: if absent or empty, " +
killedBy: zIsFullyTranslated should have the correct description when describing the schema.
statusReason: expected 'Filters resources by translation comp…' to be 'Filters resources by translation comp…' // Object.is equality

[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:15:7
       "in every applicable locale, and all optional LocalizedText/LocalizedTexts fields are either absent (never translated) " +
       "or have a value in every applicable locale. " +
       "Applicable locales come from the resource's applicableLocales field: if absent or empty, " +
-      "all 6 supported locales apply (en, fr, es, de, it, pt).");
+      "");
 }
 
killedBy: zIsFullyTranslated should have the correct description when describing the schema.
statusReason: expected 'Filters resources by translation comp…' to be 'Filters resources by translation comp…' // Object.is equality
