[Killed] BlockStatement
api/auth/helpers/auth.helpers.ts:31:59
   expectedHashedApiKey: string,
   hmacSecret: string,
 ): (receivedApiKey: unknown) => void {
-  return function validate(receivedApiKey: unknown): void {
-    validateReceivedApiKey(expectedHashedApiKey, receivedApiKey, hmacSecret);
-  };
+  return function validate(receivedApiKey: unknown): void {};
 }
 
killedBy: Auth Helpers createApiKeyValidator should throw InvalidApiKeyError when the provided API key is invalid.
statusReason: expected function to throw an error, but it didn't

[Killed] CallExpression
api/auth/helpers/auth.helpers.ts:32:5
   hmacSecret: string,
 ): (receivedApiKey: unknown) => void {
   return function validate(receivedApiKey: unknown): void {
-    validateReceivedApiKey(expectedHashedApiKey, receivedApiKey, hmacSecret);
+    ;
   };
 }
killedBy: Auth Helpers createApiKeyValidator should throw InvalidApiKeyError when the provided API key is invalid.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
api/auth/helpers/auth.helpers.ts:36:114
   };
 }
 
-function validateReceivedApiKey(expectedHashedApiKey: string, receivedApiKey: unknown, hmacSecret: string): void {
-  if (typeof receivedApiKey !== "string") {
-    throw new MissingApiKeyError();
-  }
-  const receivedHashedApiKey = hashApiKey(receivedApiKey, hmacSecret);
-
-  const expectedBuffer = Uint8Array.fromHex(expectedHashedApiKey);
-  const receivedBuffer = Uint8Array.fromHex(receivedHashedApiKey);
-
-  const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
-  if (!areKeysSameLength) {
-    throw new InvalidApiKeyError();
-  }
-
-  const areKeysMatching = timingSafeEqual(expectedBuffer, receivedBuffer);
-  if (!areKeysMatching) {
-    throw new InvalidApiKeyError();
-  }
-}
+function validateReceivedApiKey(expectedHashedApiKey: string, receivedApiKey: unknown, hmacSecret: string): void {}
 
 /**
killedBy: Auth Helpers createApiKeyValidator should throw InvalidApiKeyError when the provided API key is invalid.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
api/auth/helpers/auth.helpers.ts:45:29
   const expectedBuffer = Uint8Array.fromHex(expectedHashedApiKey);
   const receivedBuffer = Uint8Array.fromHex(receivedHashedApiKey);
 
-  const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
+  const areKeysSameLength = false;
   if (!areKeysSameLength) {
     throw new InvalidApiKeyError();
killedBy: Auth Helpers createApiKeyValidator should not throw when the provided API key is valid.
statusReason: expected [Function] to not throw an error but 'InvalidApiKeyError: Invalid API key' was thrown

[Killed] ConditionalExpression
api/auth/helpers/auth.helpers.ts:45:29
   const expectedBuffer = Uint8Array.fromHex(expectedHashedApiKey);
   const receivedBuffer = Uint8Array.fromHex(receivedHashedApiKey);
 
-  const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
+  const areKeysSameLength = true;
   if (!areKeysSameLength) {
     throw new InvalidApiKeyError();
killedBy: Auth Helpers validateReceivedApiKey should throw InvalidApiKeyError when received API key is invalid because not same length.
statusReason: expected a thrown error to be InvalidApiKeyError: Invalid API key

[Killed] BooleanLiteral
api/auth/helpers/auth.helpers.ts:46:7
   const receivedBuffer = Uint8Array.fromHex(receivedHashedApiKey);
 
   const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
-  if (!areKeysSameLength) {
+  if (areKeysSameLength) {
     throw new InvalidApiKeyError();
   }
killedBy: Auth Helpers createApiKeyValidator should not throw when the provided API key is valid.
statusReason: expected [Function] to not throw an error but 'InvalidApiKeyError: Invalid API key' was thrown

[Killed] ConditionalExpression
api/auth/helpers/auth.helpers.ts:46:7
   const receivedBuffer = Uint8Array.fromHex(receivedHashedApiKey);
 
   const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
-  if (!areKeysSameLength) {
+  if (false) {
     throw new InvalidApiKeyError();
   }
killedBy: Auth Helpers validateReceivedApiKey should throw InvalidApiKeyError when received API key is invalid because not same length.
statusReason: expected a thrown error to be InvalidApiKeyError: Invalid API key

[Killed] CallExpression
api/auth/helpers/auth.helpers.ts:47:5
 
   const areKeysSameLength = expectedBuffer.length === receivedBuffer.length;
   if (!areKeysSameLength) {
-    throw new InvalidApiKeyError();
+    ;
   }
 
killedBy: Auth Helpers validateReceivedApiKey should throw InvalidApiKeyError when received API key is invalid because not same length.
statusReason: expected a thrown error to be InvalidApiKeyError: Invalid API key

[Killed] BlockStatement
api/auth/helpers/auth.helpers.ts:51:25
   }
 
   const areKeysMatching = timingSafeEqual(expectedBuffer, receivedBuffer);
-  if (!areKeysMatching) {
-    throw new InvalidApiKeyError();
-  }
+  if (!areKeysMatching) {}
 }
 
killedBy: Auth Helpers createApiKeyValidator should throw InvalidApiKeyError when the provided API key is invalid.
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
api/auth/helpers/auth.helpers.ts:51:7
   }
 
   const areKeysMatching = timingSafeEqual(expectedBuffer, receivedBuffer);
-  if (!areKeysMatching) {
+  if (areKeysMatching) {
     throw new InvalidApiKeyError();
   }
killedBy: Auth Helpers createApiKeyValidator should not throw when the provided API key is valid.
statusReason: expected [Function] to not throw an error but 'InvalidApiKeyError: Invalid API key' was thrown

[Killed] CallExpression
api/auth/helpers/auth.helpers.ts:52:5
 
   const areKeysMatching = timingSafeEqual(expectedBuffer, receivedBuffer);
   if (!areKeysMatching) {
-    throw new InvalidApiKeyError();
+    ;
   }
 }
killedBy: Auth Helpers createApiKeyValidator should throw InvalidApiKeyError when the provided API key is invalid.
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
api/auth/helpers/auth.helpers.ts:64:21
   const receivedApiKey = request.headers[API_KEY_HEADER];
   const { game, admin } = configService.authenticationConfig;
 
-  const validator = apiKeyAuthType === "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
+  const validator = apiKeyAuthType !== "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
   try {
     validator(receivedApiKey);
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
api/auth/helpers/auth.helpers.ts:64:21
   const receivedApiKey = request.headers[API_KEY_HEADER];
   const { game, admin } = configService.authenticationConfig;
 
-  const validator = apiKeyAuthType === "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
+  const validator = false ? admin.apiKeyValidator : game.apiKeyValidator;
   try {
     validator(receivedApiKey);
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
api/auth/helpers/auth.helpers.ts:65:7
   const { game, admin } = configService.authenticationConfig;
 
   const validator = apiKeyAuthType === "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
-  try {
-    validator(receivedApiKey);
-  } catch(error) {
+  try {} catch(error) {
     const message = Error.isError(error) ? error.message : "Unauthorized";
 
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't

[Killed] CallExpression
api/auth/helpers/auth.helpers.ts:66:5
 
   const validator = apiKeyAuthType === "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
   try {
-    validator(receivedApiKey);
+    ;
   } catch(error) {
     const message = Error.isError(error) ? error.message : "Unauthorized";
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
api/auth/helpers/auth.helpers.ts:67:18
   const validator = apiKeyAuthType === "admin" ? admin.apiKeyValidator : game.apiKeyValidator;
   try {
     validator(receivedApiKey);
-  } catch(error) {
-    const message = Error.isError(error) ? error.message : "Unauthorized";
-
-    throw new UnauthorizedException(message);
-  }
+  } catch(error) {}
   return true;
 }
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't

[Killed] CallExpression
api/auth/helpers/auth.helpers.ts:70:5
   } catch(error) {
     const message = Error.isError(error) ? error.message : "Unauthorized";
 
-    throw new UnauthorizedException(message);
+    ;
   }
   return true;
killedBy: Auth Helpers canActivateApiKeyGuardHandler should throw UnauthorizedException with error message when API key is invalid for admin auth type and error is type Error.
statusReason: expected function to throw an error, but it didn't
