[Killed] StringLiteral
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:41:147
   addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
 
   if (filters.isFullyTranslated !== undefined) {
-    Object.assign(matchConditions, buildIsFullyTranslatedMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, filters.isFullyTranslated, "$applicableLocales"));
+    Object.assign(matchConditions, buildIsFullyTranslatedMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, filters.isFullyTranslated, ""));
   }
   if (filters.locale !== undefined) {
killedBy: buildQuestionAggregationFilterStages should return a single match stage with all conditions when all filters are defined.
statusReason: expected [ { '$match': { …(6) } } ] to strictly equal [ { '$match': { …(6) } } ]
