[Killed] MethodExpression
application/dto/admin-question/admin-question.dto.shape.ts:13:11
 const ADMIN_QUESTION_DTO = z.strictObject({
   id: zQuestionId(),
   category: zQuestionCategory(),
-  themes: z.array(ADMIN_QUESTION_THEME_ASSIGNMENT_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
-    .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
+  themes: z.array(ADMIN_QUESTION_THEME_ASSIGNMENT_DTO).min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS).min(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .describe("Question's themes"),
   content: ADMIN_QUESTION_CONTENT_DTO,
killedBy: Admin Question DTO Shape should pass validation when a valid AdminQuestionDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown

[Killed] MethodExpression
application/dto/admin-question/admin-question.dto.shape.ts:13:11
 const ADMIN_QUESTION_DTO = z.strictObject({
   id: zQuestionId(),
   category: zQuestionCategory(),
-  themes: z.array(ADMIN_QUESTION_THEME_ASSIGNMENT_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
+  themes: z.array(ADMIN_QUESTION_THEME_ASSIGNMENT_DTO).max(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .describe("Question's themes"),
killedBy: Admin Question DTO Shape themes should throw zod error when themes is empty.
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
application/dto/admin-question/admin-question.dto.shape.ts:16:15
   themes: z.array(ADMIN_QUESTION_THEME_ASSIGNMENT_DTO)
     .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
-    .describe("Question's themes"),
+    .describe(""),
   content: ADMIN_QUESTION_CONTENT_DTO,
   cognitiveDifficulty: zQuestionCognitiveDifficulty(),
killedBy: Admin Question DTO Shape themes should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { description: 'Question\'s themes' }
