[Killed] ObjectLiteral
application/mappers/question-filter-query-dto/question-filter-query-dto.mappers.ts:12:28
 import type { PublicQuestionFilterOptions, QuestionFilterOptions } from "@question/domain/types/question.types";
 
 function createQuestionFilterOptionsFromQueryDto(dto: AdminFindQuestionsQueryDto): Partial<QuestionFilterOptions> | undefined {
-  return pickDefinedValues({
-    status: dto[QUESTION_STATUS_QUERY_KEY],
-    category: dto[QUESTION_CATEGORY_QUERY_KEY],
-    cognitiveDifficulty: dto[QUESTION_COGNITIVE_DIFFICULTY_QUERY_KEY],
-    authorRole: dto[QUESTION_AUTHOR_ROLE_QUERY_KEY],
-    themeIds: dto[QUESTION_THEME_IDS_QUERY_KEY],
-    ids: dto[QUESTION_IDS_QUERY_KEY],
-    isAdultContent: dto[QUESTION_IS_ADULT_CONTENT_QUERY_KEY],
-    isFullyTranslated: dto[FULLY_TRANSLATED_QUERY_KEY],
-  });
+  return pickDefinedValues({});
 }
 
killedBy: AdminQuestionController findQuestions should propagate ids through to the use case when ids is provided in the admin query dto.
statusReason: expected "vi.fn()" to be called once with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
