[Killed] StringLiteral
application/dto/question-modification/question-modification.dto.shape.ts:18:15
   content: QUESTION_CONTENT_MODIFICATION_DTO
     .optional(),
   applicableLocales: zQuestionApplicableLocales(0)
-    .describe("Subset of locales this question is relevant for; submit an empty array to clear the restriction (all locales required again)"),
+    .describe(""),
 });
 
killedBy: Question Modification DTO Shape applicableLocales should have correct description when accessing the description.
statusReason: expected '' to be 'Subset of locales this question is re…' // Object.is equality
