[Killed] StringLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:37:73
 
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
-    addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
+    addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "", difficulties => ({ $in: difficulties }));
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
     Object.assign(matchStage, shake({ isAdultContent: options.isAdultContent }));
killedBy: QuestionMongooseRepository findRandom should add cognitive difficulties to match stage as $in when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,15 @@
  [

[Killed] CallExpression
persistence/mongoose/repository/question.mongoose.repository.ts:40:5
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
     Object.assign(matchStage, shake({ isAdultContent: options.isAdultContent }));
-    Object.assign(
-      matchStage,
-      buildIsApplicableForLocaleMatchCondition(options.locale),
-      buildIsFullyTranslatedForLocaleMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, options.locale),
-    );
+    ;
 
     return matchStage;
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,60 +1,9 @@
  [

[Killed] ArrayDeclaration
persistence/mongoose/repository/question.mongoose.repository.ts:53:86
     const filterStages = buildQuestionAggregationFilterStages(options.filters);
     const sortStages = buildMongooseAggregationSortStages(options.sort, QUESTION_SEMANTIC_SORT_ORDERS);
     const limitStage = hasLimit(options.limit) ? [{ $limit: options.limit }] : [];
-    const questionWithThemes = await this.questionModel.aggregate<QuestionAggregate>([
-      ...filterStages,
-      ...QUESTION_MONGOOSE_REPOSITORY_PIPELINE,
-      ...sortStages,
-      ...limitStage,
-    ]);
+    const questionWithThemes = await this.questionModel.aggregate<QuestionAggregate>([]);
 
     return questionWithThemes.map(createQuestionFromAggregate);
killedBy: QuestionMongooseRepository findAll should aggregate with pipeline and ascending sort stage when sort order is asc.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$unwind': { …(2) } }, …(6) ] ]

Received:

  1st vi.fn() call:

  [
-   [

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:69:9
       ...QUESTION_MONGOOSE_REPOSITORY_PIPELINE,
     ]);
 
-    if (questions.length === 0) {
+    if (false) {
       return undefined;
     }
killedBy: QuestionMongooseRepository findById should not call the mapper when aggregate returns empty array.
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:94:9
   public async assignTheme(questionId: string, questionThemeAssignmentCreationContract: QuestionThemeAssignmentCreationContract): Promise<Question | undefined> {
     const insertPayload = createQuestionThemeAssignmentMongooseInsertPayloadFromContract(questionThemeAssignmentCreationContract);
 
-    if (questionThemeAssignmentCreationContract.isPrimary) {
+    if (false) {
       await this.assignNewPrimaryTheme(questionId, insertPayload);
 
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:100:14
       return this.findById(questionId);
     }
     const update: UpdateQuery<QuestionMongooseDocument> = {
-      $push: { themes: insertPayload },
+      $push: {},
     };
     await this.questionModel.findByIdAndUpdate(questionId, update);
killedBy: QuestionMongooseRepository assignTheme should call model.findByIdAndUpdate with push update when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000020', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000020",

[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:108:29
   }
 
   public async modifyThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<Question | undefined> {
-    if (contract.isPrimary) {
-      await this.promoteToPrimaryThemeAssignment(questionId, themeId, contract);
-
-      return this.findById(questionId);
-    }
+    if (contract.isPrimary) {}
     const fieldsToSet = getDefinedFieldsForMongoArrayElementUpdate(contract, "themes.$[elem]");
     if (Object.keys(fieldsToSet).length > 0) {
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:114:9
       return this.findById(questionId);
     }
     const fieldsToSet = getDefinedFieldsForMongoArrayElementUpdate(contract, "themes.$[elem]");
-    if (Object.keys(fieldsToSet).length > 0) {
+    if (true) {
       const themeObjectId = new Types.ObjectId(themeId);
       await this.questionModel.findByIdAndUpdate(questionId, { $set: fieldsToSet }, { arrayFilters: [{ "elem.themeId": themeObjectId }] });
killedBy: QuestionMongooseRepository modifyThemeAssignment should not call model.findByIdAndUpdate when contract has no fields.
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "618c1f4b3a2f000000000060",

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:116:62
     const fieldsToSet = getDefinedFieldsForMongoArrayElementUpdate(contract, "themes.$[elem]");
     if (Object.keys(fieldsToSet).length > 0) {
       const themeObjectId = new Types.ObjectId(themeId);
-      await this.questionModel.findByIdAndUpdate(questionId, { $set: fieldsToSet }, { arrayFilters: [{ "elem.themeId": themeObjectId }] });
+      await this.questionModel.findByIdAndUpdate(questionId, {}, { arrayFilters: [{ "elem.themeId": themeObjectId }] });
     }
     return this.findById(questionId);
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.findByIdAndUpdate with set update for isHint when contract has isHint.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000040', …(2) ]

Received:

  1st vi.fn() call:

@@ -1,12 +1,8 @@
  [

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:131:14
 
   public async removeTheme(questionId: string, themeId: string): Promise<Question | undefined> {
     const update: UpdateQuery<QuestionMongooseDocument> = {
-      $pull: {
-        themes: { themeId: new Types.ObjectId(themeId) },
-      },
+      $pull: {},
     };
     await this.questionModel.findByIdAndUpdate(questionId, update);
killedBy: QuestionMongooseRepository removeTheme should call model.findByIdAndUpdate with pull update when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000030', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000030",

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:147:15
           themeId: new Types.ObjectId(themeId),
         },
       },
-      status: {
-        $in: [
-          QUESTION_STATUS_PENDING,
-          QUESTION_STATUS_ACTIVE,
-        ],
-      },
+      status: {},
     });
   }
killedBy: QuestionMongooseRepository countLiveByThemeId should call countDocuments with correct query parameters when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { themes: { …(1) }, …(1) } ]

Received:

  1st vi.fn() call:

@@ -1,13 +1,8 @@
  [

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:190:27
       {
         updateOne: {
           filter: { _id: new Types.ObjectId(questionId) },
-          update: { $set: { "themes.$[].isPrimary": false } },
+          update: { $set: {} },
         },
       },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -4,13 +4,11 @@
        "updateOne": {

[Killed] StringLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:205:106
   private async promoteToPrimaryThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<void> {
     const themeObjectId = new Types.ObjectId(themeId);
     const questionObjectId = new Types.ObjectId(questionId);
-    const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: true }, "themes.$[elem]");
+    const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: true }, "");
     await this.questionModel.bulkWrite([
       {
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -22,11 +22,11 @@
          "filter": {

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:216:19
       {
         updateOne: {
           filter: { _id: questionObjectId },
-          update: { $set: targetSetFields },
+          update: {},
           arrayFilters: [{ "elem.themeId": themeObjectId }],
         },
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -20,14 +20,10 @@
            },
