[Killed] ArrayDeclaration
zod/validators/boolean/boolean.zod.validators.ts:6:33
 import type { ZodBoolean, ZodCodec, ZodString } from "zod";
 
 function zStringBoolean(): ZodCodec<ZodString, ZodBoolean> {
-  return z.stringbool({ truthy: ["true"], falsy: ["false"] });
+  return z.stringbool({ truthy: [], falsy: ["false"] });
 }
 
killedBy: Question DTO Zod Validators zQuestionIsAdultContentFilter should parse ''true'' to true when the input is a valid boolean string.
statusReason: [
  {
    "code": "invalid_value",
    "expected": "stringbool",
    "values": [
      "false"
    ],
    "path": [],

[Killed] StringLiteral
zod/validators/boolean/boolean.zod.validators.ts:6:34
 import type { ZodBoolean, ZodCodec, ZodString } from "zod";
 
 function zStringBoolean(): ZodCodec<ZodString, ZodBoolean> {
-  return z.stringbool({ truthy: ["true"], falsy: ["false"] });
+  return z.stringbool({ truthy: [""], falsy: ["false"] });
 }
 
killedBy: Question DTO Zod Validators zQuestionIsAdultContentFilter should parse ''true'' to true when the input is a valid boolean string.
statusReason: [
  {
    "code": "invalid_value",
    "expected": "stringbool",
    "values": [
      "",
      "false"
    ],
