[Killed] MethodExpression
app/dto/app-metadata/app-metadata.dto.shape.ts:6:9
 import { zSlug } from "@shared/infrastructure/http/zod/validators/string/string.zod.validators";
 
 const APP_METADATA_DTO = z.strictObject({
-  name: z.string()
-    .min(1)
+  name: z.string().max(1)
     .describe("Application's name")
     .meta({ example: "Goat It" }),
killedBy: AppMetadata DTO Shape should pass validation when assigned valid values.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] ObjectLiteral
app/dto/app-metadata/app-metadata.dto.shape.ts:9:11
   name: z.string()
     .min(1)
     .describe("Application's name")
-    .meta({ example: "Goat It" }),
+    .meta({}),
   version: z.string()
     .min(1)
killedBy: AppMetadata DTO Shape name should have correct metadata when accessing the meta.
statusReason: expected { description: 'Application\'s name' } to strictly equal { …(2) }

[Killed] StringLiteral
app/dto/app-metadata/app-metadata.dto.shape.ts:9:22
   name: z.string()
     .min(1)
     .describe("Application's name")
-    .meta({ example: "Goat It" }),
+    .meta({ example: "" }),
   version: z.string()
     .min(1)
killedBy: AppMetadata DTO Shape name should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] MethodExpression
app/dto/app-metadata/app-metadata.dto.shape.ts:10:12
     .min(1)
     .describe("Application's name")
     .meta({ example: "Goat It" }),
-  version: z.string()
-    .min(1)
+  version: z.string().max(1)
     .regex(/^\d+\.\d+\.\d+(?:-.+)?$/u)
     .describe("Application's version from package.json")
killedBy: AppMetadata DTO Shape should pass validation when assigned valid values.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] Regex
app/dto/app-metadata/app-metadata.dto.shape.ts:12:12
     .meta({ example: "Goat It" }),
   version: z.string()
     .min(1)
-    .regex(/^\d+\.\d+\.\d+(?:-.+)?$/u)
+    .regex(/^\d+\.\d+\.\d+(?:-.+)?/u)
     .describe("Application's version from package.json")
     .meta({ example: "1.8.0" }),
killedBy: AppMetadata DTO Shape version 'should throw a zod error when assigne…'
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
app/dto/app-metadata/app-metadata.dto.shape.ts:15:16
     .regex(/^\d+\.\d+\.\d+(?:-.+)?$/u)
     .describe("Application's version from package.json")
     .meta({ example: "1.8.0" }),
-  description: z.string()
-    .min(1)
+  description: z.string().max(1)
     .describe("Application's description from package.json")
     .meta({ example: "An AI-powered question and answer platform." }),
killedBy: AppMetadata DTO Shape should pass validation when assigned valid values.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] StringLiteral
app/dto/app-metadata/app-metadata.dto.shape.ts:17:15
     .meta({ example: "1.8.0" }),
   description: z.string()
     .min(1)
-    .describe("Application's description from package.json")
+    .describe("")
     .meta({ example: "An AI-powered question and answer platform." }),
   packageName: zSlug()
killedBy: AppMetadata DTO Shape description should have correct description when accessing the description.
statusReason: expected '' to be 'Application\'s description from packa…' // Object.is equality

[Killed] StringLiteral
app/dto/app-metadata/app-metadata.dto.shape.ts:20:15
     .describe("Application's description from package.json")
     .meta({ example: "An AI-powered question and answer platform." }),
   packageName: zSlug()
-    .describe("Application's package name from package.json")
+    .describe("")
     .meta({ example: "goat-it-api" }),
 });
killedBy: AppMetadata DTO Shape packageName should have correct description when accessing the description.
statusReason: expected '' to be 'Application\'s package name from pack…' // Object.is equality
