[Killed] ObjectLiteral
src/app/helpers/logger.helpers.ts:4:10
 import type { Params as PinoParameters } from "nestjs-pino";
 
 function getLoggerConfiguration(): PinoParameters {
-  return {
-    pinoHttp: {
-      transport: process.env.NODE_ENV === "production" ? undefined : { target: "pino-pretty" },
-    },
-  };
+  return {};
 }
 
killedBy: getLoggerConfiguration should return logger production configuration when env is production.
statusReason: expected {} to strictly equal { pinoHttp: { transport: undefined } }

[Killed] ObjectLiteral
src/app/helpers/logger.helpers.ts:5:15
 
 function getLoggerConfiguration(): PinoParameters {
   return {
-    pinoHttp: {
-      transport: process.env.NODE_ENV === "production" ? undefined : { target: "pino-pretty" },
-    },
+    pinoHttp: {},
   };
 }
killedBy: getLoggerConfiguration should return logger production configuration when env is production.
statusReason: expected { pinoHttp: {} } to strictly equal { pinoHttp: { transport: undefined } }

[Killed] ConditionalExpression
src/app/helpers/logger.helpers.ts:6:18
 function getLoggerConfiguration(): PinoParameters {
   return {
     pinoHttp: {
-      transport: process.env.NODE_ENV === "production" ? undefined : { target: "pino-pretty" },
+      transport: false ? undefined : { target: "pino-pretty" },
     },
   };
killedBy: getLoggerConfiguration should return logger production configuration when env is production.
statusReason: expected { pinoHttp: { transport: { …(1) } } } to strictly equal { pinoHttp: { transport: undefined } }

[Killed] EqualityOperator
src/app/helpers/logger.helpers.ts:6:18
 function getLoggerConfiguration(): PinoParameters {
   return {
     pinoHttp: {
-      transport: process.env.NODE_ENV === "production" ? undefined : { target: "pino-pretty" },
+      transport: process.env.NODE_ENV !== "production" ? undefined : { target: "pino-pretty" },
     },
   };
killedBy: getLoggerConfiguration should return logger production configuration when env is production.
statusReason: expected { pinoHttp: { transport: { …(1) } } } to strictly equal { pinoHttp: { transport: undefined } }
