[Killed] MethodExpression
application/dto/find-random-questions-body/find-random-questions-body.dto.shape.ts:17:10
 } from "@question/application/dto/shared/zod/validators/question.dto.zod.validators";
 
 const FIND_RANDOM_QUESTIONS_BODY_DTO = z.object({
-  limit: z.number()
-    .int()
-    .min(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MINIMUM)
+  limit: z.number().int().max(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MINIMUM)
     .max(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MAXIMUM)
     .optional()
killedBy: Find Random Questions Body DTO Shape should pass validation when a valid dto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "number",\n    …' was thrown

[Killed] MethodExpression
application/dto/find-random-questions-body/find-random-questions-body.dto.shape.ts:17:10
 } from "@question/application/dto/shared/zod/validators/question.dto.zod.validators";
 
 const FIND_RANDOM_QUESTIONS_BODY_DTO = z.object({
-  limit: z.number()
-    .int()
-    .min(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MINIMUM)
-    .max(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MAXIMUM)
+  limit: z.number().int().min(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MINIMUM).min(FIND_RANDOM_QUESTIONS_BODY_LIMIT_MAXIMUM)
     .optional()
     .default(FIND_RANDOM_QUESTIONS_BODY_LIMIT_DEFAULT)
killedBy: Find Random Questions Body DTO Shape should pass validation when a valid dto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "number",\n    …' was thrown
