[Killed] StringLiteral
dto/question/question-content/question-content.dto.shape.ts:17:13
     .optional(),
   trivia: zQuestionTrivia()
     .optional(),
-}).describe("Question's content");
+}).describe("");
 
 export type QuestionContentDto = z.infer<typeof QUESTION_CONTENT_DTO>;
killedBy: Question DTO Shape content should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { description: 'Question\'s content' }
