[Killed] StringLiteral
dto/question/question-theme-assignment/question-theme-assignment.dto.shape.ts:12:15
 
 const QUESTION_THEME_ASSIGNMENT_DTO = z.strictObject({
   theme: QUESTION_THEME_DTO
-    .describe("Question assigned theme"),
+    .describe(""),
   isPrimary: zQuestionThemeAssignmentIsPrimary(),
   isHint: zQuestionThemeAssignmentIsHint(),
killedBy: Question Theme Assignment DTO Shape theme should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { Object (description) }
