[Killed] MethodExpression
dto/question-creation/question-author-creation/question-author-creation.dto.shape.ts:9:9
   role: z.enum(QUESTION_CREATION_AUTHOR_ROLES)
     .describe("Question's author role")
     .meta({ example: QUESTION_CREATION_AUTHOR_ROLES[0] }),
-  name: z.string()
-    .trim()
+  name: z.string()
     .min(QUESTION_AUTHOR_NAME_MIN_LENGTH)
     .max(QUESTION_AUTHOR_NAME_MAX_LENGTH)
killedBy: Question Author Creation DTO Shape name should trim whitespace from name before validation when parsed.
statusReason: expected '   ValidName   ' to be 'ValidName' // Object.is equality

[Killed] MethodExpression
dto/question-creation/question-author-creation/question-author-creation.dto.shape.ts:9:9
   role: z.enum(QUESTION_CREATION_AUTHOR_ROLES)
     .describe("Question's author role")
     .meta({ example: QUESTION_CREATION_AUTHOR_ROLES[0] }),
-  name: z.string()
-    .trim()
-    .min(QUESTION_AUTHOR_NAME_MIN_LENGTH)
-    .max(QUESTION_AUTHOR_NAME_MAX_LENGTH)
+  name: z.string().trim().min(QUESTION_AUTHOR_NAME_MIN_LENGTH).min(QUESTION_AUTHOR_NAME_MAX_LENGTH)
     .describe("Question author's name")
     .meta({ example: "TriviaMaster3000" }),
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] StringLiteral
dto/question-creation/question-author-creation/question-author-creation.dto.shape.ts:13:15
     .trim()
     .min(QUESTION_AUTHOR_NAME_MIN_LENGTH)
     .max(QUESTION_AUTHOR_NAME_MAX_LENGTH)
-    .describe("Question author's name")
+    .describe("")
     .meta({ example: "TriviaMaster3000" }),
 }).describe("Question's author");
killedBy: Question Author Creation DTO Shape name should have correct metadata when accessing the metadata.
statusReason: expected { description: '', …(1) } to strictly equal { …(2) }
