[Killed] StringLiteral
dto/question-modification/question-content-modification/question-content-modification.dto.shape.ts:19:13
     .optional(),
   trivia: zQuestionLocalizedTrivia()
     .optional(),
-}).describe("Question's content modification payload");
+}).describe("");
 
 type QuestionContentModificationDto = z.infer<typeof QUESTION_CONTENT_MODIFICATION_DTO>;
killedBy: Question Content Modification DTO Shape should have correct description when accessing the description.
statusReason: expected '' to be 'Question\'s content modification payl…' // Object.is equality
