[Killed] StringLiteral
application/dto/question-stats/question-stats.dto.shape.ts:22:15
   byCognitiveDifficulty: z.record(z.enum(QUESTION_COGNITIVE_DIFFICULTIES), z.number().int().nonnegative())
     .describe("Number of questions per cognitive difficulty"),
   byAuthorRole: z.record(z.enum(QUESTION_AUTHOR_ROLES), z.number().int().nonnegative())
-    .describe("Number of questions per author role"),
+    .describe(""),
   byRejectionType: z.record(z.enum(QUESTION_REJECTION_TYPES), z.number().int().nonnegative())
     .describe("Number of rejected questions per rejection type"),
killedBy: Question Stats DTO Shape byAuthorRole should have correct description when accessing the description.
statusReason: expected '' to be 'Number of questions per author role' // Object.is equality

[Killed] StringLiteral
application/dto/question-stats/question-stats.dto.shape.ts:24:15
   byAuthorRole: z.record(z.enum(QUESTION_AUTHOR_ROLES), z.number().int().nonnegative())
     .describe("Number of questions per author role"),
   byRejectionType: z.record(z.enum(QUESTION_REJECTION_TYPES), z.number().int().nonnegative())
-    .describe("Number of rejected questions per rejection type"),
+    .describe(""),
   byTranslationCompleteness: zTranslationCompletenessStats()
     .describe("Translation completeness breakdown"),
killedBy: Question Stats DTO Shape byRejectionType should have correct description when accessing the description.
statusReason: expected '' to be 'Number of rejected questions per reje…' // Object.is equality

[Killed] StringLiteral
application/dto/question-stats/question-stats.dto.shape.ts:26:15
   byRejectionType: z.record(z.enum(QUESTION_REJECTION_TYPES), z.number().int().nonnegative())
     .describe("Number of rejected questions per rejection type"),
   byTranslationCompleteness: zTranslationCompletenessStats()
-    .describe("Translation completeness breakdown"),
+    .describe(""),
 });
 
killedBy: Question Stats DTO Shape byTranslationCompleteness should have correct description when accessing the description.
statusReason: expected '' to be 'Translation completeness breakdown' // Object.is equality
