[Killed] StringLiteral
application/dto/question-theme-assignment-modification/question-theme-assignment-modification.dto.shape.ts:7:15
 
 const QUESTION_THEME_ASSIGNMENT_MODIFICATION_DTO = z.object({
   isPrimary: z.literal(true)
-    .describe("Set this theme as the primary theme for the question. Only true is accepted. The current primary will be automatically demoted")
+    .describe("")
     .optional(),
   isHint: zQuestionThemeAssignmentIsHint()
killedBy: Question Theme Assignment Modification DTO Shape isPrimary should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { Object (description) }
