[Killed] ObjectLiteral
dto/shared/question-author/question-author.dto.shape.ts:11:11
 const QUESTION_AUTHOR_DTO = z.strictObject({
   role: z.enum(QUESTION_AUTHOR_ROLES)
     .describe("Question's author role")
-    .meta({ example: QUESTION_AUTHOR_ROLES[0] }),
+    .meta({}),
   gameId: zMongoId()
     .optional()
killedBy: Question Author DTO Shape role should have the correct meta when accessed.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/shared/question-author/question-author.dto.shape.ts:14:15
     .meta({ example: QUESTION_AUTHOR_ROLES[0] }),
   gameId: zMongoId()
     .optional()
-    .describe("Game's unique identifier, if the author is a game"),
+    .describe(""),
   name: z.string()
     .optional()
killedBy: Question Author DTO Shape gameId should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { Object (description) }

[Killed] StringLiteral
dto/shared/question-author/question-author.dto.shape.ts:20:13
     .describe("Question author's name, if applicable")
     .meta({ example: "TriviaMaster3000" }),
 }).refine(isGameIdSetOnGameRole, { error: "Game ID must be set if and only if the author role is 'game'." })
-  .describe("Question's author");
+  .describe("");
 
 export type QuestionAuthorDto = z.infer<typeof QUESTION_AUTHOR_DTO>;
killedBy: Admin Question DTO Shape author should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { description: 'Question\'s author' }
