[Killed] ObjectLiteral
dto/shared/question-rejection/question-rejection.dto.shape.ts:8:11
 const QUESTION_REJECTION_DTO = z.strictObject({
   type: z.enum(QUESTION_REJECTION_TYPES)
     .describe("Question rejection's type")
-    .meta({ example: QUESTION_REJECTION_TYPES[0] }),
+    .meta({}),
   comment: z.string()
     .optional()
killedBy: Question Rejection DTO Shape type should have the correct meta when accessed.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/shared/question-rejection/question-rejection.dto.shape.ts:11:15
     .meta({ example: QUESTION_REJECTION_TYPES[0] }),
   comment: z.string()
     .optional()
-    .describe("Comment explaining the reason for rejection")
+    .describe("")
     .meta({ example: "The question is too ambiguous." }),
 }).describe("Question rejection details");
killedBy: Question Rejection DTO Shape comment should have correct metadata when accessing the metadata.
statusReason: expected { description: '', …(1) } to strictly equal { …(2) }
