[Killed] ConditionalExpression
zod/refinements/question-author/question-author.dto.zod.refinement.ts:11:7
 
 function isGameIdSetOnGameRole(questionAuthorDtoZodRefinement: QuestionAuthorDtoZodRefinement): boolean {
   const { role, gameId } = questionAuthorDtoZodRefinement;
-  if (role === "game") {
+  if (true) {
     return typeof gameId === "string" && gameId.length > 0;
   }
killedBy: Question Author DTO Shape should pass validation when a valid QuestionAuthorDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown

[Killed] EqualityOperator
zod/refinements/question-author/question-author.dto.zod.refinement.ts:11:7
 
 function isGameIdSetOnGameRole(questionAuthorDtoZodRefinement: QuestionAuthorDtoZodRefinement): boolean {
   const { role, gameId } = questionAuthorDtoZodRefinement;
-  if (role === "game") {
+  if (role !== "game") {
     return typeof gameId === "string" && gameId.length > 0;
   }
killedBy: Question Author DTO Shape should pass validation when a valid QuestionAuthorDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown

[Killed] EqualityOperator
zod/refinements/question-author/question-author.dto.zod.refinement.ts:12:42
 function isGameIdSetOnGameRole(questionAuthorDtoZodRefinement: QuestionAuthorDtoZodRefinement): boolean {
   const { role, gameId } = questionAuthorDtoZodRefinement;
   if (role === "game") {
-    return typeof gameId === "string" && gameId.length > 0;
+    return typeof gameId === "string" && gameId.length <= 0;
   }
   return gameId === undefined;
killedBy: Question Author Dto Zod Refinement isGameIdSetOnGameRole 'should return true when role is \'gam…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
zod/refinements/question-author/question-author.dto.zod.refinement.ts:12:12
 function isGameIdSetOnGameRole(questionAuthorDtoZodRefinement: QuestionAuthorDtoZodRefinement): boolean {
   const { role, gameId } = questionAuthorDtoZodRefinement;
   if (role === "game") {
-    return typeof gameId === "string" && gameId.length > 0;
+    return true;
   }
   return gameId === undefined;
killedBy: Question Author DTO Shape isGameIdSetOnGameRole should throw a zod error when role is 'game' and gameId is not set.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
zod/refinements/question-author/question-author.dto.zod.refinement.ts:14:10
   if (role === "game") {
     return typeof gameId === "string" && gameId.length > 0;
   }
-  return gameId === undefined;
+  return false;
 }
 
killedBy: Question Author Dto Zod Refinement isGameIdSetOnGameRole 'should return true when role is \'ai\…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
zod/refinements/question-author/question-author.dto.zod.refinement.ts:14:10
   if (role === "game") {
     return typeof gameId === "string" && gameId.length > 0;
   }
-  return gameId === undefined;
+  return true;
 }
 
killedBy: Question Author DTO Shape isGameIdSetOnGameRole should throw a zod error when role is not 'game' and gameId is set.
statusReason: expected function to throw an error, but it didn't
