[Killed] StringLiteral
zod/validators/question-content/question-content.dto.zod.validators.ts:18:15
 
 function zQuestionStatement(): ZodString {
   return z.string()
-    .describe("Question's statement")
+    .describe("")
     .meta({ example: QUESTION_STATEMENT_EXAMPLE });
 }
killedBy: Question Content DTO Zod Validators zQuestionStatement should have the correct description when called.
statusReason: expected '' to be 'Question\'s statement' // Object.is equality

[Killed] ObjectLiteral
zod/validators/question-content/question-content.dto.zod.validators.ts:19:11
 function zQuestionStatement(): ZodString {
   return z.string()
     .describe("Question's statement")
-    .meta({ example: QUESTION_STATEMENT_EXAMPLE });
+    .meta({});
 }
 
killedBy: Question Content DTO Zod Validators zQuestionStatement should have the correct metadata when called.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
zod/validators/question-content/question-content.dto.zod.validators.ts:29:15
 
 function zQuestionAnswer(): ZodString {
   return z.string()
-    .describe("Question's answer")
+    .describe("")
     .meta({ example: QUESTION_ANSWER_EXAMPLE });
 }
killedBy: Question Content DTO Zod Validators zQuestionAnswer should have the correct description when called.
statusReason: expected '' to be 'Question\'s answer' // Object.is equality

[Killed] StringLiteral
zod/validators/question-content/question-content.dto.zod.validators.ts:51:15
 
 function zQuestionTrivia(): ZodArray<ZodString> {
   return z.array(z.string())
-    .describe("Interesting trivia related to the question")
+    .describe("")
     .meta({ example: QUESTION_TRIVIA_EXAMPLE });
 }
killedBy: Question Content DTO Zod Validators zQuestionTrivia should have the correct description when called.
statusReason: expected '' to be 'Interesting trivia related to the que…' // Object.is equality

[Killed] StringLiteral
zod/validators/question-content/question-content.dto.zod.validators.ts:57:15
 
 function zQuestionLocalizedTrivia(): ZodObject<Record<Locale, ZodOptional<ZodArray<ZodString>>>> {
   return zLocalizedTexts()
-    .describe("Interesting trivia related to the question");
+    .describe("");
 }
 
killedBy: Question Content DTO Zod Validators zQuestionLocalizedTrivia should have the correct description when called.
statusReason: expected '' to be 'Interesting trivia related to the que…' // Object.is equality
