[Killed] StringLiteral
zod/validators/question-theme-assignment/question-theme-assignment.dto.zod.validators.ts:12:15
 
 function zQuestionThemeAssignmentIsHint(): ZodBoolean {
   return z.boolean()
-    .describe("Indicates if the assigned theme is a hint for the question's answer");
+    .describe("");
 }
 
killedBy: Question Theme Assignment Creation DTO Shape isHint should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { Object (description) }
