[Killed] ObjectLiteral
application/mappers/question-filter-query-dto/question-filter-query-dto.mappers.ts:12:28
 import type { PublicQuestionFilterOptions, QuestionFilterOptions } from "@question/domain/types/question.types";
 
 function createQuestionFilterOptionsFromQueryDto(dto: AdminFindQuestionsQueryDto): Partial<QuestionFilterOptions> | undefined {
-  return pickDefinedValues({
-    status: dto[QUESTION_STATUS_QUERY_KEY],
-    category: dto[QUESTION_CATEGORY_QUERY_KEY],
-    cognitiveDifficulty: dto[QUESTION_COGNITIVE_DIFFICULTY_QUERY_KEY],
-    authorRole: dto[QUESTION_AUTHOR_ROLE_QUERY_KEY],
-    themeIds: dto[QUESTION_THEME_IDS_QUERY_KEY],
-    ids: dto[QUESTION_IDS_QUERY_KEY],
-    isFullyTranslated: dto[FULLY_TRANSLATED_QUERY_KEY],
-  });
+  return pickDefinedValues({});
 }
 
killedBy: createQuestionFilterOptionsFromQueryDto should return all filter options when all filter fields are provided.
statusReason: expected undefined to strictly equal { status: 'active', …(6) }
