[Killed] ObjectLiteral
question/application/mappers/question-theme-assignment.mappers.ts:21:14
   return {
     questionId,
     themeId,
-    payload: {
-      isPrimary: dto.isPrimary,
-      isHint: dto.isHint,
-    },
+    payload: {},
   };
 }
killedBy: createQuestionThemeAssignmentModificationCommandFromDto should create a command with questionId, themeId and payload from dto when called.
statusReason: expected { questionId: 'q-1', …(2) } to strictly equal { questionId: 'q-1', …(2) }
