[Killed] BlockStatement
application/use-cases/archive-question/archive-question.use-case.ts:25:73
     return archivedQuestion;
   }
 
-  private async throwIfQuestionNotArchivable(id: string): Promise<void> {
-    const question = await this.questionRepository.findById(id);
-    if (!question) {
-      throw new QuestionNotFoundError(id);
-    }
-    if (question.status === QUESTION_STATUS_ARCHIVED) {
-      throw new QuestionAlreadyArchivedError(id);
-    }
-  }
+  private async throwIfQuestionNotArchivable(id: string): Promise<void> {}
 }
killedBy: ArchiveQuestionUseCase throwIfQuestionNotArchivable should throw QuestionNotFoundError when question is not found.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
application/use-cases/archive-question/archive-question.use-case.ts:30:9
     if (!question) {
       throw new QuestionNotFoundError(id);
     }
-    if (question.status === QUESTION_STATUS_ARCHIVED) {
+    if (true) {
       throw new QuestionAlreadyArchivedError(id);
     }
killedBy: ArchiveQuestionUseCase archive should call repository.archive when called.
statusReason: Question with id question-id-1 already has status 'archived'

[Killed] ConditionalExpression
application/use-cases/archive-question/archive-question.use-case.ts:30:9
     if (!question) {
       throw new QuestionNotFoundError(id);
     }
-    if (question.status === QUESTION_STATUS_ARCHIVED) {
+    if (false) {
       throw new QuestionAlreadyArchivedError(id);
     }
killedBy: ArchiveQuestionUseCase throwIfQuestionNotArchivable should throw QuestionAlreadyArchivedError when question is already archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
application/use-cases/archive-question/archive-question.use-case.ts:31:7
       throw new QuestionNotFoundError(id);
     }
     if (question.status === QUESTION_STATUS_ARCHIVED) {
-      throw new QuestionAlreadyArchivedError(id);
+      ;
     }
   }
killedBy: ArchiveQuestionUseCase throwIfQuestionNotArchivable should throw QuestionAlreadyArchivedError when question is already archived.
statusReason: promise resolved "undefined" instead of rejecting
