[Killed] BlockStatement
application/use-cases/create-question/create-question.use-case.ts:30:108
     return question;
   }
 
-  private async throwIfQuestionNotCreatable(questionCreateCommand: QuestionCreationCommand): Promise<void> {
-    const themeIds = new Set(questionCreateCommand.payload.themes.map(themeAssignment => themeAssignment.themeId));
-
-    const questionThemes = await this.getQuestionThemesByIdsOrThrowUseCase.getByIdsOrThrow(themeIds);
-    const archivedQuestionTheme = findArchivedQuestionTheme(questionThemes);
-    if (archivedQuestionTheme) {
-      throw new ReferencedQuestionThemeArchivedError(archivedQuestionTheme.id);
-    }
-  }
+  private async throwIfQuestionNotCreatable(questionCreateCommand: QuestionCreationCommand): Promise<void> {}
 }
killedBy: CreateQuestionUseCase throwIfQuestionNotCreatable should call getQuestionThemesByIdsOrThrow.getByIdsOrThrow with theme ids when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ Set{ 'ea36abf7ceef05fa2aab1d34' } ]

Number of calls: 0

[Killed] BlockStatement
application/use-cases/create-question/create-question.use-case.ts:35:32
 
     const questionThemes = await this.getQuestionThemesByIdsOrThrowUseCase.getByIdsOrThrow(themeIds);
     const archivedQuestionTheme = findArchivedQuestionTheme(questionThemes);
-    if (archivedQuestionTheme) {
-      throw new ReferencedQuestionThemeArchivedError(archivedQuestionTheme.id);
-    }
+    if (archivedQuestionTheme) {}
   }
 }
killedBy: CreateQuestionUseCase throwIfQuestionNotCreatable should throw ReferencedQuestionThemeArchivedError when some referenced theme is archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
application/use-cases/create-question/create-question.use-case.ts:36:7
     const questionThemes = await this.getQuestionThemesByIdsOrThrowUseCase.getByIdsOrThrow(themeIds);
     const archivedQuestionTheme = findArchivedQuestionTheme(questionThemes);
     if (archivedQuestionTheme) {
-      throw new ReferencedQuestionThemeArchivedError(archivedQuestionTheme.id);
+      ;
     }
   }
killedBy: CreateQuestionUseCase throwIfQuestionNotCreatable should throw ReferencedQuestionThemeArchivedError when some referenced theme is archived.
statusReason: promise resolved "undefined" instead of rejecting
