[Killed] BlockStatement
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:36:162
     return updatedQuestion;
   }
 
-  private async throwIfThemeNotAssignableToQuestion(questionThemeAssignmentContract: QuestionThemeAssignmentCreationContract, questionId: string): Promise<void> {
-    const question = await this.findQuestionByIdUseCase.getById(questionId);
-    const questionTheme = await this.findQuestionThemeByIdUseCase.getById(questionThemeAssignmentContract.themeId);
-
-    const existingThemeAssignment = findQuestionThemeAssignmentInQuestionByThemeId(question, questionTheme.id);
-    if (existingThemeAssignment) {
-      throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
-    }
-    if (isQuestionThemeArchived(questionTheme)) {
-      throw new ReferencedQuestionThemeArchivedError(questionTheme.id);
-    }
-  }
+  private async throwIfThemeNotAssignableToQuestion(questionThemeAssignmentContract: QuestionThemeAssignmentCreationContract, questionId: string): Promise<void> {}
 }
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw QuestionThemeAssignmentAlreadyExistsError when theme already assigned.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:41:9
     const questionTheme = await this.findQuestionThemeByIdUseCase.getById(questionThemeAssignmentContract.themeId);
 
     const existingThemeAssignment = findQuestionThemeAssignmentInQuestionByThemeId(question, questionTheme.id);
-    if (existingThemeAssignment) {
+    if (true) {
       throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
     }
killedBy: AssignThemeToQuestionUseCase assign should call repository.assignTheme with payload when called.
statusReason: Question theme assignment with id 8fe3a4bfa227fba621a09304 already exists in question with id q-1

[Killed] BlockStatement
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:41:34
     const questionTheme = await this.findQuestionThemeByIdUseCase.getById(questionThemeAssignmentContract.themeId);
 
     const existingThemeAssignment = findQuestionThemeAssignmentInQuestionByThemeId(question, questionTheme.id);
-    if (existingThemeAssignment) {
-      throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
-    }
+    if (existingThemeAssignment) {}
     if (isQuestionThemeArchived(questionTheme)) {
       throw new ReferencedQuestionThemeArchivedError(questionTheme.id);
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw QuestionThemeAssignmentAlreadyExistsError when theme already assigned.
statusReason: expected a thrown error to be QuestionThemeAssignmentAlreadyExistsError: …

[Killed] CallExpression
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:42:7
 
     const existingThemeAssignment = findQuestionThemeAssignmentInQuestionByThemeId(question, questionTheme.id);
     if (existingThemeAssignment) {
-      throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
+      ;
     }
     if (isQuestionThemeArchived(questionTheme)) {
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw QuestionThemeAssignmentAlreadyExistsError when theme already assigned.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:44:49
     if (existingThemeAssignment) {
       throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
     }
-    if (isQuestionThemeArchived(questionTheme)) {
-      throw new ReferencedQuestionThemeArchivedError(questionTheme.id);
-    }
+    if (isQuestionThemeArchived(questionTheme)) {}
   }
 }
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw ReferencedQuestionThemeArchivedError when theme is archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:44:9
     if (existingThemeAssignment) {
       throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
     }
-    if (isQuestionThemeArchived(questionTheme)) {
+    if (false) {
       throw new ReferencedQuestionThemeArchivedError(questionTheme.id);
     }
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw ReferencedQuestionThemeArchivedError when theme is archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
use-cases/question-theme-assignment/assign-theme-to-question/assign-theme-to-question.use-case.ts:45:7
       throw new QuestionThemeAssignmentAlreadyExistsError(questionTheme.id, questionId);
     }
     if (isQuestionThemeArchived(questionTheme)) {
-      throw new ReferencedQuestionThemeArchivedError(questionTheme.id);
+      ;
     }
   }
killedBy: AssignThemeToQuestionUseCase throwIfThemeNotAssignableToQuestion should throw ReferencedQuestionThemeArchivedError when theme is archived.
statusReason: promise resolved "undefined" instead of rejecting
