[Killed] BlockStatement
use-cases/question-theme-assignment/modify-question-theme-assignment/modify-question-theme-assignment.use-case.ts:29:105
     return updatedQuestion;
   }
 
-  private async throwIfThemeAssignmentNotModifiable(questionId: string, themeId: string): Promise<void> {
-    const question = await this.findQuestionByIdUseCase.getById(questionId);
-    ensureQuestionThemeAssignmentIsModifiable(question, themeId);
-  }
+  private async throwIfThemeAssignmentNotModifiable(questionId: string, themeId: string): Promise<void> {}
 }
killedBy: ModifyQuestionThemeAssignmentUseCase throwIfThemeAssignmentNotModifiable should throw QuestionThemeAssignmentAbsentError when theme is not assigned to question.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
use-cases/question-theme-assignment/modify-question-theme-assignment/modify-question-theme-assignment.use-case.ts:31:5
 
   private async throwIfThemeAssignmentNotModifiable(questionId: string, themeId: string): Promise<void> {
     const question = await this.findQuestionByIdUseCase.getById(questionId);
-    ensureQuestionThemeAssignmentIsModifiable(question, themeId);
+    ;
   }
 }
killedBy: ModifyQuestionThemeAssignmentUseCase throwIfThemeAssignmentNotModifiable should throw QuestionThemeAssignmentAbsentError when theme is not assigned to question.
statusReason: promise resolved "undefined" instead of rejecting
