[Killed] BlockStatement
use-cases/question-theme-assignment/remove-theme-from-question/remove-theme-from-question.use-case.ts:31:106
     return updatedQuestion;
   }
 
-  private async throwIfThemeNotRemovableFromQuestion(questionId: string, themeId: string): Promise<void> {
-    const question = await this.findQuestionByIdUseCase.getById(questionId);
-    ensureQuestionThemeAssignmentIsRemovable(question, themeId);
-
-    if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {
-      throw new QuestionMinimumThemesError(questionId);
-    }
-  }
+  private async throwIfThemeNotRemovableFromQuestion(questionId: string, themeId: string): Promise<void> {}
 }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionMinimumThemesError when question has minimum themes.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
use-cases/question-theme-assignment/remove-theme-from-question/remove-theme-from-question.use-case.ts:33:5
 
   private async throwIfThemeNotRemovableFromQuestion(questionId: string, themeId: string): Promise<void> {
     const question = await this.findQuestionByIdUseCase.getById(questionId);
-    ensureQuestionThemeAssignmentIsRemovable(question, themeId);
+    ;
 
     if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionThemeAssignmentAbsentError when question has no themes.
statusReason: expected a thrown error to be QuestionThemeAssignmentAbsentError: Quest…

[Killed] ConditionalExpression
use-cases/question-theme-assignment/remove-theme-from-question/remove-theme-from-question.use-case.ts:35:9
     const question = await this.findQuestionByIdUseCase.getById(questionId);
     ensureQuestionThemeAssignmentIsRemovable(question, themeId);
 
-    if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {
+    if (false) {
       throw new QuestionMinimumThemesError(questionId);
     }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionMinimumThemesError when question has minimum themes.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
use-cases/question-theme-assignment/remove-theme-from-question/remove-theme-from-question.use-case.ts:35:73
     const question = await this.findQuestionByIdUseCase.getById(questionId);
     ensureQuestionThemeAssignmentIsRemovable(question, themeId);
 
-    if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {
-      throw new QuestionMinimumThemesError(questionId);
-    }
+    if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {}
   }
 }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionMinimumThemesError when question has minimum themes.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
use-cases/question-theme-assignment/remove-theme-from-question/remove-theme-from-question.use-case.ts:36:7
     ensureQuestionThemeAssignmentIsRemovable(question, themeId);
 
     if (question.themes.length <= QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS) {
-      throw new QuestionMinimumThemesError(questionId);
+      ;
     }
   }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionMinimumThemesError when question has minimum themes.
statusReason: promise resolved "undefined" instead of rejecting
