[Killed] StringLiteral
domain/errors/question-not-found/question-not-found.error.ts:3:11
 export class QuestionNotFoundError extends Error {
   public constructor(questionId: string) {
-    super(`Question with id ${questionId} not found`);
+    super(``);
     this.name = "QuestionNotFoundError";
   }
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,12 +1,12 @@
  [
