[Killed] StringLiteral
domain/errors/question-primary-theme-assignment-not-removable/question-primary-theme-assignment-not-removable.error.ts:3:11
 export class QuestionPrimaryThemeAssignmentNotRemovableError extends Error {
   public constructor(questionThemeId: string, questionId: string) {
-    super(`Primary question theme with id ${questionThemeId} cannot be removed from question with id ${questionId}. Switch primary to another theme first`);
+    super(``);
     this.name = "QuestionPrimaryThemeAssignmentNotRemovableError";
   }
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,12 +1,12 @@
  [
