[Killed] StringLiteral
domain/errors/question-theme-assignment-absent/question-theme-assignment-absent.error.ts:4:17
 export class QuestionThemeAssignmentAbsentError extends Error {
   public constructor(questionThemeId: string, questionId: string) {
     super(`Question theme with id ${questionThemeId} is not assigned to question with id ${questionId}`);
-    this.name = "QuestionThemeAssignmentAbsentError";
+    this.name = "";
   }
 }
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,18 +1,16 @@
  [
