[Killed] StringLiteral
domain/errors/question-theme-assignment-already-exists/question-theme-assignment-already-exists.error.ts:3:11
 export class QuestionThemeAssignmentAlreadyExistsError extends Error {
   public constructor(questionThemeAssignmentId: string, questionId: string) {
-    super(`Question theme assignment with id ${questionThemeAssignmentId} already exists in question with id ${questionId}`);
+    super(``);
     this.name = "QuestionThemeAssignmentAlreadyExistsError";
   }
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,12 +1,12 @@
  [

[Killed] StringLiteral
domain/errors/question-theme-assignment-already-exists/question-theme-assignment-already-exists.error.ts:4:17
 export class QuestionThemeAssignmentAlreadyExistsError extends Error {
   public constructor(questionThemeAssignmentId: string, questionId: string) {
     super(`Question theme assignment with id ${questionThemeAssignmentId} already exists in question with id ${questionId}`);
-    this.name = "QuestionThemeAssignmentAlreadyExistsError";
+    this.name = "";
   }
 }
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,18 +1,16 @@
  [
