[Killed] StringLiteral
domain/errors/question-theme-assignment-creation/question-theme-assignment-creation.error.ts:4:17
 export class QuestionThemeAssignmentCreationError extends Error {
   public constructor(questionThemeId: string, questionId: string) {
     super(`Question theme with id ${questionThemeId} could not be assigned in question with id ${questionId}`);
-    this.name = "QuestionThemeAssignmentCreationError";
+    this.name = "";
   }
 }
killedBy: QuestionThemeAssignmentCreationError should have correct name when constructed.
statusReason: expected '' to be 'QuestionThemeAssignmentCreationError' // Object.is equality
