[Killed] StringLiteral
domain/errors/question-theme-assignment-modification/question-theme-assignment-modification.error.ts:3:11
 export class QuestionThemeAssignmentModificationError extends Error {
   public constructor(questionThemeId: string, questionId: string) {
-    super(`Question theme assignment with id ${questionThemeId} could not be modified in question with id ${questionId}`);
+    super(``);
     this.name = "QuestionThemeAssignmentModificationError";
   }
killedBy: QuestionThemeAssignmentModificationError should set message when constructed.
statusReason: expected '' to be 'Question theme assignment with id t1 …' // Object.is equality
