[Killed] ConditionalExpression
question/domain/rules/question.rules.ts:8:7
 import type { QuestionCreationAuthorRole, QuestionCreationStatus, QuestionThemeAssignment } from "@question/domain/types/question.value-objects";
 
 function computeQuestionStatusFromAuthorRole(authorRole: QuestionCreationAuthorRole): QuestionCreationStatus {
-  if (authorRole === QUESTION_AUTHOR_ROLE_ADMIN) {
+  if (false) {
     return QUESTION_STATUS_ACTIVE;
   }
killedBy: computeQuestionStatusFromAuthorRole 'should return active when author role…'
statusReason: expected 'pending' to be 'active' // Object.is equality

[Killed] BlockStatement
question/domain/rules/question.rules.ts:8:50
 import type { QuestionCreationAuthorRole, QuestionCreationStatus, QuestionThemeAssignment } from "@question/domain/types/question.value-objects";
 
 function computeQuestionStatusFromAuthorRole(authorRole: QuestionCreationAuthorRole): QuestionCreationStatus {
-  if (authorRole === QUESTION_AUTHOR_ROLE_ADMIN) {
-    return QUESTION_STATUS_ACTIVE;
-  }
+  if (authorRole === QUESTION_AUTHOR_ROLE_ADMIN) {}
   return QUESTION_STATUS_PENDING;
 }
killedBy: computeQuestionStatusFromAuthorRole 'should return active when author role…'
statusReason: expected 'pending' to be 'active' // Object.is equality

[Killed] EqualityOperator
question/domain/rules/question.rules.ts:15:46
 }
 
 function findQuestionThemeAssignmentInQuestionByThemeId(question: Question, questionThemeAssignmentId: string): QuestionThemeAssignment | undefined {
-  return question.themes.find(({ theme }) => theme.id === questionThemeAssignmentId);
+  return question.themes.find(({ theme }) => theme.id !== questionThemeAssignmentId);
 }
 
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionMinimumThemesError when question has minimum themes.
statusReason: expected a thrown error to be QuestionMinimumThemesError: Question with…

[Killed] ConditionalExpression
question/domain/rules/question.rules.ts:15:46
 }
 
 function findQuestionThemeAssignmentInQuestionByThemeId(question: Question, questionThemeAssignmentId: string): QuestionThemeAssignment | undefined {
-  return question.themes.find(({ theme }) => theme.id === questionThemeAssignmentId);
+  return question.themes.find(({ theme }) => false);
 }
 
killedBy: ModifyQuestionThemeAssignmentUseCase modify should call repository.modifyThemeAssignment with command when called.
statusReason: Question theme with id theme-1 is not assigned to question with id facae1e8aae6e9cfcfbfdfbf

[Killed] BlockStatement
question/domain/rules/question.rules.ts:18:94
   return question.themes.find(({ theme }) => theme.id === questionThemeAssignmentId);
 }
 
-function ensureQuestionThemeAssignmentIsRemovable(question: Question, themeId: string): void {
-  const assignment = findQuestionThemeAssignmentInQuestionByThemeId(question, themeId);
-  if (!assignment) {
-    throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
-  }
-  if (assignment.isPrimary) {
-    throw new QuestionPrimaryThemeAssignmentNotRemovableError(themeId, question.id);
-  }
-}
+function ensureQuestionThemeAssignmentIsRemovable(question: Question, themeId: string): void {}
 
 function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {
killedBy: ensureQuestionThemeAssignmentIsRemovable should throw QuestionThemeAssignmentAbsentError when the theme is not assigned to the question.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
question/domain/rules/question.rules.ts:23:29
   if (!assignment) {
     throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
   }
-  if (assignment.isPrimary) {
-    throw new QuestionPrimaryThemeAssignmentNotRemovableError(themeId, question.id);
-  }
+  if (assignment.isPrimary) {}
 }
 
killedBy: ensureQuestionThemeAssignmentIsRemovable should throw QuestionPrimaryThemeAssignmentNotRemovableError when the theme assignment is primary.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
question/domain/rules/question.rules.ts:23:7
   if (!assignment) {
     throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
   }
-  if (assignment.isPrimary) {
+  if (false) {
     throw new QuestionPrimaryThemeAssignmentNotRemovableError(themeId, question.id);
   }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionPrimaryThemeAssignmentNotRemovableError when theme is primary.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
question/domain/rules/question.rules.ts:24:5
     throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
   }
   if (assignment.isPrimary) {
-    throw new QuestionPrimaryThemeAssignmentNotRemovableError(themeId, question.id);
+    ;
   }
 }
killedBy: RemoveThemeFromQuestionUseCase throwIfThemeNotRemovableFromQuestion should throw QuestionPrimaryThemeAssignmentNotRemovableError when theme is primary.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
question/domain/rules/question.rules.ts:28:95
   }
 }
 
-function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {
-  const assignment = findQuestionThemeAssignmentInQuestionByThemeId(question, themeId);
-  if (!assignment) {
-    throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
-  }
-}
+function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {}
 
 export {
killedBy: ensureQuestionThemeAssignmentIsModifiable should throw QuestionThemeAssignmentAbsentError when the theme is not assigned to the question.
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
question/domain/rules/question.rules.ts:30:7
 
 function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {
   const assignment = findQuestionThemeAssignmentInQuestionByThemeId(question, themeId);
-  if (!assignment) {
+  if (assignment) {
     throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
   }
killedBy: ensureQuestionThemeAssignmentIsModifiable should not throw when the theme is assigned to the question.
statusReason: expected [Function] to not throw an error but 'QuestionThemeAssignmentAbsentError: Q…' was thrown

[Killed] BlockStatement
question/domain/rules/question.rules.ts:30:20
 
 function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {
   const assignment = findQuestionThemeAssignmentInQuestionByThemeId(question, themeId);
-  if (!assignment) {
-    throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
-  }
+  if (!assignment) {}
 }
 
killedBy: ModifyQuestionThemeAssignmentUseCase throwIfThemeAssignmentNotModifiable should throw QuestionThemeAssignmentAbsentError when theme is not assigned to question.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
question/domain/rules/question.rules.ts:31:5
 function ensureQuestionThemeAssignmentIsModifiable(question: Question, themeId: string): void {
   const assignment = findQuestionThemeAssignmentInQuestionByThemeId(question, themeId);
   if (!assignment) {
-    throw new QuestionThemeAssignmentAbsentError(themeId, question.id);
+    ;
   }
 }
killedBy: ensureQuestionThemeAssignmentIsModifiable should throw QuestionThemeAssignmentAbsentError when the theme is not assigned to the question.
statusReason: expected function to throw an error, but it didn't
