[Killed] ConditionalExpression
persistence/mongoose/errors/question.mongoose.errors.ts:3:26
 class QuestionPersistenceMappingError extends Error {
   public constructor(questionId: string, details?: string) {
-    const causeMessage = details === undefined ? "" : ` Cause: ${details}`;
+    const causeMessage = false ? "" : ` Cause: ${details}`;
 
     super(`Failed to map Question with ID '${questionId}' from persistence layer.${causeMessage}`);
killedBy: QuestionPersistenceMappingError should not include details in the message when not provided.
statusReason: expected 'Failed to map Question with ID \'ques…' to be 'Failed to map Question with ID \'ques…' // Object.is equality

[Killed] ConditionalExpression
persistence/mongoose/errors/question.mongoose.errors.ts:3:26
 class QuestionPersistenceMappingError extends Error {
   public constructor(questionId: string, details?: string) {
-    const causeMessage = details === undefined ? "" : ` Cause: ${details}`;
+    const causeMessage = true ? "" : ` Cause: ${details}`;
 
     super(`Failed to map Question with ID '${questionId}' from persistence layer.${causeMessage}`);
killedBy: QuestionPersistenceMappingError should include details in the message when provided.
statusReason: expected 'Failed to map Question with ID \'ques…' to be 'Failed to map Question with ID \'ques…' // Object.is equality

[Killed] StringLiteral
persistence/mongoose/errors/question.mongoose.errors.ts:5:11
   public constructor(questionId: string, details?: string) {
     const causeMessage = details === undefined ? "" : ` Cause: ${details}`;
 
-    super(`Failed to map Question with ID '${questionId}' from persistence layer.${causeMessage}`);
+    super(``);
     this.name = "QuestionPersistenceMappingError";
   }
killedBy: QuestionPersistenceMappingError should include details in the message when provided.
statusReason: expected '' to be 'Failed to map Question with ID \'ques…' // Object.is equality
