[Killed] ObjectLiteral
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:15:10
 import type { QuestionFilterOptions } from "@question/domain/types/question.types";
 
 function buildIsApplicableForLocaleMatchCondition(locale: Locale): Record<string, unknown> {
-  return {
-    $or: [
-      { applicableLocales: { $exists: false } },
-      { applicableLocales: { $size: 0 } },
-      { applicableLocales: locale },
-    ],
-  };
+  return {};
 }
 
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -36,25 +36,10 @@
                  },

[Killed] BooleanLiteral
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:17:39
 function buildIsApplicableForLocaleMatchCondition(locale: Locale): Record<string, unknown> {
   return {
     $or: [
-      { applicableLocales: { $exists: false } },
+      { applicableLocales: { $exists: true } },
       { applicableLocales: { $size: 0 } },
       { applicableLocales: locale },
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -39,11 +39,11 @@
            },

[Killed] ObjectLiteral
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:17:28
 function buildIsApplicableForLocaleMatchCondition(locale: Locale): Record<string, unknown> {
   return {
     $or: [
-      { applicableLocales: { $exists: false } },
+      { applicableLocales: {} },
       { applicableLocales: { $size: 0 } },
       { applicableLocales: locale },
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -38,13 +38,11 @@
              ],

[Killed] ObjectLiteral
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:18:28
   return {
     $or: [
       { applicableLocales: { $exists: false } },
-      { applicableLocales: { $size: 0 } },
+      { applicableLocales: {} },
       { applicableLocales: locale },
     ],
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -43,13 +43,11 @@
              "applicableLocales": {

[Killed] ArrowFunction
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:36:81
     "author.role": filters.authorRole,
   });
 
-  addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+  addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", () => undefined);
   addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
 
killedBy: buildQuestionAggregationFilterStages should return a match stage with themes.themeId $in ObjectIds when themeIds is defined.
statusReason: expected [ { '$match': { …(1) } } ] to strictly equal [ { '$match': { …(1) } } ]

[Killed] ArrowFunction
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:36:104
     "author.role": filters.authorRole,
   });
 
-  addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+  addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(() => undefined) }));
   addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
 
killedBy: buildQuestionAggregationFilterStages should return a match stage with themes.themeId $in ObjectIds when themeIds is defined.
statusReason: expected [ { '$match': { …(1) } } ] to strictly equal [ { '$match': { …(1) } } ]

[Killed] ArrowFunction
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:37:88
   });
 
   addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
-  addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+  addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(() => undefined) }));
 
   if (filters.isFullyTranslated !== undefined) {
killedBy: buildQuestionAggregationFilterStages should return a match stage with _id $in ObjectIds when ids is defined.
statusReason: expected [ { '$match': { _id: { …(1) } } } ] to strictly equal [ { '$match': { _id: { …(1) } } } ]

[Killed] ArrowFunction
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:37:65
   });
 
   addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
-  addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+  addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", () => undefined);
 
   if (filters.isFullyTranslated !== undefined) {
killedBy: buildQuestionAggregationFilterStages should return a match stage with _id $in ObjectIds when ids is defined.
statusReason: expected [ { '$match': { _id: undefined } } ] to strictly equal [ { '$match': { _id: { …(1) } } } ]

[Killed] BlockStatement
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:39:48
   addArrayFilterIfNonEmpty(filters.themeIds, matchConditions, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
   addArrayFilterIfNonEmpty(filters.ids, matchConditions, "_id", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
 
-  if (filters.isFullyTranslated !== undefined) {
-    Object.assign(matchConditions, buildIsFullyTranslatedMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, filters.isFullyTranslated, "$applicableLocales"));
-  }
+  if (filters.isFullyTranslated !== undefined) {}
   if (filters.locale !== undefined) {
     Object.assign(matchConditions, buildIsApplicableForLocaleMatchCondition(filters.locale));
killedBy: buildQuestionAggregationFilterStages should return a single match stage with all conditions when all filters are defined.
statusReason: expected [ { '$match': { …(5) } } ] to strictly equal [ { '$match': { …(6) } } ]

[Killed] BlockStatement
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:42:37
   if (filters.isFullyTranslated !== undefined) {
     Object.assign(matchConditions, buildIsFullyTranslatedMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, filters.isFullyTranslated, "$applicableLocales"));
   }
-  if (filters.locale !== undefined) {
-    Object.assign(matchConditions, buildIsApplicableForLocaleMatchCondition(filters.locale));
-  }
+  if (filters.locale !== undefined) {}
 
   if (Object.keys(matchConditions).length === 0) {
killedBy: buildQuestionAggregationFilterStages should return a match stage including the locale condition when locale is provided.
statusReason: expected [] to strictly equal [ { '$match': { '$or': [ …(3) ] } } ]

[Killed] CallExpression
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:43:5
     Object.assign(matchConditions, buildIsFullyTranslatedMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, filters.isFullyTranslated, "$applicableLocales"));
   }
   if (filters.locale !== undefined) {
-    Object.assign(matchConditions, buildIsApplicableForLocaleMatchCondition(filters.locale));
+    ;
   }
 
killedBy: buildQuestionAggregationFilterStages should return a match stage including the locale condition when locale is provided.
statusReason: expected [] to strictly equal [ { '$match': { '$or': [ …(3) ] } } ]

[Killed] ConditionalExpression
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:46:7
     Object.assign(matchConditions, buildIsApplicableForLocaleMatchCondition(filters.locale));
   }
 
-  if (Object.keys(matchConditions).length === 0) {
+  if (false) {
     return [];
   }
killedBy: buildQuestionAggregationFilterStages should return an empty array when no filter fields are defined.
statusReason: expected [ { '$match': {} } ] to strictly equal []

[Killed] BlockStatement
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:46:50
     Object.assign(matchConditions, buildIsApplicableForLocaleMatchCondition(filters.locale));
   }
 
-  if (Object.keys(matchConditions).length === 0) {
-    return [];
-  }
+  if (Object.keys(matchConditions).length === 0) {}
   return [{ $match: matchConditions }];
 }
killedBy: buildQuestionAggregationFilterStages should return an empty array when no filter fields are defined.
statusReason: expected [ { '$match': {} } ] to strictly equal []

[Killed] ArrayDeclaration
mongoose/repository/helpers/question-filter.mongoose.helpers.ts:49:10
   if (Object.keys(matchConditions).length === 0) {
     return [];
   }
-  return [{ $match: matchConditions }];
+  return [];
 }
 
killedBy: buildQuestionAggregationFilterStages should return a match stage with expected conditions when filter is undefined
statusReason: expected [] to strictly equal [ { '$match': { status: 'pending' } } ]
