[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:32:49
   public constructor(@InjectModel(QuestionMongooseSchema.name) private readonly questionModel: Model<QuestionMongooseDocument>) {}
 
   private static composeFindRandomMatchStage(options: FindRandomQuestionsOptions): Record<string, unknown> {
-    const matchStage: Record<string, unknown> = { status: QUESTION_STATUS_ACTIVE };
+    const matchStage: Record<string, unknown> = {};
 
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -51,11 +51,10 @@
            },

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:34:94
   private static composeFindRandomMatchStage(options: FindRandomQuestionsOptions): Record<string, unknown> {
     const matchStage: Record<string, unknown> = { status: QUESTION_STATUS_ACTIVE };
 
-    addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
+    addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(() => undefined) }));
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
killedBy: QuestionMongooseRepository findRandom should add excluded ids to match stage as ObjectId $nin when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -53,12 +53,12 @@
              "applicableLocales": "en",

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:34:70
   private static composeFindRandomMatchStage(options: FindRandomQuestionsOptions): Record<string, unknown> {
     const matchStage: Record<string, unknown> = { status: QUESTION_STATUS_ACTIVE };
 
-    addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
+    addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", () => undefined);
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
killedBy: QuestionMongooseRepository findRandom should add excluded ids to match stage as ObjectId $nin when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -51,16 +51,11 @@
            },

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:35:74
     const matchStage: Record<string, unknown> = { status: QUESTION_STATUS_ACTIVE };
 
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
-    addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
+    addArrayFilterIfNonEmpty(options.categories, matchStage, "category", () => undefined);
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
killedBy: QuestionMongooseRepository findRandom should add categories to match stage as $in when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -51,16 +51,11 @@
            },

[Killed] StringLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:35:62
     const matchStage: Record<string, unknown> = { status: QUESTION_STATUS_ACTIVE };
 
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
-    addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
+    addArrayFilterIfNonEmpty(options.categories, matchStage, "", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
killedBy: QuestionMongooseRepository findRandom should add categories to match stage as $in when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,15 @@
  [

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:36:96
 
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
-    addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
+    addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", () => undefined);
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
     Object.assign(
killedBy: QuestionMongooseRepository findRandom should add cognitive difficulties to match stage as $in when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -51,16 +51,11 @@
            },

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:37:101
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
-    addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+    addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(() => undefined) }));
     Object.assign(
       matchStage,
killedBy: QuestionMongooseRepository findRandom should add theme ids to match stage as ObjectId $in on nested themeId when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -54,12 +54,12 @@
            },

[Killed] ArrowFunction
persistence/mongoose/repository/question.mongoose.repository.ts:37:78
     addArrayFilterIfNonEmpty(options.excludedIds, matchStage, "_id", ids => ({ $nin: ids.map(id => new Types.ObjectId(id)) }));
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
-    addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
+    addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", () => undefined);
     Object.assign(
       matchStage,
killedBy: QuestionMongooseRepository findRandom should add theme ids to match stage as ObjectId $in on nested themeId when provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(4) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -52,16 +52,11 @@
            {

[Killed] CallExpression
persistence/mongoose/repository/question.mongoose.repository.ts:38:5
     addArrayFilterIfNonEmpty(options.categories, matchStage, "category", categories => ({ $in: categories }));
     addArrayFilterIfNonEmpty(options.cognitiveDifficulties, matchStage, "cognitiveDifficulty", difficulties => ({ $in: difficulties }));
     addArrayFilterIfNonEmpty(options.themeIds, matchStage, "themes.themeId", ids => ({ $in: ids.map(id => new Types.ObjectId(id)) }));
-    Object.assign(
-      matchStage,
-      buildIsApplicableForLocaleMatchCondition(options.locale),
-      buildIsFullyTranslatedForLocaleMatchCondition(QUESTION_TRANSLATION_COMPLETENESS_FIELD_SPECS, options.locale),
-    );
+    ;
 
     return matchStage;
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,60 +1,9 @@
  [

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:63:17
 
   public async findById(id: string): Promise<Question | undefined> {
     const questions = await this.questionModel.aggregate<QuestionAggregate>([
-      { $match: { _id: new Types.ObjectId(id) } },
+      { $match: {} },
       ...QUESTION_MONGOOSE_REPOSITORY_PIPELINE,
     ]);
killedBy: QuestionMongooseRepository findById should aggregate with pipeline when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(1) } }, …(6) ] ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,9 @@
  [

[Killed] EqualityOperator
persistence/mongoose/repository/question.mongoose.repository.ts:67:9
       ...QUESTION_MONGOOSE_REPOSITORY_PIPELINE,
     ]);
 
-    if (questions.length === 0) {
+    if (questions.length !== 0) {
       return undefined;
     }
killedBy: QuestionMongooseRepository findById should map and return question when aggregate returns one.
statusReason: expected "vi.fn()" to be called once with arguments: [ { …(12) } ]

Number of calls: 0

[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:67:33
       ...QUESTION_MONGOOSE_REPOSITORY_PIPELINE,
     ]);
 
-    if (questions.length === 0) {
-      return undefined;
-    }
+    if (questions.length === 0) {}
     return createQuestionFromAggregate(questions[0]);
   }
killedBy: QuestionMongooseRepository findById should not call the mapper when aggregate returns empty array.
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:81:59
   }
 
   public async archive(id: string): Promise<Question | undefined> {
-    const update: UpdateQuery<QuestionMongooseDocument> = {
-      status: QUESTION_STATUS_ARCHIVED,
-    };
+    const update: UpdateQuery<QuestionMongooseDocument> = {};
     await this.questionModel.findByIdAndUpdate(id, update);
 
killedBy: QuestionMongooseRepository archive should call model.findByIdAndUpdate with archived status when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000010', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000010",

[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:92:60
   public async assignTheme(questionId: string, questionThemeAssignmentCreationContract: QuestionThemeAssignmentCreationContract): Promise<Question | undefined> {
     const insertPayload = createQuestionThemeAssignmentMongooseInsertPayloadFromContract(questionThemeAssignmentCreationContract);
 
-    if (questionThemeAssignmentCreationContract.isPrimary) {
-      await this.assignNewPrimaryTheme(questionId, insertPayload);
-
-      return this.findById(questionId);
-    }
+    if (questionThemeAssignmentCreationContract.isPrimary) {}
     const update: UpdateQuery<QuestionMongooseDocument> = {
       $push: { themes: insertPayload },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:92:9
   public async assignTheme(questionId: string, questionThemeAssignmentCreationContract: QuestionThemeAssignmentCreationContract): Promise<Question | undefined> {
     const insertPayload = createQuestionThemeAssignmentMongooseInsertPayloadFromContract(questionThemeAssignmentCreationContract);
 
-    if (questionThemeAssignmentCreationContract.isPrimary) {
+    if (true) {
       await this.assignNewPrimaryTheme(questionId, insertPayload);
 
killedBy: QuestionMongooseRepository assignTheme should call model.findByIdAndUpdate with push update when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000020', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:106:9
   }
 
   public async modifyThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<Question | undefined> {
-    if (contract.isPrimary) {
+    if (true) {
       await this.promoteToPrimaryThemeAssignment(questionId, themeId, contract);
 
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.findByIdAndUpdate with set update for isHint when contract has isHint.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000040', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
persistence/mongoose/repository/question.mongoose.repository.ts:106:9
   }
 
   public async modifyThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<Question | undefined> {
-    if (contract.isPrimary) {
+    if (false) {
       await this.promoteToPrimaryThemeAssignment(questionId, themeId, contract);
 
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:112:46
       return this.findById(questionId);
     }
     const fieldsToSet = getDefinedFieldsForMongoArrayElementUpdate(contract, "themes.$[elem]");
-    if (Object.keys(fieldsToSet).length > 0) {
-      const themeObjectId = new Types.ObjectId(themeId);
-      await this.questionModel.findByIdAndUpdate(questionId, { $set: fieldsToSet }, { arrayFilters: [{ "elem.themeId": themeObjectId }] });
-    }
+    if (Object.keys(fieldsToSet).length > 0) {}
     return this.findById(questionId);
   }
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.findByIdAndUpdate with set update for isHint when contract has isHint.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000040', …(2) ]

Number of calls: 0

[Killed] EqualityOperator
persistence/mongoose/repository/question.mongoose.repository.ts:112:9
       return this.findById(questionId);
     }
     const fieldsToSet = getDefinedFieldsForMongoArrayElementUpdate(contract, "themes.$[elem]");
-    if (Object.keys(fieldsToSet).length > 0) {
+    if (Object.keys(fieldsToSet).length <= 0) {
       const themeObjectId = new Types.ObjectId(themeId);
       await this.questionModel.findByIdAndUpdate(questionId, { $set: fieldsToSet }, { arrayFilters: [{ "elem.themeId": themeObjectId }] });
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.findByIdAndUpdate with set update for isHint when contract has isHint.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000040', …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:139:46
   }
 
   public async countLiveByThemeId(themeId: string): Promise<number> {
-    return this.questionModel.countDocuments({
-      themes: {
-        $elemMatch: {
-          themeId: new Types.ObjectId(themeId),
-        },
-      },
-      status: {
-        $in: [
-          QUESTION_STATUS_PENDING,
-          QUESTION_STATUS_ACTIVE,
-        ],
-      },
-    });
+    return this.questionModel.countDocuments({});
   }
 
killedBy: QuestionMongooseRepository countLiveByThemeId should call countDocuments with correct query parameters when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { themes: { …(1) }, …(1) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:140:15
 
   public async countLiveByThemeId(themeId: string): Promise<number> {
     return this.questionModel.countDocuments({
-      themes: {
-        $elemMatch: {
-          themeId: new Types.ObjectId(themeId),
-        },
-      },
+      themes: {},
       status: {
         $in: [
killedBy: QuestionMongooseRepository countLiveByThemeId should call countDocuments with correct query parameters when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { themes: { …(1) }, …(1) } ]

Received:

  1st vi.fn() call:

@@ -4,12 +4,8 @@
        "$in": [

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:141:21
   public async countLiveByThemeId(themeId: string): Promise<number> {
     return this.questionModel.countDocuments({
       themes: {
-        $elemMatch: {
-          themeId: new Types.ObjectId(themeId),
-        },
+        $elemMatch: {},
       },
       status: {
killedBy: QuestionMongooseRepository countLiveByThemeId should call countDocuments with correct query parameters when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { themes: { …(1) }, …(1) } ]

Received:

  1st vi.fn() call:

@@ -5,11 +5,9 @@
          "pending",

[Killed] OptionalChaining
persistence/mongoose/repository/question.mongoose.repository.ts:170:14
     const [result] = await this.questionModel.aggregate<QuestionStatsAggregationResult>(QUESTION_STATS_MONGOOSE_REPOSITORY_PIPELINE);
 
     return {
-      total: result.totalStage[0]?.count ?? 0,
+      total: result.totalStage[0].count ?? 0,
       byStatus: result.byStatusStage[0] ?? {},
       byCategory: result.byCategoryStage[0] ?? {},
killedBy: QuestionMongooseRepository getStats should return total as 0 when totalStage is empty.
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:170:14
     const [result] = await this.questionModel.aggregate<QuestionStatsAggregationResult>(QUESTION_STATS_MONGOOSE_REPOSITORY_PIPELINE);
 
     return {
-      total: result.totalStage[0]?.count ?? 0,
+      total: result.totalStage[0]?.count && 0,
       byStatus: result.byStatusStage[0] ?? {},
       byCategory: result.byCategoryStage[0] ?? {},
killedBy: QuestionMongooseRepository getStats should return total from the $facet result when called.
statusReason: expected +0 to be 5 // Object.is equality

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:171:17
 
     return {
       total: result.totalStage[0]?.count ?? 0,
-      byStatus: result.byStatusStage[0] ?? {},
+      byStatus: result.byStatusStage[0] && {},
       byCategory: result.byCategoryStage[0] ?? {},
       byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] ?? {},
killedBy: QuestionMongooseRepository getStats should return partial record for byStatus when aggregation rows are provided.
statusReason: expected {} to strictly equal { active: 3, pending: 2 }

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:172:19
     return {
       total: result.totalStage[0]?.count ?? 0,
       byStatus: result.byStatusStage[0] ?? {},
-      byCategory: result.byCategoryStage[0] ?? {},
+      byCategory: result.byCategoryStage[0] && {},
       byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] ?? {},
       byAuthorRole: result.byAuthorRoleStage[0] ?? {},
killedBy: QuestionMongooseRepository getStats should return partial record for byCategory when aggregation rows are provided.
statusReason: expected {} to strictly equal { trivia: 5 }

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:173:30
       total: result.totalStage[0]?.count ?? 0,
       byStatus: result.byStatusStage[0] ?? {},
       byCategory: result.byCategoryStage[0] ?? {},
-      byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] ?? {},
+      byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] && {},
       byAuthorRole: result.byAuthorRoleStage[0] ?? {},
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
killedBy: QuestionMongooseRepository getStats should return partial record for byCognitiveDifficulty when aggregation rows are provided.
statusReason: expected {} to strictly equal { medium: 5 }

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:174:21
       byStatus: result.byStatusStage[0] ?? {},
       byCategory: result.byCategoryStage[0] ?? {},
       byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] ?? {},
-      byAuthorRole: result.byAuthorRoleStage[0] ?? {},
+      byAuthorRole: result.byAuthorRoleStage[0] && {},
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
       byTranslationCompleteness: {
killedBy: QuestionMongooseRepository getStats should return partial record for byAuthorRole when aggregation rows are provided.
statusReason: expected {} to strictly equal { admin: 5 }

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:175:24
       byCategory: result.byCategoryStage[0] ?? {},
       byCognitiveDifficulty: result.byCognitiveDifficultyStage[0] ?? {},
       byAuthorRole: result.byAuthorRoleStage[0] ?? {},
-      byRejectionType: result.byRejectionTypeStage[0] ?? {},
+      byRejectionType: result.byRejectionTypeStage[0] && {},
       byTranslationCompleteness: {
         fullyTranslated: result.fullyTranslatedCountStage[0]?.count ?? 0,
killedBy: QuestionMongooseRepository getStats should return partial record for byRejectionType when aggregation rows are provided.
statusReason: expected {} to strictly equal { 'duplicate-question': 1 }

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:177:26
       byAuthorRole: result.byAuthorRoleStage[0] ?? {},
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
       byTranslationCompleteness: {
-        fullyTranslated: result.fullyTranslatedCountStage[0]?.count ?? 0,
+        fullyTranslated: result.fullyTranslatedCountStage[0]?.count && 0,
         incomplete: result.incompleteTranslationCountStage[0]?.count ?? 0,
       },
killedBy: QuestionMongooseRepository getStats should return fullyTranslated count from the $facet result when called.
statusReason: expected +0 to be 4 // Object.is equality

[Killed] OptionalChaining
persistence/mongoose/repository/question.mongoose.repository.ts:177:26
       byAuthorRole: result.byAuthorRoleStage[0] ?? {},
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
       byTranslationCompleteness: {
-        fullyTranslated: result.fullyTranslatedCountStage[0]?.count ?? 0,
+        fullyTranslated: result.fullyTranslatedCountStage[0].count ?? 0,
         incomplete: result.incompleteTranslationCountStage[0]?.count ?? 0,
       },
killedBy: QuestionMongooseRepository getStats should return zero for fullyTranslated and incomplete when translation count stages are empty.
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] LogicalOperator
persistence/mongoose/repository/question.mongoose.repository.ts:178:21
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
       byTranslationCompleteness: {
         fullyTranslated: result.fullyTranslatedCountStage[0]?.count ?? 0,
-        incomplete: result.incompleteTranslationCountStage[0]?.count ?? 0,
+        incomplete: result.incompleteTranslationCountStage[0]?.count && 0,
       },
     };
killedBy: QuestionMongooseRepository getStats should return incomplete count from the $facet result when called.
statusReason: expected +0 to be 1 // Object.is equality

[Killed] OptionalChaining
persistence/mongoose/repository/question.mongoose.repository.ts:178:21
       byRejectionType: result.byRejectionTypeStage[0] ?? {},
       byTranslationCompleteness: {
         fullyTranslated: result.fullyTranslatedCountStage[0]?.count ?? 0,
-        incomplete: result.incompleteTranslationCountStage[0]?.count ?? 0,
+        incomplete: result.incompleteTranslationCountStage[0].count ?? 0,
       },
     };
killedBy: QuestionMongooseRepository getStats should return zero for fullyTranslated and incomplete when translation count stages are empty.
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:183:135
     };
   }
 
-  private async assignNewPrimaryTheme(questionId: string, insertPayload: QuestionThemeAssignmentMongooseInsertPayload): Promise<void> {
-    await this.questionModel.bulkWrite([
-      {
-        updateOne: {
-          filter: { _id: new Types.ObjectId(questionId) },
-          update: { $set: { "themes.$[].isPrimary": false } },
-        },
-      },
-      {
-        updateOne: {
-          filter: { _id: new Types.ObjectId(questionId) },
-          update: { $push: { themes: insertPayload } },
-        },
-      },
-    ]);
-  }
+  private async assignNewPrimaryTheme(questionId: string, insertPayload: QuestionThemeAssignmentMongooseInsertPayload): Promise<void> {}
 
   private async promoteToPrimaryThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<void> {
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] BooleanLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:188:53
       {
         updateOne: {
           filter: { _id: new Types.ObjectId(questionId) },
-          update: { $set: { "themes.$[].isPrimary": false } },
+          update: { $set: { "themes.$[].isPrimary": true } },
         },
       },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -5,11 +5,11 @@
          "filter": {

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:188:19
       {
         updateOne: {
           filter: { _id: new Types.ObjectId(questionId) },
-          update: { $set: { "themes.$[].isPrimary": false } },
+          update: {},
         },
       },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -3,15 +3,11 @@
      {

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:193:19
       },
       {
         updateOne: {
-          filter: { _id: new Types.ObjectId(questionId) },
+          filter: {},
           update: { $push: { themes: insertPayload } },
         },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -12,13 +12,11 @@
          },

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:194:19
       {
         updateOne: {
           filter: { _id: new Types.ObjectId(questionId) },
-          update: { $push: { themes: insertPayload } },
+          update: {},
         },
       },
killedBy: QuestionMongooseRepository assignTheme should call model.bulkWrite with demotion and push when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -15,18 +15,10 @@
      {
