[Killed] BlockStatement
persistence/mongoose/repository/question.mongoose.repository.ts:200:156
     ]);
   }
 
-  private async promoteToPrimaryThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<void> {
-    const themeObjectId = new Types.ObjectId(themeId);
-    const questionObjectId = new Types.ObjectId(questionId);
-    const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: true }, "themes.$[elem]");
-    await this.questionModel.bulkWrite([
-      {
-        updateOne: {
-          filter: { _id: questionObjectId },
-          update: { $set: { "themes.$[].isPrimary": false } },
-        },
-      },
-      {
-        updateOne: {
-          filter: { _id: questionObjectId },
-          update: { $set: targetSetFields },
-          arrayFilters: [{ "elem.themeId": themeObjectId }],
-        },
-      },
-    ]);
-  }
+  private async promoteToPrimaryThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<void> {}
 }
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Number of calls: 0

[Killed] BooleanLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:203:98
   private async promoteToPrimaryThemeAssignment(questionId: string, themeId: string, contract: QuestionThemeAssignmentModificationContract): Promise<void> {
     const themeObjectId = new Types.ObjectId(themeId);
     const questionObjectId = new Types.ObjectId(questionId);
-    const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: true }, "themes.$[elem]");
+    const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: false }, "themes.$[elem]");
     await this.questionModel.bulkWrite([
       {
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -22,11 +22,11 @@
          "filter": {

[Killed] ArrayDeclaration
persistence/mongoose/repository/question.mongoose.repository.ts:204:40
     const themeObjectId = new Types.ObjectId(themeId);
     const questionObjectId = new Types.ObjectId(questionId);
     const targetSetFields = getDefinedFieldsForMongoArrayElementUpdate({ ...contract, isPrimary: true }, "themes.$[elem]");
-    await this.questionModel.bulkWrite([
-      {
-        updateOne: {
-          filter: { _id: questionObjectId },
-          update: { $set: { "themes.$[].isPrimary": false } },
-        },
-      },
-      {
-        updateOne: {
-          filter: { _id: questionObjectId },
-          update: { $set: targetSetFields },
-          arrayFilters: [{ "elem.themeId": themeObjectId }],
-        },
-      },
-    ]);
+    await this.questionModel.bulkWrite([]);
   }
 }
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

  [
-   [

[Killed] BooleanLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:208:53
       {
         updateOne: {
           filter: { _id: questionObjectId },
-          update: { $set: { "themes.$[].isPrimary": false } },
+          update: { $set: { "themes.$[].isPrimary": true } },
         },
       },
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -5,11 +5,11 @@
          "filter": {

[Killed] ObjectLiteral
persistence/mongoose/repository/question.mongoose.repository.ts:208:19
       {
         updateOne: {
           filter: { _id: questionObjectId },
-          update: { $set: { "themes.$[].isPrimary": false } },
+          update: {},
         },
       },
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -3,15 +3,11 @@
      {

[Killed] ArrayDeclaration
persistence/mongoose/repository/question.mongoose.repository.ts:215:25
         updateOne: {
           filter: { _id: questionObjectId },
           update: { $set: targetSetFields },
-          arrayFilters: [{ "elem.themeId": themeObjectId }],
+          arrayFilters: [],
         },
       },
killedBy: QuestionMongooseRepository modifyThemeAssignment should call model.bulkWrite with demotion and promotion when contract has isPrimary true.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { updateOne: { …(2) } }, …(1) ] ]

Received:

  1st vi.fn() call:

@@ -12,15 +12,11 @@
          },
