[Killed] ObjectLiteral
application/dto/find-question-themes-query/find-question-themes-query.dto.shape.ts:16:11
     .optional()
     .default(QUESTION_THEME_SORT_BY_DEFAULT)
     .describe(QUESTION_THEME_SORT_BY_DESCRIPTION)
-    .meta({ example: QUESTION_THEME_SORT_BY_DEFAULT }),
+    .meta({}),
   [SORT_ORDER_QUERY_KEY]: z.enum(SORT_ORDERS)
     .optional()
killedBy: Find Question-Themes Query DTO Shape sort-by should have correct metadata when accessing the metadata.
statusReason: expected { Object (description) } to strictly equal { …(2) }
