[Killed] StringLiteral
application/dto/question-theme-stats/question-theme-stats.dto.shape.ts:14:36
     .describe("Number of question themes per status"),
   byQuestionCount: z
     .array(z.strictObject({
-      themeId: z.string().describe("Theme's unique identifier"),
+      themeId: z.string().describe(""),
       themeSlug: z.string().describe("Theme's slug"),
       activeQuestionCount: z
killedBy: Question Theme Stats DTO Shape byQuestionCount themeId should have correct description when accessing the nested element description.
statusReason: expected '' to be 'Theme\'s unique identifier' // Object.is equality

[Killed] StringLiteral
application/dto/question-theme-stats/question-theme-stats.dto.shape.ts:15:38
   byQuestionCount: z
     .array(z.strictObject({
       themeId: z.string().describe("Theme's unique identifier"),
-      themeSlug: z.string().describe("Theme's slug"),
+      themeSlug: z.string().describe(""),
       activeQuestionCount: z
         .number()
killedBy: Question Theme Stats DTO Shape byQuestionCount themeSlug should have correct description when accessing the nested element description.
statusReason: expected '' to be 'Theme\'s slug' // Object.is equality
