[Killed] StringLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:21:15
 
 function zQuestionThemeId(): ZodString {
   return zMongoId()
-    .describe("Question Theme's unique identifier");
+    .describe("");
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeId should have the correct description when called.
statusReason: expected '' to be 'Question Theme\'s unique identifier' // Object.is equality

[Killed] StringLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:38:15
 
 function zQuestionThemeLocalizedLabel(): ZodObject<Record<Locale, ZodOptional<ZodString>>> {
   return zLocalizedText()
-    .describe("Question Theme's label");
+    .describe("");
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedLabel should have the correct description when called.
statusReason: expected '' to be 'Question Theme\'s label' // Object.is equality

[Killed] StringLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:43:15
 
 function zQuestionThemeAliases(): ZodArray<ZodString> {
   return z.array(z.string())
-    .describe("Question Theme's aliases")
+    .describe("")
     .meta({ example: QUESTION_THEME_ALIASES_EXAMPLE });
 }
killedBy: Question Theme DTO Zod Validators zQuestionThemeAliases should have the correct description when called.
statusReason: expected '' to be 'Question Theme\'s aliases' // Object.is equality

[Killed] StringLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:49:15
 
 function zQuestionThemeLocalizedAliases(): ZodObject<Record<Locale, ZodOptional<ZodArray<ZodString>>>> {
   return zLocalizedTexts()
-    .describe("Question Theme's aliases");
+    .describe("");
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedAliases should have the correct description when called.
statusReason: expected '' to be 'Question Theme\'s aliases' // Object.is equality

[Killed] StringLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:60:15
 
 function zQuestionThemeLocalizedDescription(): ZodObject<Record<Locale, ZodOptional<ZodString>>> {
   return zLocalizedText()
-    .describe("Question Theme's description");
+    .describe("");
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedDescription should have the correct description when called.
statusReason: expected '' to be 'Question Theme\'s description' // Object.is equality

[Killed] ObjectLiteral
dto/zod/validators/question-theme.dto.zod.validators.ts:71:11
 function zQuestionThemeStatus(): ZodEnum<QuestionThemeStatusEnum> {
   return z.enum(QUESTION_THEME_STATUSES)
     .describe("Question Theme's status")
-    .meta({ example: QUESTION_THEME_STATUSES[0] });
+    .meta({});
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeStatus should have the correct metadata when called.
statusReason: expected { Object (description) } to strictly equal { …(2) }
