[Killed] ObjectLiteral
application/mappers/question-theme-filter-query-dto/question-theme-filter-query-dto.mappers.ts:9:28
 import type { AdminQuestionThemeFilterOptions } from "@question-theme/domain/types/question-theme.types";
 
 function createAdminQuestionThemeFilterOptionsFromQueryDto(dto: AdminFindQuestionThemesQueryDto): Partial<AdminQuestionThemeFilterOptions> | undefined {
-  return pickDefinedValues({
-    status: dto.status,
-    isFullyTranslated: dto[FULLY_TRANSLATED_QUERY_KEY],
-  });
+  return pickDefinedValues({});
 }
 
killedBy: createAdminQuestionThemeFilterOptionsFromQueryDto should return filter options with status when status is provided.
statusReason: expected undefined to strictly equal { status: 'active' }
