[Killed] ObjectLiteral
question-theme/application/mappers/question-theme.mappers.ts:56:14
 function createQuestionThemeModificationCommandFromDto(questionThemeId: string, questionThemeModificationDto: QuestionThemeModificationDto): QuestionThemeModificationCommand {
   return {
     questionThemeId,
-    payload: {
-      slug: questionThemeModificationDto.slug,
-      label: questionThemeModificationDto.label,
-      aliases: questionThemeModificationDto.aliases,
-      description: questionThemeModificationDto.description,
-      color: questionThemeModificationDto.color,
-    },
+    payload: {},
   };
 }
killedBy: createQuestionThemeModificationCommandFromDto should return mapped QuestionThemeModificationCommand when called.
statusReason: expected { …(2) } to strictly equal { …(2) }
