[Killed] BlockStatement
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:35:78
     return archivedQuestionTheme;
   }
 
-  private async throwIfQuestionThemeNotArchivable(id: string): Promise<void> {
-    const questionTheme = await this.questionThemeRepository.findById(id);
-    if (!questionTheme) {
-      throw new QuestionThemeNotFoundError(id);
-    }
-    if (questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED) {
-      throw new QuestionThemeAlreadyArchivedError(id);
-    }
-  }
+  private async throwIfQuestionThemeNotArchivable(id: string): Promise<void> {}
 
   private async throwIfLiveQuestionsReferenceTheme(id: string): Promise<void> {
killedBy: ArchiveQuestionThemeUseCase throwIfQuestionThemeNotArchivable should throw an error when question theme to archive is not found.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:40:9
     if (!questionTheme) {
       throw new QuestionThemeNotFoundError(id);
     }
-    if (questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED) {
+    if (false) {
       throw new QuestionThemeAlreadyArchivedError(id);
     }
killedBy: ArchiveQuestionThemeUseCase throwIfQuestionThemeNotArchivable should throw an error when question theme to archive is already archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:40:9
     if (!questionTheme) {
       throw new QuestionThemeNotFoundError(id);
     }
-    if (questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED) {
+    if (questionTheme.status !== QUESTION_THEME_STATUS_ARCHIVED) {
       throw new QuestionThemeAlreadyArchivedError(id);
     }
killedBy: ArchiveQuestionThemeUseCase archive should archive a question theme from repository when called.
statusReason: Question theme with id question-theme-id-1 already has status 'archived'

[Killed] CallExpression
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:41:7
       throw new QuestionThemeNotFoundError(id);
     }
     if (questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED) {
-      throw new QuestionThemeAlreadyArchivedError(id);
+      ;
     }
   }
killedBy: ArchiveQuestionThemeUseCase throwIfQuestionThemeNotArchivable should throw an error when question theme to archive is already archived.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:45:79
     }
   }
 
-  private async throwIfLiveQuestionsReferenceTheme(id: string): Promise<void> {
-    const liveQuestionCount = await this.questionRepository.countLiveByThemeId(id);
-    ensureNoLiveQuestionsReferenceTheme(liveQuestionCount, id);
-  }
+  private async throwIfLiveQuestionsReferenceTheme(id: string): Promise<void> {}
 }
killedBy: ArchiveQuestionThemeUseCase throwIfLiveQuestionsReferenceTheme should throw QuestionThemeReferencedByLiveQuestionsError when live questions reference the theme.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
application/use-cases/archive-question-theme/archive-question-theme.use-case.ts:47:5
 
   private async throwIfLiveQuestionsReferenceTheme(id: string): Promise<void> {
     const liveQuestionCount = await this.questionRepository.countLiveByThemeId(id);
-    ensureNoLiveQuestionsReferenceTheme(liveQuestionCount, id);
+    ;
   }
 }
killedBy: ArchiveQuestionThemeUseCase throwIfLiveQuestionsReferenceTheme should throw QuestionThemeReferencedByLiveQuestionsError when live questions reference the theme.
statusReason: promise resolved "undefined" instead of rejecting
