[Killed] BlockStatement
application/use-cases/create-question-theme/create-question-theme.use-case.ts:23:125
     return this.questionThemeRepository.create(payload);
   }
 
-  private async throwIfQuestionThemeNotCreatable(questionThemeCreationCommand: QuestionThemeCreationCommand): Promise<void> {
-    const { payload } = questionThemeCreationCommand;
-    const questionTheme = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionTheme) {
-      throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
-    }
-  }
+  private async throwIfQuestionThemeNotCreatable(questionThemeCreationCommand: QuestionThemeCreationCommand): Promise<void> {}
 }
killedBy: CreateQuestionThemeUseCase throwIfQuestionThemeNotCreatable should throw an error when question theme slug already exists.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
application/use-cases/create-question-theme/create-question-theme.use-case.ts:26:9
   private async throwIfQuestionThemeNotCreatable(questionThemeCreationCommand: QuestionThemeCreationCommand): Promise<void> {
     const { payload } = questionThemeCreationCommand;
     const questionTheme = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionTheme) {
+    if (false) {
       throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
     }
killedBy: CreateQuestionThemeUseCase throwIfQuestionThemeNotCreatable should throw an error when question theme slug already exists.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
application/use-cases/create-question-theme/create-question-theme.use-case.ts:26:24
   private async throwIfQuestionThemeNotCreatable(questionThemeCreationCommand: QuestionThemeCreationCommand): Promise<void> {
     const { payload } = questionThemeCreationCommand;
     const questionTheme = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionTheme) {
-      throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
-    }
+    if (questionTheme) {}
   }
 }
killedBy: CreateQuestionThemeUseCase throwIfQuestionThemeNotCreatable should throw an error when question theme slug already exists.
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
application/use-cases/create-question-theme/create-question-theme.use-case.ts:27:7
     const { payload } = questionThemeCreationCommand;
     const questionTheme = await this.questionThemeRepository.findBySlug(payload.slug);
     if (questionTheme) {
-      throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
+      ;
     }
   }
killedBy: CreateQuestionThemeUseCase throwIfQuestionThemeNotCreatable should throw an error when question theme slug already exists.
statusReason: promise resolved "undefined" instead of rejecting
