[Killed] BlockStatement
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:15:111
   public constructor(@Inject(QUESTION_THEME_REPOSITORY_TOKEN)
   private readonly questionThemeRepository: QuestionThemeRepository) {}
 
-  private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {
-    for (const id of requestedIds) {
-      if (!foundIds.has(id)) {
-        throw new QuestionThemeNotFoundError(id);
-      }
-    }
-  }
+  private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {}
 
   public async getByIdsOrThrow(ids: Set<string>): Promise<QuestionTheme[]> {
killedBy: GetQuestionThemesByIdsOrThrowUseCase throwErrorForMissingQuestionThemeIds should throw QuestionThemeNotFoundError for first missing id when called.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:16:36
   private readonly questionThemeRepository: QuestionThemeRepository) {}
 
   private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {
-    for (const id of requestedIds) {
-      if (!foundIds.has(id)) {
-        throw new QuestionThemeNotFoundError(id);
-      }
-    }
+    for (const id of requestedIds) {}
   }
 
killedBy: GetQuestionThemesByIdsOrThrowUseCase throwErrorForMissingQuestionThemeIds should throw QuestionThemeNotFoundError for first missing id when called.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:17:11
 
   private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {
     for (const id of requestedIds) {
-      if (!foundIds.has(id)) {
+      if (true) {
         throw new QuestionThemeNotFoundError(id);
       }
killedBy: GetQuestionThemesByIdsOrThrowUseCase throwErrorForMissingQuestionThemeIds should throw QuestionThemeNotFoundError for first missing id when called.
statusReason: expected a thrown error to be QuestionThemeNotFoundError: Question them…

[Killed] ConditionalExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:17:11
 
   private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {
     for (const id of requestedIds) {
-      if (!foundIds.has(id)) {
+      if (false) {
         throw new QuestionThemeNotFoundError(id);
       }
killedBy: GetQuestionThemesByIdsOrThrowUseCase throwErrorForMissingQuestionThemeIds should throw QuestionThemeNotFoundError for first missing id when called.
statusReason: expected function to throw an error, but it didn't

[Killed] CallExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:18:9
   private static throwErrorForMissingQuestionThemeIds(requestedIds: Set<string>, foundIds: Set<string>): void {
     for (const id of requestedIds) {
       if (!foundIds.has(id)) {
-        throw new QuestionThemeNotFoundError(id);
+        ;
       }
     }
killedBy: GetQuestionThemesByIdsOrThrowUseCase throwErrorForMissingQuestionThemeIds should throw QuestionThemeNotFoundError for first missing id when called.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:26:9
   public async getByIdsOrThrow(ids: Set<string>): Promise<QuestionTheme[]> {
     const foundQuestionThemes = await this.questionThemeRepository.findByIds(ids);
     const foundQuestionThemeIds = new Set(foundQuestionThemes.map(theme => theme.id));
-    if (foundQuestionThemeIds.size !== ids.size) {
+    if (false) {
       GetQuestionThemesByIdsOrThrowUseCase.throwErrorForMissingQuestionThemeIds(ids, foundQuestionThemeIds);
     }
killedBy: GetQuestionThemesByIdsOrThrowUseCase getByIdsOrThrow should call throwErrorForMissingQuestionThemeIds when some ids are missing.
statusReason: expected "throwErrorForMissingQuestionThemeIds" to be called once with arguments: [ Set{ 'theme-1', …(1) }, …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:26:9
   public async getByIdsOrThrow(ids: Set<string>): Promise<QuestionTheme[]> {
     const foundQuestionThemes = await this.questionThemeRepository.findByIds(ids);
     const foundQuestionThemeIds = new Set(foundQuestionThemes.map(theme => theme.id));
-    if (foundQuestionThemeIds.size !== ids.size) {
+    if (true) {
       GetQuestionThemesByIdsOrThrowUseCase.throwErrorForMissingQuestionThemeIds(ids, foundQuestionThemeIds);
     }
killedBy: GetQuestionThemesByIdsOrThrowUseCase getByIdsOrThrow should not call throwErrorForMissingQuestionThemeIds when all ids are found.
statusReason: expected "throwErrorForMissingQuestionThemeIds" to not be called at all, but actually been called 1 times

Received:

  1st throwErrorForMissingQuestionThemeIds call:

    Array [
      Set {

[Killed] CallExpression
application/use-cases/get-question-themes-by-ids-or-throw/get-question-themes-by-ids-or-throw.use-case.ts:27:7
     const foundQuestionThemes = await this.questionThemeRepository.findByIds(ids);
     const foundQuestionThemeIds = new Set(foundQuestionThemes.map(theme => theme.id));
     if (foundQuestionThemeIds.size !== ids.size) {
-      GetQuestionThemesByIdsOrThrowUseCase.throwErrorForMissingQuestionThemeIds(ids, foundQuestionThemeIds);
+      ;
     }
     return foundQuestionThemes;
killedBy: GetQuestionThemesByIdsOrThrowUseCase getByIdsOrThrow should call throwErrorForMissingQuestionThemeIds when some ids are missing.
statusReason: expected "throwErrorForMissingQuestionThemeIds" to be called once with arguments: [ Set{ 'theme-1', …(1) }, …(1) ]

Number of calls: 0
