[Killed] BlockStatement
application/use-cases/modify-question-theme/modify-question-theme.use-case.ts:27:134
     return modifiedQuestionTheme;
   }
 
-  private async throwIfQuestionThemeNotModifiable(questionThemeModificationCommand: QuestionThemeModificationCommand): Promise<void> {
-    const { questionThemeId, payload } = questionThemeModificationCommand;
-    if (payload.slug === undefined) {
-      return;
-    }
-    const questionThemeWithSameSlug = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionThemeWithSameSlug && questionThemeWithSameSlug.id !== questionThemeId) {
-      throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
-    }
-  }
+  private async throwIfQuestionThemeNotModifiable(questionThemeModificationCommand: QuestionThemeModificationCommand): Promise<void> {}
 }
killedBy: ModifyQuestionThemeUseCase throwIfQuestionThemeNotModifiable should find a question theme with same slug when payload slug is defined.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'new-slug' ]

Number of calls: 0

[Killed] ConditionalExpression
application/use-cases/modify-question-theme/modify-question-theme.use-case.ts:33:9
       return;
     }
     const questionThemeWithSameSlug = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionThemeWithSameSlug && questionThemeWithSameSlug.id !== questionThemeId) {
+    if (true) {
       throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
     }
killedBy: ModifyQuestionThemeUseCase throwIfQuestionThemeNotModifiable should find a question theme with same slug when payload slug is defined.
statusReason: Question theme with slug new-slug already exists

[Killed] ConditionalExpression
application/use-cases/modify-question-theme/modify-question-theme.use-case.ts:33:38
       return;
     }
     const questionThemeWithSameSlug = await this.questionThemeRepository.findBySlug(payload.slug);
-    if (questionThemeWithSameSlug && questionThemeWithSameSlug.id !== questionThemeId) {
+    if (questionThemeWithSameSlug && true) {
       throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
     }
killedBy: ModifyQuestionThemeUseCase throwIfQuestionThemeNotModifiable should not throw an error when the question theme with same slug is the one being updated.
statusReason: promise rejected "QuestionThemeSlugAlreadyExistsError: Ques…" instead of resolving

[Killed] CallExpression
application/use-cases/modify-question-theme/modify-question-theme.use-case.ts:34:7
     }
     const questionThemeWithSameSlug = await this.questionThemeRepository.findBySlug(payload.slug);
     if (questionThemeWithSameSlug && questionThemeWithSameSlug.id !== questionThemeId) {
-      throw new QuestionThemeSlugAlreadyExistsError(payload.slug);
+      ;
     }
   }
killedBy: ModifyQuestionThemeUseCase throwIfQuestionThemeNotModifiable should throw an error when another question theme with same slug already exists.
statusReason: promise resolved "undefined" instead of rejecting
