[Killed] ConditionalExpression
question-theme/domain/rules/question-theme.rules.ts:7:10
 import type { QuestionTheme } from "@question-theme/domain/types/question-theme.entities";
 
 function isQuestionThemeArchived(questionTheme: QuestionTheme): questionTheme is QuestionTheme & { status: typeof QUESTION_THEME_STATUS_ARCHIVED } {
-  return questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED;
+  return false;
 }
 
killedBy: isQuestionThemeArchived should return true when question theme status is archived.
statusReason: expected false to be truthy

[Killed] EqualityOperator
question-theme/domain/rules/question-theme.rules.ts:7:10
 import type { QuestionTheme } from "@question-theme/domain/types/question-theme.entities";
 
 function isQuestionThemeArchived(questionTheme: QuestionTheme): questionTheme is QuestionTheme & { status: typeof QUESTION_THEME_STATUS_ARCHIVED } {
-  return questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED;
+  return questionTheme.status !== QUESTION_THEME_STATUS_ARCHIVED;
 }
 
killedBy: CreateQuestionUseCase create should call repository.create with payload when called.
statusReason: Referenced question theme with id 391116b6ae7454fc4d8ba2ce is archived

[Killed] BlockStatement
question-theme/domain/rules/question-theme.rules.ts:10:104
   return questionTheme.status === QUESTION_THEME_STATUS_ARCHIVED;
 }
 
-function ensureNoLiveQuestionsReferenceTheme(liveQuestionCount: number, questionThemeId: string): void {
-  if (liveQuestionCount > 0) {
-    throw new QuestionThemeReferencedByLiveQuestionsError(questionThemeId, liveQuestionCount);
-  }
-}
+function ensureNoLiveQuestionsReferenceTheme(liveQuestionCount: number, questionThemeId: string): void {}
 
 function findArchivedQuestionTheme(themes: QuestionTheme[]): QuestionTheme | undefined {
killedBy: ensureNoLiveQuestionsReferenceTheme should throw QuestionThemeReferencedByLiveQuestionsError when live question count > 0.
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
question-theme/domain/rules/question-theme.rules.ts:11:30
 }
 
 function ensureNoLiveQuestionsReferenceTheme(liveQuestionCount: number, questionThemeId: string): void {
-  if (liveQuestionCount > 0) {
-    throw new QuestionThemeReferencedByLiveQuestionsError(questionThemeId, liveQuestionCount);
-  }
+  if (liveQuestionCount > 0) {}
 }
 
killedBy: ensureNoLiveQuestionsReferenceTheme should throw QuestionThemeReferencedByLiveQuestionsError when live question count > 0.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
question-theme/domain/rules/question-theme.rules.ts:11:7
 }
 
 function ensureNoLiveQuestionsReferenceTheme(liveQuestionCount: number, questionThemeId: string): void {
-  if (liveQuestionCount > 0) {
+  if (true) {
     throw new QuestionThemeReferencedByLiveQuestionsError(questionThemeId, liveQuestionCount);
   }
killedBy: ArchiveQuestionThemeUseCase archive should archive a question theme from repository when called.
statusReason: Question theme with id question-theme-id-1 is referenced by 0 live question(s) and cannot be archived

[Killed] CallExpression
question-theme/domain/rules/question-theme.rules.ts:12:5
 
 function ensureNoLiveQuestionsReferenceTheme(liveQuestionCount: number, questionThemeId: string): void {
   if (liveQuestionCount > 0) {
-    throw new QuestionThemeReferencedByLiveQuestionsError(questionThemeId, liveQuestionCount);
+    ;
   }
 }
killedBy: ArchiveQuestionThemeUseCase throwIfLiveQuestionsReferenceTheme should throw QuestionThemeReferencedByLiveQuestionsError when live questions reference the theme.
statusReason: promise resolved "undefined" instead of rejecting
