[Killed] ObjectLiteral
mongoose/repository/helpers/question-theme-filter.mongoose.helpers.ts:12:44
   if (!filters) {
     return {};
   }
-  const baseConditions = pickDefinedValues({ status: filters.status }) ?? {};
+  const baseConditions = pickDefinedValues({}) ?? {};
 
   if (filters.isFullyTranslated === undefined) {
killedBy: QuestionThemeMongooseRepository findAll should find documents with filter query from model when filters are provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ { status: 'active' } ]

Received:

  1st vi.fn() call:

  [
-   {
