[Killed] MethodExpression
persistence/mongoose/repository/question-theme.mongoose.repository.ts:31:19
     const filterQuery = buildQuestionThemeFilterQuery(options.filters);
     // Acceptable as .sort() is a Mongoose Query method, not Array.prototype.sort
     // oxlint-disable-next-line unicorn/no-array-sort
-    const query = this.questionThemeModel.find(filterQuery).sort(sortCriteria);
+    const query = this.questionThemeModel.find(filterQuery);
 
     if (hasLimit(options.limit)) {
killedBy: QuestionThemeMongooseRepository findAll should sort in ascending direction when sort order is asc.
statusReason: expected "vi.fn()" to be called once with arguments: [ { status: 1, _id: 1 } ]

Number of calls: 0

[Killed] BlockStatement
persistence/mongoose/repository/question-theme.mongoose.repository.ts:33:34
     // oxlint-disable-next-line unicorn/no-array-sort
     const query = this.questionThemeModel.find(filterQuery).sort(sortCriteria);
 
-    if (hasLimit(options.limit)) {
-      query.limit(options.limit);
-    }
+    if (hasLimit(options.limit)) {}
     const questionThemeDocuments = await query;
 
killedBy: QuestionThemeMongooseRepository findAll should apply limit to find query when limit is set.
statusReason: expected "vi.fn()" to be called once with arguments: [ 5 ]

Number of calls: 0

[Killed] CallExpression
persistence/mongoose/repository/question-theme.mongoose.repository.ts:34:7
     const query = this.questionThemeModel.find(filterQuery).sort(sortCriteria);
 
     if (hasLimit(options.limit)) {
-      query.limit(options.limit);
+      ;
     }
     const questionThemeDocuments = await query;
killedBy: QuestionThemeMongooseRepository findAll should apply limit to find query when limit is set.
statusReason: expected "vi.fn()" to be called once with arguments: [ 5 ]

Number of calls: 0

[Killed] ObjectLiteral
persistence/mongoose/repository/question-theme.mongoose.repository.ts:78:108
     const updateQuery: UpdateQuery<QuestionThemeMongooseDocument> = {
       $set: questionThemeUpdateData,
     };
-    const modifiedQuestionThemeDocument = await this.questionThemeModel.findByIdAndUpdate(id, updateQuery, { returnDocument: "after" });
+    const modifiedQuestionThemeDocument = await this.questionThemeModel.findByIdAndUpdate(id, updateQuery, {});
     if (!modifiedQuestionThemeDocument) {
       return undefined;
killedBy: QuestionThemeMongooseRepository modify should modify document in model when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'question-theme-id', …(2) ]

Received:

  1st vi.fn() call:

@@ -16,9 +16,7 @@
        "label.it": "institute",

[Killed] LogicalOperator
persistence/mongoose/repository/question-theme.mongoose.repository.ts:100:14
     const [result] = await this.questionThemeModel.aggregate<QuestionThemeStatsAggregationResult>(QUESTION_THEME_STATS_MONGOOSE_REPOSITORY_PIPELINE);
 
     return {
-      total: result.total[0]?.count ?? 0,
+      total: result.total[0]?.count && 0,
       byStatus: result.statusRows[0] ?? {},
       byQuestionCount: result.byQuestionCount,
killedBy: QuestionThemeMongooseRepository getStats should return total from aggregation when themes exist.
statusReason: expected +0 to be 3 // Object.is equality

[Killed] OptionalChaining
persistence/mongoose/repository/question-theme.mongoose.repository.ts:100:14
     const [result] = await this.questionThemeModel.aggregate<QuestionThemeStatsAggregationResult>(QUESTION_THEME_STATS_MONGOOSE_REPOSITORY_PIPELINE);
 
     return {
-      total: result.total[0]?.count ?? 0,
+      total: result.total[0].count ?? 0,
       byStatus: result.statusRows[0] ?? {},
       byQuestionCount: result.byQuestionCount,
killedBy: QuestionThemeMongooseRepository getStats should return total as 0 when no themes exist.
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] LogicalOperator
persistence/mongoose/repository/question-theme.mongoose.repository.ts:101:17
 
     return {
       total: result.total[0]?.count ?? 0,
-      byStatus: result.statusRows[0] ?? {},
+      byStatus: result.statusRows[0] && {},
       byQuestionCount: result.byQuestionCount,
       byTranslationCompleteness: {
killedBy: QuestionThemeMongooseRepository getStats should include all status keys in byStatus when aggregation returns status rows.
statusReason: expected [] to strictly equal [ 'active', 'archived' ]
