[Killed] EqualityOperator
api/config/helpers/env.helpers.ts:15:9
 
 function getEnvFilePath(): string {
   let env = process.env.NODE_ENV ?? "";
-  env = env === "production" ? "" : env;
+  env = env !== "production" ? "" : env;
 
   const envSuffix = env ? `.${env}` : "";
killedBy: getEnvFilePath should return the expected path when NODE_ENV is 'development'.
statusReason: expected 'env/.env' to be 'env/.env.development' // Object.is equality

[Killed] ConditionalExpression
api/config/helpers/env.helpers.ts:15:9
 
 function getEnvFilePath(): string {
   let env = process.env.NODE_ENV ?? "";
-  env = env === "production" ? "" : env;
+  env = true ? "" : env;
 
   const envSuffix = env ? `.${env}` : "";
killedBy: getEnvFilePath should return the expected path when NODE_ENV is 'development'.
statusReason: expected 'env/.env' to be 'env/.env.development' // Object.is equality
