[Killed] CallExpression
config/providers/services/app-config.service.ts:14:5
 
   public constructor(private readonly configService: ConfigService) {
     this.authenticationConfigCache = this.computeAuthenticationConfigCache();
-    AppConfigService.deleteSensitiveEnvVariables();
+    ;
   }
 
killedBy: AppConfigService deleteSensitiveEnvVariables should delete api key hmac secret when computing authentication config cache.
statusReason: expected 'valid-hmac-secret-of-sufficient-length' to be undefined

[Killed] StringLiteral
config/providers/services/app-config.service.ts:20:72
   public get serverConfig(): ServerConfigFromEnv {
     return {
       host: this.configService.getOrThrow<ServerConfigFromEnv["host"]>("SERVER_HOST"),
-      port: this.configService.getOrThrow<ServerConfigFromEnv["port"]>("SERVER_PORT"),
+      port: this.configService.getOrThrow<ServerConfigFromEnv["port"]>(""),
     };
   }
killedBy: AppConfigService serverConfig should return server config from env when called.
statusReason: expected { host: '127.0.0.1', port: undefined } to strictly equal { host: '127.0.0.1', port: 8080 }

[Killed] MethodExpression
config/providers/services/app-config.service.ts:26:58
 
   public get serverBaseUrl(): string {
     const { host, port } = this.serverConfig;
-    const normalizedHost = host.startsWith("http://") || host.startsWith("https://") ? host : `http://${host}`;
+    const normalizedHost = host.startsWith("http://") || host.endsWith("https://") ? host : `http://${host}`;
     const url = new URL(normalizedHost);
     url.port = String(port);
killedBy: AppConfigService serverBaseUrl should return server base url with https when host includes https scheme.
statusReason: expected 'http://https:8080' to be 'https://0.0.0.0:8080' // Object.is equality

[Killed] LogicalOperator
config/providers/services/app-config.service.ts:26:28
 
   public get serverBaseUrl(): string {
     const { host, port } = this.serverConfig;
-    const normalizedHost = host.startsWith("http://") || host.startsWith("https://") ? host : `http://${host}`;
+    const normalizedHost = host.startsWith("http://") && host.startsWith("https://") ? host : `http://${host}`;
     const url = new URL(normalizedHost);
     url.port = String(port);
killedBy: AppConfigService serverBaseUrl should return server base url with https when host includes https scheme.
statusReason: expected 'http://https:8080' to be 'https://0.0.0.0:8080' // Object.is equality

[Killed] StringLiteral
config/providers/services/app-config.service.ts:35:74
 
   public get corsConfig(): CorsConfigFromEnv {
     return {
-      origin: this.configService.getOrThrow<CorsConfigFromEnv["origin"]>("CORS_ORIGIN"),
+      origin: this.configService.getOrThrow<CorsConfigFromEnv["origin"]>(""),
     };
   }
killedBy: AppConfigService corsConfig should return cors config from env when called.
statusReason: expected { origin: undefined } to strictly equal { origin: 'everywhere' }

[Killed] StringLiteral
config/providers/services/app-config.service.ts:41:79
 
   public get mongoDbConfig(): MongoDatabaseConfigFromEnv {
     return {
-      host: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["host"]>("MONGODB_HOST"),
+      host: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["host"]>(""),
       port: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["port"]>("MONGODB_PORT"),
       database: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["database"]>("MONGODB_DATABASE"),
killedBy: AppConfigService mongoDbConfig should return mongo database config from env when called.
statusReason: expected { host: undefined, port: 27018, …(1) } to strictly equal { Object (host, port, ...) }

[Killed] StringLiteral
config/providers/services/app-config.service.ts:42:79
   public get mongoDbConfig(): MongoDatabaseConfigFromEnv {
     return {
       host: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["host"]>("MONGODB_HOST"),
-      port: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["port"]>("MONGODB_PORT"),
+      port: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["port"]>(""),
       database: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["database"]>("MONGODB_DATABASE"),
     };
killedBy: AppConfigService mongoDbConfig should return mongo database config from env when called.
statusReason: expected { host: 'localhost', …(2) } to strictly equal { Object (host, port, ...) }

[Killed] StringLiteral
config/providers/services/app-config.service.ts:43:87
     return {
       host: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["host"]>("MONGODB_HOST"),
       port: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["port"]>("MONGODB_PORT"),
-      database: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["database"]>("MONGODB_DATABASE"),
+      database: this.configService.getOrThrow<MongoDatabaseConfigFromEnv["database"]>(""),
     };
   }
killedBy: AppConfigService mongoDbConfig should return mongo database config from env when called.
statusReason: expected { Object (host, port, ...) } to strictly equal { Object (host, port, ...) }

[Killed] BlockStatement
config/providers/services/app-config.service.ts:57:54
     return this.authenticationConfigCache;
   }
 
-  private static deleteSensitiveEnvVariables(): void {
-    delete process.env.API_KEY_HMAC_SECRET;
-    delete process.env.ADMIN_API_KEY;
-    delete process.env.GAME_API_KEY;
-  }
+  private static deleteSensitiveEnvVariables(): void {}
 
   private computeAuthenticationConfigCache(): AuthenticationConfigFromEnv {
killedBy: AppConfigService deleteSensitiveEnvVariables should delete api key hmac secret when computing authentication config cache.
statusReason: expected 'valid-hmac-secret-of-sufficient-length' to be undefined

[Killed] StringLiteral
config/providers/services/app-config.service.ts:65:63
 
   private computeAuthenticationConfigCache(): AuthenticationConfigFromEnv {
     const hmacSecret = this.configService.getOrThrow<string>("API_KEY_HMAC_SECRET");
-    const adminApiKey = this.configService.getOrThrow<string>("ADMIN_API_KEY");
+    const adminApiKey = this.configService.getOrThrow<string>("");
     const gameApiKey = this.configService.getOrThrow<string>("GAME_API_KEY");
 
killedBy: AppConfigService computeAuthenticationConfigCache should call hashApiKey for adminApiKey when config service is created.
statusReason: expected 1st "hashApiKey" call to have been called with [ …(2) ]

[Killed] StringLiteral
config/providers/services/app-config.service.ts:66:62
   private computeAuthenticationConfigCache(): AuthenticationConfigFromEnv {
     const hmacSecret = this.configService.getOrThrow<string>("API_KEY_HMAC_SECRET");
     const adminApiKey = this.configService.getOrThrow<string>("ADMIN_API_KEY");
-    const gameApiKey = this.configService.getOrThrow<string>("GAME_API_KEY");
+    const gameApiKey = this.configService.getOrThrow<string>("");
 
     const hashedAdminApiKey = hashApiKey(adminApiKey, hmacSecret);
killedBy: AppConfigService computeAuthenticationConfigCache should call hashApiKey for gameApiKey when config service is created.
statusReason: expected 2nd "hashApiKey" call to have been called with [ …(2) ]
