[Killed] Regex
api/config/validators/cors.validator.ts:6:13
 import type { $ZodURLParams } from "zod/v4/core";
 
 const CORS_URL_OPTIONS: $ZodURLParams = {
-  protocol: /^https?$/u,
+  protocol: /^https?/u,
   hostname: z.regexes.domain,
 };
killedBy: isCorsOriginValid 'should return false for URL with unsu…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
api/config/validators/cors.validator.ts:13:7
 const CORS_URL_SCHEMA = z.url(CORS_URL_OPTIONS);
 
 function isCorsOriginValid(value: string): boolean {
-  if (value === "*") {
+  if (true) {
     return true;
   }
killedBy: isCorsOriginValid 'should return false for invalid URL \…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
api/config/validators/cors.validator.ts:13:7
 const CORS_URL_SCHEMA = z.url(CORS_URL_OPTIONS);
 
 function isCorsOriginValid(value: string): boolean {
-  if (value === "*") {
+  if (false) {
     return true;
   }
killedBy: isCorsOriginValid 'should return true for wildcard \'*\'.'
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
api/config/validators/cors.validator.ts:14:12
 
 function isCorsOriginValid(value: string): boolean {
   if (value === "*") {
-    return true;
+    return false;
   }
   return CORS_URL_SCHEMA.validate(value);
killedBy: isCorsOriginValid 'should return true for wildcard \'*\'.'
statusReason: expected false to be true // Object.is equality
