[Killed] StringLiteral
app-health/app-health-details/app-health-details-check/app-health-details-check.dto.shape.ts:11:22
   message: z.string()
     .optional()
     .describe("Optional message providing additional information about the health status when it is not up")
-    .meta({ example: "Database connection failed." }),
+    .meta({ example: "" }),
   responseTime: z.number()
     .optional()
killedBy: App Health Details Check DTO Shape message should have correct metadata when accessing metadata.
statusReason: expected { …(2) } to strictly equal { …(2) }
