[Killed] StringLiteral
dto/app-health/app-health-details/app-health-details.dto.shape.ts:8:15
 
 const APP_HEALTH_DETAILS_DTO = z.strictObject({
   [MONGOOSE_HEALTH_KEY]: APP_HEALTH_DETAILS_CHECK_DTO
-    .describe("Health details of the Mongoose (MongoDB) connection"),
+    .describe(""),
   [DOCS_ENDPOINT_HEALTH_KEY]: APP_HEALTH_DETAILS_CHECK_DTO
     .describe("Health details of the API Documentation endpoint"),
killedBy: App Health Details DTO Shape mongoose should have correct description when accessing description.
statusReason: expected '' to be 'Health details of the Mongoose (Mongo…' // Object.is equality
