[Killed] StringLiteral
health/dto/app-health/app-health.dto.shape.ts:8:15
 
 const APP_HEALTH_DTO = z.strictObject({
   status: z.enum(HEALTH_STATUS_ENUM)
-    .describe("Overall health status of the application"),
+    .describe(""),
   details: APP_HEALTH_DETAILS_DTO
     .describe("Detailed health status of individual checked components"),
killedBy: App Health DTO Shape status should have correct description when accessing description.
statusReason: expected '' to be 'Overall health status of the applicat…' // Object.is equality
