[Killed] BooleanLiteral
infrastructure/api/server/server.ts:16:111
 import type { NestFastifyApplication } from "@nestjs/platform-fastify";
 
 async function bootstrap(): Promise<NestFastifyApplication> {
-  const app = await NestFactory.create<NestFastifyApplication>(AppModule, new FastifyAdapter(), { bufferLogs: true });
+  const app = await NestFactory.create<NestFastifyApplication>(AppModule, new FastifyAdapter(), { bufferLogs: false });
 
   const logger = app.get(Logger);
killedBy: bootstrap should create from NestFactory when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { name: 'MockedModule' }, …(2) ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ObjectLiteral
infrastructure/api/server/server.ts:16:97
 import type { NestFastifyApplication } from "@nestjs/platform-fastify";
 
 async function bootstrap(): Promise<NestFastifyApplication> {
-  const app = await NestFactory.create<NestFastifyApplication>(AppModule, new FastifyAdapter(), { bufferLogs: true });
+  const app = await NestFactory.create<NestFastifyApplication>(AppModule, new FastifyAdapter(), {});
 
   const logger = app.get(Logger);
killedBy: bootstrap should create from NestFactory when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { name: 'MockedModule' }, …(2) ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] CallExpression
infrastructure/api/server/server.ts:22:3
   const appConfigService = app.get<AppConfigService>(AppConfigService);
 
   const corsConfig = createCorsConfig(appConfigService.corsConfig);
-  app.enableCors(corsConfig);
+  ;
 
   app.enableShutdownHooks();
killedBy: bootstrap should enable cors when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { origin: '*', …(3) } ]

Number of calls: 0

[Killed] CallExpression
infrastructure/api/server/server.ts:24:3
   const corsConfig = createCorsConfig(appConfigService.corsConfig);
   app.enableCors(corsConfig);
 
-  app.enableShutdownHooks();
+  ;
   app.useLogger(logger);
 
killedBy: bootstrap should enable shutdown hooks when called.
statusReason: expected "vi.fn()" to be called once with arguments: []

Number of calls: 0

[Killed] CallExpression
infrastructure/api/server/server.ts:25:3
   app.enableCors(corsConfig);
 
   app.enableShutdownHooks();
-  app.useLogger(logger);
+  ;
 
   app.useGlobalFilters(new GlobalExceptionFilter());
killedBy: bootstrap should use logger when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ { log: [Function Mock], …(5) } ]

Number of calls: 0

[Killed] CallExpression
infrastructure/api/server/server.ts:27:3
   app.enableShutdownHooks();
   app.useLogger(logger);
 
-  app.useGlobalFilters(new GlobalExceptionFilter());
+  ;
 
   setupSwaggerModule(app);
killedBy: bootstrap should use global exception filter when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ Any<GlobalExceptionFilter> ]

Number of calls: 0

[Killed] CallExpression
infrastructure/api/server/server.ts:29:3
 
   app.useGlobalFilters(new GlobalExceptionFilter());
 
-  setupSwaggerModule(app);
+  ;
 
   await app.listen(appConfigService.serverConfig);
killedBy: bootstrap should setup swagger module when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ Any<Object> ]

Number of calls: 0

[Killed] StringLiteral
infrastructure/api/server/server.ts:36:14
   const appUrl = await app.getUrl();
   const documentationUrl = getSwaggerUrl(appUrl);
 
-  logger.log(`🐐 Goat It API is running on: ${appUrl}`);
+  logger.log(``;
   logger.log(`📚 Swagger documentation is available on: ${documentationUrl}`);
 
killedBy: bootstrap should log the app url when called.
statusReason: expected 1st "vi.fn()" call to have been called with [ Array(1) ]
