[Killed] BlockStatement
server/swagger/helpers/swagger.helpers.ts:35:64
   return cleanupOpenApiDoc(SwaggerModule.createDocument(app, config));
 }
 
-function setupSwaggerModule(app: NestFastifyApplication): void {
-  const swaggerOptions: SwaggerCustomOptions = {
-    customSiteTitle: SWAGGER_DOCUMENTATION_TITLE,
-  };
-
-  SwaggerModule.setup(SWAGGER_DOCUMENTATION_PATH, app, createSwaggerDocument(app), swaggerOptions);
-}
+function setupSwaggerModule(app: NestFastifyApplication): void {}
 
 export {
killedBy: setupSwaggerModule should setup Swagger module when called.
statusReason: expected "setup" to be called once with arguments: [ '/docs', {}, { …(3) }, { …(1) } ]

Number of calls: 0

[Killed] CallExpression
server/swagger/helpers/swagger.helpers.ts:40:3
     customSiteTitle: SWAGGER_DOCUMENTATION_TITLE,
   };
 
-  SwaggerModule.setup(SWAGGER_DOCUMENTATION_PATH, app, createSwaggerDocument(app), swaggerOptions);
+  ;
 }
 
killedBy: setupSwaggerModule should setup Swagger module when called.
statusReason: expected "setup" to be called once with arguments: [ '/docs', {}, { …(3) }, { …(1) } ]

Number of calls: 0
