[Killed] ArrowFunction
infrastructure/database/providers/database.service.ts:26:27
       retryDelay: DATABASE_RETRY_DELAY_MS,
       retryAttempts: DATABASE_RETRY_ATTEMPTS,
       dbName: database,
-      onConnectionCreate: connection => this.onMongooseConnectionCreate(connection),
+      onConnectionCreate: () => undefined,
     };
   }
killedBy: DatabaseService createMongooseOptions should set up connection event listeners when onConnectionCreate option is called.
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "🍀 Database connection established",

[Killed] BlockStatement
infrastructure/database/providers/database.service.ts:30:68
     };
   }
 
-  private onMongooseConnectionCreate(connection: Connection): void {
-    connection.on("connected", () => {
-      this.logger.log("🍀 Database connection established");
-    });
-
-    connection.on("disconnected", () => {
-      this.logger.warn("⚠️ Database connection lost");
-    });
-  }
+  private onMongooseConnectionCreate(connection: Connection): void {}
 }
killedBy: DatabaseService createMongooseOptions should set up connection event listeners when onConnectionCreate option is called.
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "🍀 Database connection established",

[Killed] BlockStatement
infrastructure/database/providers/database.service.ts:31:38
   }
 
   private onMongooseConnectionCreate(connection: Connection): void {
-    connection.on("connected", () => {
-      this.logger.log("🍀 Database connection established");
-    });
+    connection.on("connected", () => {});
 
     connection.on("disconnected", () => {
killedBy: DatabaseService createMongooseOptions should set up connection event listeners when onConnectionCreate option is called.
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "🍀 Database connection established",

[Killed] StringLiteral
infrastructure/database/providers/database.service.ts:31:19
   }
 
   private onMongooseConnectionCreate(connection: Connection): void {
-    connection.on("connected", () => {
+    connection.on("", () => {
       this.logger.log("🍀 Database connection established");
     });
killedBy: DatabaseService createMongooseOptions should set up connection event listeners when onConnectionCreate option is called.
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "🍀 Database connection established",

[Killed] BlockStatement
infrastructure/database/providers/database.service.ts:35:41
       this.logger.log("🍀 Database connection established");
     });
 
-    connection.on("disconnected", () => {
-      this.logger.warn("⚠️ Database connection lost");
-    });
+    connection.on("disconnected", () => {});
   }
 }
killedBy: DatabaseService onMongooseConnectionCreate should log database disconnected message when connection emits disconnected event.
statusReason: expected "vi.fn()" to be called once with arguments: [ '⚠️ Database connection lost' ]

Number of calls: 0
