[Killed] ConditionalExpression
zod/preprocessors/array/array.zod.preprocessors.ts:7:10
  * Used as a Zod preprocessor for query params that accept both a single value and an array.
  */
 function normalizeToArray(value: unknown): unknown {
-  return typeof value === "string" ? [value] : value;
+  return true ? [value] : value;
 }
 
killedBy: Question DTO Zod Validators zQuestionThemeIdsFilter 'should return true when an array with…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
zod/preprocessors/array/array.zod.preprocessors.ts:7:10
  * Used as a Zod preprocessor for query params that accept both a single value and an array.
  */
 function normalizeToArray(value: unknown): unknown {
-  return typeof value === "string" ? [value] : value;
+  return false ? [value] : value;
 }
 
killedBy: Question DTO Zod Validators zQuestionThemeIdsFilter 'should return true when a single stri…'
statusReason: expected false to be true // Object.is equality
