[Killed] EqualityOperator
zod/refinements/array/array.zod.refinements.ts:4:10
 function areValuesUniqueFromStrings(array: string[]): boolean {
   const uniqueValues = new Set(array);
 
-  return uniqueValues.size === array.length;
+  return uniqueValues.size !== array.length;
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls 'should return true when array of vali…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
zod/refinements/array/array.zod.refinements.ts:4:10
 function areValuesUniqueFromStrings(array: string[]): boolean {
   const uniqueValues = new Set(array);
 
-  return uniqueValues.size === array.length;
+  return true;
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls 'should return false when array contai…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
zod/refinements/array/array.zod.refinements.ts:14:46
 }
 
 function hasExactlyOneByKey<T extends Record<string, unknown>>(array: T[], key: keyof T, value: unknown): boolean {
-  const matchingItems = array.filter(item => item[key] === value);
+  const matchingItems = array.filter(item => false);
 
   return matchingItems.length === 1;
killedBy: Array Zod Refinements Helpers hasExactlyOneByKey 'should return true when exactly one i…'
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
zod/refinements/array/array.zod.refinements.ts:14:38
 }
 
 function hasExactlyOneByKey<T extends Record<string, unknown>>(array: T[], key: keyof T, value: unknown): boolean {
-  const matchingItems = array.filter(item => item[key] === value);
+  const matchingItems = array.filter(() => undefined);
 
   return matchingItems.length === 1;
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown

[Killed] EqualityOperator
zod/refinements/array/array.zod.refinements.ts:16:10
 function hasExactlyOneByKey<T extends Record<string, unknown>>(array: T[], key: keyof T, value: unknown): boolean {
   const matchingItems = array.filter(item => item[key] === value);
 
-  return matchingItems.length === 1;
+  return matchingItems.length !== 1;
 }
 
killedBy: Array Zod Refinements Helpers hasExactlyOneByKey 'should return true when exactly one i…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
zod/refinements/array/array.zod.refinements.ts:16:10
 function hasExactlyOneByKey<T extends Record<string, unknown>>(array: T[], key: keyof T, value: unknown): boolean {
   const matchingItems = array.filter(item => item[key] === value);
 
-  return matchingItems.length === 1;
+  return true;
 }
 
killedBy: Question Creation DTO Shape themes should throw zod error when themes do not have exactly one primary theme.
statusReason: expected function to throw an error, but it didn't
