[Killed] BlockStatement
zod/validators/array/array.zod.validators.ts:25:31
 ): ZodOptional<ZodPreprocess<ZodArray<T>>> {
   let arraySchema = z.array(innerSchema);
 
-  if (minItems !== undefined) {
-    arraySchema = arraySchema.min(minItems);
-  }
+  if (minItems !== undefined) {}
   if (maxItems !== undefined) {
     arraySchema = arraySchema.max(maxItems);
killedBy: zCreateFilterArray 'should fail validation when array is …'
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
zod/validators/array/array.zod.validators.ts:26:19
   let arraySchema = z.array(innerSchema);
 
   if (minItems !== undefined) {
-    arraySchema = arraySchema.min(minItems);
+    arraySchema = arraySchema.max(minItems);
   }
   if (maxItems !== undefined) {
killedBy: Find Random Questions Body DTO Shape excludedIds should pass validation when multiple valid ObjectIds are provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown

[Killed] BlockStatement
zod/validators/array/array.zod.validators.ts:28:31
   if (minItems !== undefined) {
     arraySchema = arraySchema.min(minItems);
   }
-  if (maxItems !== undefined) {
-    arraySchema = arraySchema.max(maxItems);
-  }
+  if (maxItems !== undefined) {}
   return z.preprocess(normalizeToArray, arraySchema)
     .refine(array => {
killedBy: zCreateFilterArray 'should fail validation when array exc…'
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
zod/validators/array/array.zod.validators.ts:29:19
     arraySchema = arraySchema.min(minItems);
   }
   if (maxItems !== undefined) {
-    arraySchema = arraySchema.max(maxItems);
+    arraySchema = arraySchema.min(maxItems);
   }
   return z.preprocess(normalizeToArray, arraySchema)
killedBy: Find Random Questions Body DTO Shape should pass validation when a valid dto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown

[Killed] BlockStatement
zod/validators/array/array.zod.validators.ts:32:22
     arraySchema = arraySchema.max(maxItems);
   }
   return z.preprocess(normalizeToArray, arraySchema)
-    .refine(array => {
-      const uniqueValues = new Set(array);
-
-      return uniqueValues.size === array.length;
-    }, { message: uniquenessMessage })
+    .refine(array => {}, { message: uniquenessMessage })
     .optional()
     .describe(description);
killedBy: Find Random Questions Body DTO Shape should pass validation when a valid dto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown
