[Killed] StringLiteral
application/mappers/localization/localization.mappers.ts:6:10
 function getUnknownLocaleWarningMessage(localizationConfig: LocalizationOptions): string {
   const { locale, fallbackLocale } = localizationConfig;
 
-  return `⚠️ No Translation found for desired locale (${locale}) and fallback locale (${fallbackLocale})`;
+  return ``;
 }
 
killedBy: Localization Mappers getUnknownLocaleWarningMessage should return the correct warning message for unknown locales when called.
statusReason: expected '' to be '⚠️ No Translation found for desired l…' // Object.is equality

[Killed] LogicalOperator
application/mappers/localization/localization.mappers.ts:12:10
 function pickLocalizedValue<T>(localizedValue: Partial<Record<Locale, T>>, localizationConfig: LocalizationOptions): T | undefined {
   const { locale, fallbackLocale } = localizationConfig;
 
-  return localizedValue[locale] ?? localizedValue[fallbackLocale];
+  return localizedValue[locale] && localizedValue[fallbackLocale];
 }
 
killedBy: createQuestionThemeDtoFromEntity should map a QuestionTheme entity to a QuestionThemeDto when called.
statusReason: expected { Object (id, slug, ...) } to strictly equal { Object (id, slug, ...) }
