[Killed] EqualityOperator
domain/helpers/array/array.helpers.ts:8:53
 function shuffleArray<T>(items: readonly T[], generateRandomIndex: RandomIndexGenerator = randomInt): T[] {
   const shuffledItems = [...items];
 
-  for (let currentIndex = shuffledItems.length - 1; currentIndex > 0; currentIndex -= 1) {
+  for (let currentIndex = shuffledItems.length - 1; currentIndex >= 0; currentIndex -= 1) {
     const swapIndex = generateRandomIndex(currentIndex + 1);
     [shuffledItems[currentIndex], shuffledItems[swapIndex]] = [shuffledItems[swapIndex], shuffledItems[currentIndex]];
killedBy: shuffleArray should return the input array unchanged when input length is 1.
statusReason: expected [ undefined, undefined: 'only' ] to strictly equal [ 'only' ]

[Killed] ArithmeticOperator
domain/helpers/array/array.helpers.ts:8:27
 function shuffleArray<T>(items: readonly T[], generateRandomIndex: RandomIndexGenerator = randomInt): T[] {
   const shuffledItems = [...items];
 
-  for (let currentIndex = shuffledItems.length - 1; currentIndex > 0; currentIndex -= 1) {
+  for (let currentIndex = shuffledItems.length + 1; currentIndex > 0; currentIndex -= 1) {
     const swapIndex = generateRandomIndex(currentIndex + 1);
     [shuffledItems[currentIndex], shuffledItems[swapIndex]] = [shuffledItems[swapIndex], shuffledItems[currentIndex]];
killedBy: shuffleArray should return an empty array when called with an empty array.
statusReason: expected [ undefined, undefined ] to strictly equal []

[Killed] ArithmeticOperator
domain/helpers/array/array.helpers.ts:9:43
   const shuffledItems = [...items];
 
   for (let currentIndex = shuffledItems.length - 1; currentIndex > 0; currentIndex -= 1) {
-    const swapIndex = generateRandomIndex(currentIndex + 1);
+    const swapIndex = generateRandomIndex(currentIndex - 1);
     [shuffledItems[currentIndex], shuffledItems[swapIndex]] = [shuffledItems[swapIndex], shuffledItems[currentIndex]];
   }
killedBy: shuffleArray should call the random index generator once per element except the first with the correct maximum bound when called.
statusReason: expected [ [ 2 ], [ 1 ], [ +0 ] ] to strictly equal [ [ 4 ], [ 3 ], [ 2 ] ]
