[Killed] ConditionalExpression
domain/rules/limit/limit.rules.ts:4:10
 import type { FindAllOptions } from "@shared/domain/types/find/find.types";
 
 function hasLimit(limit: FindAllOptions<string>["limit"]): limit is number {
-  return limit !== undefined && limit !== 0;
+  return true;
 }
 
killedBy: QuestionMongooseRepository findAll should aggregate with pipeline and ascending sort stage when sort order is asc.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$unwind': { …(2) } }, …(6) ] ]

Received:

  1st vi.fn() call:

@@ -62,7 +62,10 @@
        "$sort": {

[Killed] ConditionalExpression
domain/rules/limit/limit.rules.ts:4:10
 import type { FindAllOptions } from "@shared/domain/types/find/find.types";
 
 function hasLimit(limit: FindAllOptions<string>["limit"]): limit is number {
-  return limit !== undefined && limit !== 0;
+  return true && limit !== 0;
 }
 
killedBy: QuestionMongooseRepository findAll should aggregate with pipeline and ascending sort stage when sort order is asc.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$unwind': { …(2) } }, …(6) ] ]

Received:

  1st vi.fn() call:

@@ -62,7 +62,10 @@
        "$sort": {
