[Killed] EqualityOperator
domain/rules/object/object.rules.ts:2:64
 function pickDefinedValues<T extends Record<string, unknown>>(object: T): Partial<T> | undefined {
-  const entries = Object.entries(object).filter(([, value]) => value !== undefined);
+  const entries = Object.entries(object).filter(([, value]) => value === undefined);
 
   if (entries.length === 0) {
killedBy: QuestionThemeMongooseRepository findAll should find documents with filter query from model when filters are provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ { status: 'active' } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
domain/rules/object/object.rules.ts:2:64
 function pickDefinedValues<T extends Record<string, unknown>>(object: T): Partial<T> | undefined {
-  const entries = Object.entries(object).filter(([, value]) => value !== undefined);
+  const entries = Object.entries(object).filter(([, value]) => true);
 
   if (entries.length === 0) {
killedBy: buildQuestionThemeFilterQuery should return an empty object when no filter fields are defined.
statusReason: expected { status: undefined } to strictly equal {}

[Killed] ConditionalExpression
domain/rules/object/object.rules.ts:4:7
 function pickDefinedValues<T extends Record<string, unknown>>(object: T): Partial<T> | undefined {
   const entries = Object.entries(object).filter(([, value]) => value !== undefined);
 
-  if (entries.length === 0) {
+  if (true) {
     return undefined;
   }
killedBy: QuestionThemeMongooseRepository findAll should find documents with filter query from model when filters are provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ { status: 'active' } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
domain/rules/object/object.rules.ts:4:29
 function pickDefinedValues<T extends Record<string, unknown>>(object: T): Partial<T> | undefined {
   const entries = Object.entries(object).filter(([, value]) => value !== undefined);
 
-  if (entries.length === 0) {
-    return undefined;
-  }
+  if (entries.length === 0) {}
   // Acceptable as Object.fromEntries returns filtered subset of T entries
   // oxlint-disable-next-line typescript/no-unsafe-type-assertion
killedBy: pickDefinedValues should return undefined when input is undefined
statusReason: expected {} to strictly equal undefined
