[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:6:22
 const API_RESPONSE_EXCEPTION_VALIDATION_DETAILS_DTO = z.strictObject({
   code: z.string()
     .describe("Validation error code")
-    .meta({ example: "type_error" }),
+    .meta({ example: "" }),
   message: z.string()
     .describe("Validation error message")
killedBy: Api Response Exception Validation Details DTO Shape code should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:8:15
     .describe("Validation error code")
     .meta({ example: "type_error" }),
   message: z.string()
-    .describe("Validation error message")
+    .describe("")
     .meta({ example: "Expected type string but received type number" }),
   path: z.array(z.union([z.string(), z.number()]))
killedBy: Api Response Exception Validation Details DTO Shape message should have correct description when accessing the description.
statusReason: expected '' to be 'Validation error message' // Object.is equality

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:12:31
     .meta({ example: "Expected type string but received type number" }),
   path: z.array(z.union([z.string(), z.number()]))
     .describe("Path to the invalid property")
-    .meta({ example: ["user", "age"] }),
+    .meta({ example: ["user", ""] }),
   expected: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape path should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:16:22
   expected: z.string()
     .optional()
     .describe("Expected type of the invalid property value when applicable")
-    .meta({ example: "string" }),
+    .meta({ example: "" }),
   received: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape expected should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] ObjectLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:16:11
   expected: z.string()
     .optional()
     .describe("Expected type of the invalid property value when applicable")
-    .meta({ example: "string" }),
+    .meta({}),
   received: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape expected should have correct metadata when accessing the meta.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] ObjectLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:24:11
   origin: z.string()
     .optional()
     .describe("Origin type of the invalid property value when applicable")
-    .meta({ example: "number" }),
+    .meta({}),
   format: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape origin should have correct metadata when accessing the meta.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:24:22
   origin: z.string()
     .optional()
     .describe("Origin type of the invalid property value when applicable")
-    .meta({ example: "number" }),
+    .meta({ example: "" }),
   format: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape origin should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:27:15
     .meta({ example: "number" }),
   format: z.string()
     .optional()
-    .describe("Expected high-level value format (e.g. 'uuid', 'email') when applicable")
+    .describe("")
     .meta({ example: "email" }),
   pattern: z.string()
killedBy: Api Response Exception Validation Details DTO Shape format should have correct description when accessing the description.
statusReason: expected '' to be 'Expected high-level value format (e.g…' // Object.is equality

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:28:22
   format: z.string()
     .optional()
     .describe("Expected high-level value format (e.g. 'uuid', 'email') when applicable")
-    .meta({ example: "email" }),
+    .meta({ example: "" }),
   pattern: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape format should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] ObjectLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:28:11
   format: z.string()
     .optional()
     .describe("Expected high-level value format (e.g. 'uuid', 'email') when applicable")
-    .meta({ example: "email" }),
+    .meta({}),
   pattern: z.string()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape format should have correct metadata when accessing the meta.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] ObjectLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:32:11
   pattern: z.string()
     .optional()
     .describe("Expected regex pattern when applicable")
-    .meta({ example: String.raw`^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$` }),
+    .meta({}),
   minimum: z.number()
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape pattern should have correct metadata when accessing the meta.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:35:15
     .meta({ example: String.raw`^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$` }),
   minimum: z.number()
     .optional()
-    .describe("Expected minimum value when applicable")
+    .describe("")
     .meta({ example: 1 }),
   maximum: z.number()
killedBy: Api Response Exception Validation Details DTO Shape minimum should have correct description when accessing the description.
statusReason: expected '' to be 'Expected minimum value when applicable' // Object.is equality

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:39:15
     .meta({ example: 1 }),
   maximum: z.number()
     .optional()
-    .describe("Expected maximum value when applicable")
+    .describe("")
     .meta({ example: 255 }),
   inclusive: z.boolean()
killedBy: Api Response Exception Validation Details DTO Shape maximum should have correct description when accessing the description.
statusReason: expected '' to be 'Expected maximum value when applicable' // Object.is equality

[Killed] BooleanLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:44:22
   inclusive: z.boolean()
     .optional()
     .describe("Whether the minimum or maximum value is inclusive when applicable")
-    .meta({ example: true }),
+    .meta({ example: false }),
   keys: z.array(z.string())
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape inclusive should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] ObjectLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:48:11
   keys: z.array(z.string())
     .optional()
     .describe("List unrecognized keys when applicable")
-    .meta({ example: ["unexpectedKey1", "unexpectedKey2"] }),
+    .meta({}),
   values: z.array(z.union([z.string(), z.number(), z.boolean()]))
     .optional()
killedBy: Api Response Exception Validation Details DTO Shape keys should have correct metadata when accessing the meta.
statusReason: expected { Object (description) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:51:15
     .meta({ example: ["unexpectedKey1", "unexpectedKey2"] }),
   values: z.array(z.union([z.string(), z.number(), z.boolean()]))
     .optional()
-    .describe("List of expected values when applicable")
+    .describe("")
     .meta({ example: ["expectedValue1", "expectedValue2"] }),
 });
killedBy: Api Response Exception Validation Details DTO Shape values should have correct description when accessing the description.
statusReason: expected '' to be 'List of expected values when applicab…' // Object.is equality

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:52:41
   values: z.array(z.union([z.string(), z.number(), z.boolean()]))
     .optional()
     .describe("List of expected values when applicable")
-    .meta({ example: ["expectedValue1", "expectedValue2"] }),
+    .meta({ example: ["expectedValue1", ""] }),
 });
 
killedBy: Api Response Exception Validation Details DTO Shape values should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
dto/api-response-exception/api-response-exception-validation-details/api-response-exception-validation-details.dto.shape.ts:52:23
   values: z.array(z.union([z.string(), z.number(), z.boolean()]))
     .optional()
     .describe("List of expected values when applicable")
-    .meta({ example: ["expectedValue1", "expectedValue2"] }),
+    .meta({ example: ["", "expectedValue2"] }),
 });
 
killedBy: Api Response Exception Validation Details DTO Shape values should have correct metadata when accessing the meta.
statusReason: expected { …(2) } to strictly equal { …(2) }
