[Killed] StringLiteral
http/dto/api-response-exception/api-response-exception.dto.shape.ts:10:15
     .describe("HTTP status code of the error response")
     .meta({ example: 400 }),
   message: z.string()
-    .describe("Error message")
+    .describe("")
     .meta({ example: "The request could not be understood by the server due to malformed syntax." }),
   error: z.string()
killedBy: Api Response Exception DTO Shape message should have correct description when accessing the description.
statusReason: expected '' to be 'Error message' // Object.is equality

[Killed] StringLiteral
http/dto/api-response-exception/api-response-exception.dto.shape.ts:21:22
   errorCode: z.string()
     .optional()
     .describe("Machine-readable error code for frontend mapping and localization")
-    .meta({ example: "question-theme-referenced-by-live-questions" }),
+    .meta({ example: "" }),
 });
 
killedBy: Api Response Exception DTO Shape errorCode should have correct metadata when accessing the metadata.
statusReason: expected { …(2) } to strictly equal { …(2) }
