[Killed] StringLiteral
http/errors/helpers/errors.helpers.ts:4:64
 import { dash } from "radashi";
 
 function getDerivedErrorCodeFromClassName(errorClassName: string): string {
-  const withoutErrorSuffix = errorClassName.replace(/Error$/u, "");
+  const withoutErrorSuffix = errorClassName.replace(/Error$/u, "Stryker was here!");
 
   return dash(withoutErrorSuffix);
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,11 +1,11 @@
  [

[Killed] Regex
http/errors/helpers/errors.helpers.ts:4:53
 import { dash } from "radashi";
 
 function getDerivedErrorCodeFromClassName(errorClassName: string): string {
-  const withoutErrorSuffix = errorClassName.replace(/Error$/u, "");
+  const withoutErrorSuffix = errorClassName.replace(/Error/u, "");
 
   return dash(withoutErrorSuffix);
killedBy: getDerivedErrorCodeFromClassName 'should not remove \'Error\' when it a…'
statusReason: expected 'in-the-middle' to be 'error-in-the-middle' // Object.is equality
