[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:43:113
 
   private readonly logger = new Logger(GlobalExceptionFilter.name);
 
-  private static sendNestHttpException(exception: HttpException, response: FastifyReply | ServerResponse): void {
-    if (response instanceof ServerResponse) {
-      response.writeHead(exception.getStatus(), { "Content-Type": "application/json" });
-      response.end(JSON.stringify(exception.getResponse()));
-
-      return;
-    }
-    response.status(exception.getStatus()).send(exception.getResponse());
-  }
+  private static sendNestHttpException(exception: HttpException, response: FastifyReply | ServerResponse): void {}
 
   private static sendZodValidationException(exception: ZodValidationException, response: FastifyReply | ServerResponse): void {
killedBy: GlobalExceptionFilter sendNestHttpException should send the correct status using the FastifyReply when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ 404 ]

Number of calls: 0

[Killed] StringLiteral
http/filters/global-exception/global-exception.filter.ts:45:67
 
   private static sendNestHttpException(exception: HttpException, response: FastifyReply | ServerResponse): void {
     if (response instanceof ServerResponse) {
-      response.writeHead(exception.getStatus(), { "Content-Type": "application/json" });
+      response.writeHead(exception.getStatus(), { "Content-Type": "" });
       response.end(JSON.stringify(exception.getResponse()));
 
killedBy: GlobalExceptionFilter sendNestHttpException should write the correct head using the ServerResponse when called.
statusReason: expected "vi.fn()" to be called with arguments: [ 404, …(1) ]

Received:

  1st vi.fn() call:

  [
    404,

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:46:7
   private static sendNestHttpException(exception: HttpException, response: FastifyReply | ServerResponse): void {
     if (response instanceof ServerResponse) {
       response.writeHead(exception.getStatus(), { "Content-Type": "application/json" });
-      response.end(JSON.stringify(exception.getResponse()));
+      ;
 
       return;
killedBy: GlobalExceptionFilter sendNestHttpException should end the response with the correct response using the ServerResponse when called.
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:50:5
 
       return;
     }
-    response.status(exception.getStatus()).send(exception.getResponse());
+    ;
   }
 
killedBy: GlobalExceptionFilter sendNestHttpException should send the correct status using the FastifyReply when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ 404 ]

Number of calls: 0

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:53:127
     response.status(exception.getStatus()).send(exception.getResponse());
   }
 
-  private static sendZodValidationException(exception: ZodValidationException, response: FastifyReply | ServerResponse): void {
-    const zodError = exception.getZodError();
-    const validationDetails = zodError instanceof ZodError ? zodError.issues : [];
-    const badRequestException = new BadRequestException({
-      statusCode: HttpStatus.BAD_REQUEST,
-      message: "Invalid request payload",
-      error: "Bad Request",
-      validationDetails,
-    });
-
-    this.sendNestHttpException(badRequestException, response);
-  }
+  private static sendZodValidationException(exception: ZodValidationException, response: FastifyReply | ServerResponse): void {}
 
   public catch(exception: unknown, host: ArgumentsHost): void {
killedBy: GlobalExceptionFilter sendZodValidationException should send BadRequestException status when called.
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
http/filters/global-exception/global-exception.filter.ts:56:57
   private static sendZodValidationException(exception: ZodValidationException, response: FastifyReply | ServerResponse): void {
     const zodError = exception.getZodError();
     const validationDetails = zodError instanceof ZodError ? zodError.issues : [];
-    const badRequestException = new BadRequestException({
-      statusCode: HttpStatus.BAD_REQUEST,
-      message: "Invalid request payload",
-      error: "Bad Request",
-      validationDetails,
-    });
+    const badRequestException = new BadRequestException({});
 
     this.sendNestHttpException(badRequestException, response);
killedBy: GlobalExceptionFilter sendZodValidationException should send BadRequestException status when called.
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,24 +1,9 @@
  [

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:63:5
       validationDetails,
     });
 
-    this.sendNestHttpException(badRequestException, response);
+    ;
   }
 
killedBy: GlobalExceptionFilter sendZodValidationException should send BadRequestException status when called.
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:69:54
   public catch(exception: unknown, host: ArgumentsHost): void {
     const response = host.switchToHttp().getResponse<FastifyReply | ServerResponse>();
 
-    if (exception instanceof ZodValidationException) {
-      GlobalExceptionFilter.sendZodValidationException(exception, response);
-
-      return;
-    }
+    if (exception instanceof ZodValidationException) {}
 
     if (exception instanceof HttpException) {
killedBy: GlobalExceptionFilter catch 'should send zod validation exception …'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,28 +1,41 @@
  [

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:70:7
     const response = host.switchToHttp().getResponse<FastifyReply | ServerResponse>();
 
     if (exception instanceof ZodValidationException) {
-      GlobalExceptionFilter.sendZodValidationException(exception, response);
+      ;
 
       return;
killedBy: GlobalExceptionFilter catch 'should send zod validation exception …'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:75:45
       return;
     }
 
-    if (exception instanceof HttpException) {
-      GlobalExceptionFilter.sendNestHttpException(exception, response);
-
-      return;
-    }
+    if (exception instanceof HttpException) {}
 
     if (Error.isError(exception)) {
killedBy: GlobalExceptionFilter catch 'should send directly nest http except…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,17 +1,16 @@
  [

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:76:7
     }
 
     if (exception instanceof HttpException) {
-      GlobalExceptionFilter.sendNestHttpException(exception, response);
+      ;
 
       return;
killedBy: GlobalExceptionFilter catch 'should send directly nest http except…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:81:35
       return;
     }
 
-    if (Error.isError(exception)) {
-      const DomainHttpExceptionFactory = GlobalExceptionFilter.domainErrorHttpExceptionFactories[exception.name];
-      if (DomainHttpExceptionFactory) {
-        const domainHttpException = new DomainHttpExceptionFactory();
-        const statusCode = domainHttpException.getStatus();
-        const httpException = new HttpException({
-          error: domainHttpException.message,
-          message: exception.message,
-          statusCode,
-          errorCode: getDerivedErrorCodeFromClassName(exception.constructor.name),
-        }, statusCode);
-
-        GlobalExceptionFilter.sendNestHttpException(httpException, response);
-
-        return;
-      }
-    }
+    if (Error.isError(exception)) {}
 
     this.sendUnknownException(exception, response);
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,18 +1,16 @@
  [

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:83:39
 
     if (Error.isError(exception)) {
       const DomainHttpExceptionFactory = GlobalExceptionFilter.domainErrorHttpExceptionFactories[exception.name];
-      if (DomainHttpExceptionFactory) {
-        const domainHttpException = new DomainHttpExceptionFactory();
-        const statusCode = domainHttpException.getStatus();
-        const httpException = new HttpException({
-          error: domainHttpException.message,
-          message: exception.message,
-          statusCode,
-          errorCode: getDerivedErrorCodeFromClassName(exception.constructor.name),
-        }, statusCode);
-
-        GlobalExceptionFilter.sendNestHttpException(httpException, response);
-
-        return;
-      }
+      if (DomainHttpExceptionFactory) {}
     }
 
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Received:

  1st sendNestHttpException call:

@@ -1,18 +1,16 @@
  [

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:93:9
           errorCode: getDerivedErrorCodeFromClassName(exception.constructor.name),
         }, statusCode);
 
-        GlobalExceptionFilter.sendNestHttpException(httpException, response);
+        ;
 
         return;
killedBy: GlobalExceptionFilter catch 'should map domain error to http excep…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:99:5
       }
     }
 
-    this.sendUnknownException(exception, response);
+    ;
   }
 
killedBy: GlobalExceptionFilter catch 'should send unknown exception as inte…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
http/filters/global-exception/global-exception.filter.ts:102:99
     this.sendUnknownException(exception, response);
   }
 
-  private sendUnknownException(exception: unknown, response: FastifyReply | ServerResponse): void {
-    const errorMessage = Error.isError(exception) ? exception.message : String(exception);
-    this.logger.error(errorMessage);
-    const internalServerErrorException = new InternalServerErrorException();
-
-    GlobalExceptionFilter.sendNestHttpException(internalServerErrorException, response);
-  }
+  private sendUnknownException(exception: unknown, response: FastifyReply | ServerResponse): void {}
 }
killedBy: GlobalExceptionFilter catch 'should send unknown exception as inte…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:104:5
 
   private sendUnknownException(exception: unknown, response: FastifyReply | ServerResponse): void {
     const errorMessage = Error.isError(exception) ? exception.message : String(exception);
-    this.logger.error(errorMessage);
+    ;
     const internalServerErrorException = new InternalServerErrorException();
 
killedBy: GlobalExceptionFilter sendUnknownException should log the error message when called with an Error.
statusReason: expected "vi.fn()" to be called once with arguments: [ 'Unknown error occurred' ]

Number of calls: 0

[Killed] CallExpression
http/filters/global-exception/global-exception.filter.ts:107:5
     this.logger.error(errorMessage);
     const internalServerErrorException = new InternalServerErrorException();
 
-    GlobalExceptionFilter.sendNestHttpException(internalServerErrorException, response);
+    ;
   }
 }
killedBy: GlobalExceptionFilter catch 'should send unknown exception as inte…'
statusReason: expected "sendNestHttpException" to be called once with arguments: [ …(2) ]

Number of calls: 0
