[Killed] BlockStatement
http/middlewares/localization/localization.middleware.ts:26:124
 export class LocalizationMiddleware implements NestMiddleware {
   public constructor(@Inject(AppConfigService) private readonly appConfigService: AppConfigService) {}
 
-  private static useFallbackLocale(requestRaw: AugmentedFastifyRequestRaw, fallbackLocale: Locale, next: () => void): void {
-    requestRaw.localizationOptions = {
-      locale: fallbackLocale,
-      fallbackLocale,
-    };
-    next();
-  }
+  private static useFallbackLocale(requestRaw: AugmentedFastifyRequestRaw, fallbackLocale: Locale, next: () => void): void {}
 
   public use(requestRaw: AugmentedFastifyRequestRaw, _: FastifyReply["raw"], next: () => void): void {
killedBy: LocalizationMiddleware useFallbackLocale should set localization options with fallback locale when called.
statusReason: expected { localizationOptions: {} } to strictly equal { localizationOptions: { …(2) } }

[Killed] CallExpression
http/middlewares/localization/localization.middleware.ts:31:5
       locale: fallbackLocale,
       fallbackLocale,
     };
-    next();
+    ;
   }
 
killedBy: LocalizationMiddleware useFallbackLocale should call next function when called.
statusReason: expected "vi.fn()" to be called once with arguments: []

Number of calls: 0

[Killed] BlockStatement
http/middlewares/localization/localization.middleware.ts:34:102
     next();
   }
 
-  public use(requestRaw: AugmentedFastifyRequestRaw, _: FastifyReply["raw"], next: () => void): void {
-    const headerLocale = this.getFirstLocaleFromHeader(requestRaw.headers["accept-language"]);
-    const { fallbackLocale } = this.appConfigService.localizationConfig;
-    if (headerLocale === undefined) {
-      LocalizationMiddleware.useFallbackLocale(requestRaw, fallbackLocale, next);
-
-      return;
-    }
-    const parsedLocale = z.enum(LOCALES).safeParse(headerLocale);
-    if (!parsedLocale.success) {
-      throw new BadRequestException(`Invalid locale '${headerLocale}' in 'Accept-Language' header, supported locales are: ${LOCALES.join(", ")} (only the first locale is considered)`);
-    }
-
-    requestRaw.localizationOptions = {
-      locale: parsedLocale.data,
-      fallbackLocale,
-    };
-    next();
-  }
+  public use(requestRaw: AugmentedFastifyRequestRaw, _: FastifyReply["raw"], next: () => void): void {}
 
   private getFirstLocaleFromHeader(headerLocale?: string): string | undefined {
killedBy: LocalizationMiddleware use should set localization options with fallback locale when header locale is undefined.
statusReason: expected { headers: {} } to strictly equal { headers: {}, …(1) }

[Killed] BlockStatement
http/middlewares/localization/localization.middleware.ts:37:37
   public use(requestRaw: AugmentedFastifyRequestRaw, _: FastifyReply["raw"], next: () => void): void {
     const headerLocale = this.getFirstLocaleFromHeader(requestRaw.headers["accept-language"]);
     const { fallbackLocale } = this.appConfigService.localizationConfig;
-    if (headerLocale === undefined) {
-      LocalizationMiddleware.useFallbackLocale(requestRaw, fallbackLocale, next);
-
-      return;
-    }
+    if (headerLocale === undefined) {}
     const parsedLocale = z.enum(LOCALES).safeParse(headerLocale);
     if (!parsedLocale.success) {
killedBy: LocalizationMiddleware use should set localization options with fallback locale when header locale is undefined.
statusReason: Invalid locale 'undefined' in 'Accept-Language' header, supported locales are: en, fr, es, de, it, pt (only the first locale is considered)

[Killed] ConditionalExpression
http/middlewares/localization/localization.middleware.ts:37:9
   public use(requestRaw: AugmentedFastifyRequestRaw, _: FastifyReply["raw"], next: () => void): void {
     const headerLocale = this.getFirstLocaleFromHeader(requestRaw.headers["accept-language"]);
     const { fallbackLocale } = this.appConfigService.localizationConfig;
-    if (headerLocale === undefined) {
+    if (false) {
       LocalizationMiddleware.useFallbackLocale(requestRaw, fallbackLocale, next);
 
killedBy: LocalizationMiddleware use should set localization options with fallback locale when header locale is undefined.
statusReason: Invalid locale 'undefined' in 'Accept-Language' header, supported locales are: en, fr, es, de, it, pt (only the first locale is considered)

[Killed] CallExpression
http/middlewares/localization/localization.middleware.ts:38:7
     const headerLocale = this.getFirstLocaleFromHeader(requestRaw.headers["accept-language"]);
     const { fallbackLocale } = this.appConfigService.localizationConfig;
     if (headerLocale === undefined) {
-      LocalizationMiddleware.useFallbackLocale(requestRaw, fallbackLocale, next);
+      ;
 
       return;
killedBy: LocalizationMiddleware use should set localization options with fallback locale when header locale is undefined.
statusReason: expected { headers: {} } to strictly equal { headers: {}, …(1) }

[Killed] MethodExpression
http/middlewares/localization/localization.middleware.ts:60:25
     }
     const { fallbackLocale } = this.appConfigService.localizationConfig;
     const localeLength = 2;
-    const firstLocale = headerLocale.trim().slice(0, localeLength).toLowerCase();
+    const firstLocale = headerLocale.trim().toLowerCase();
     if (firstLocale === "*") {
       return fallbackLocale;
killedBy: LocalizationMiddleware use should set localization options with parsed locale when header locale is valid.
statusReason: Invalid locale 'fr, en;q=0.8' in 'Accept-Language' header, supported locales are: en, fr, es, de, it, pt (only the first locale is considered)

[Killed] MethodExpression
http/middlewares/localization/localization.middleware.ts:60:25
     }
     const { fallbackLocale } = this.appConfigService.localizationConfig;
     const localeLength = 2;
-    const firstLocale = headerLocale.trim().slice(0, localeLength).toLowerCase();
+    const firstLocale = headerLocale.slice(0, localeLength).toLowerCase();
     if (firstLocale === "*") {
       return fallbackLocale;
killedBy: LocalizationMiddleware getFirstLocaleFromHeader 'should return the first locale trimme…'
statusReason: expected '  ' to be 'pt' // Object.is equality

[Killed] ConditionalExpression
http/middlewares/localization/localization.middleware.ts:61:9
     const { fallbackLocale } = this.appConfigService.localizationConfig;
     const localeLength = 2;
     const firstLocale = headerLocale.trim().slice(0, localeLength).toLowerCase();
-    if (firstLocale === "*") {
+    if (false) {
       return fallbackLocale;
     }
killedBy: LocalizationMiddleware getFirstLocaleFromHeader 'should return fallback locale when he…'
statusReason: expected '*' to be 'en' // Object.is equality

[Killed] BlockStatement
http/middlewares/localization/localization.middleware.ts:61:30
     const { fallbackLocale } = this.appConfigService.localizationConfig;
     const localeLength = 2;
     const firstLocale = headerLocale.trim().slice(0, localeLength).toLowerCase();
-    if (firstLocale === "*") {
-      return fallbackLocale;
-    }
+    if (firstLocale === "*") {}
     return firstLocale;
   }
killedBy: LocalizationMiddleware getFirstLocaleFromHeader 'should return fallback locale when he…'
statusReason: expected '*' to be 'en' // Object.is equality
