[Killed] LogicalOperator
pipes/mongo/mongo-id/mongo-id.pipe.ts:9:9
 @Injectable()
 export class MongoIdPipe implements PipeTransform<unknown, string> {
   public transform(value: unknown): string {
-    if (value === undefined || value === null) {
+    if (value === undefined && value === null) {
       throw new BadRequestException("Mongo ID must be provided");
     }
killedBy: MongoIdPipe transform 'should throw BadRequestException when…'
statusReason: expected a thrown error to be BadRequestException: Mongo ID must be pro… { …(4) }

[Killed] EqualityOperator
pipes/mongo/mongo-id/mongo-id.pipe.ts:9:9
 @Injectable()
 export class MongoIdPipe implements PipeTransform<unknown, string> {
   public transform(value: unknown): string {
-    if (value === undefined || value === null) {
+    if (value !== undefined || value === null) {
       throw new BadRequestException("Mongo ID must be provided");
     }
killedBy: MongoIdPipe transform should return value when value is a valid mongo id.
statusReason: Mongo ID must be provided

[Killed] StringLiteral
pipes/mongo/mongo-id/mongo-id.pipe.ts:10:37
 export class MongoIdPipe implements PipeTransform<unknown, string> {
   public transform(value: unknown): string {
     if (value === undefined || value === null) {
-      throw new BadRequestException("Mongo ID must be provided");
+      throw new BadRequestException("");
     }
     if (typeof value !== "string") {
killedBy: MongoIdPipe transform 'should throw BadRequestException when…'
statusReason: expected a thrown error to be BadRequestException: Mongo ID must be pro… { …(4) }

[Killed] StringLiteral
pipes/mongo/mongo-id/mongo-id.pipe.ts:13:37
       throw new BadRequestException("Mongo ID must be provided");
     }
     if (typeof value !== "string") {
-      throw new BadRequestException(`Mongo ID must be a string, but received: ${typeof value}`);
+      throw new BadRequestException(``);
     }
     if (!Types.ObjectId.isValid(value)) {
killedBy: MongoIdPipe transform 'should throw BadRequestException when…'
statusReason: expected a thrown error to be BadRequestException: Mongo ID must be a s… { …(4) }

[Killed] ConditionalExpression
pipes/mongo/mongo-id/mongo-id.pipe.ts:15:9
     if (typeof value !== "string") {
       throw new BadRequestException(`Mongo ID must be a string, but received: ${typeof value}`);
     }
-    if (!Types.ObjectId.isValid(value)) {
+    if (false) {
       throw new BadRequestException(`Invalid Mongo ID: ${value}`);
     }
killedBy: MongoIdPipe transform 'should throw BadRequestException when…'
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
pipes/mongo/mongo-id/mongo-id.pipe.ts:15:9
     if (typeof value !== "string") {
       throw new BadRequestException(`Mongo ID must be a string, but received: ${typeof value}`);
     }
-    if (!Types.ObjectId.isValid(value)) {
+    if (Types.ObjectId.isValid(value)) {
       throw new BadRequestException(`Invalid Mongo ID: ${value}`);
     }
killedBy: MongoIdPipe transform should return value when value is a valid mongo id.
statusReason: Invalid Mongo ID: 507f1f77bcf86cd799439011
