[Killed] MethodExpression
zod/validators/limit/limit.zod.validators.ts:8:10
 import type { ZodCoercedNumber, ZodDefault, ZodOptional } from "zod";
 
 function zLimit(): ZodDefault<ZodOptional<ZodCoercedNumber>> {
-  return z.coerce.number()
-    .int()
-    .min(LIMIT_MINIMUM)
+  return z.coerce.number().int().max(LIMIT_MINIMUM)
     .optional()
     .default(LIMIT_DEFAULT)
killedBy: Find Questions Query DTO Shape should pass validation when a valid dto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "number",\n    …' was thrown
