[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:11:10
 import type { Locale } from "@shared/domain/value-objects/locale/locale.types";
 
 function hasAtLeastOneLocaleValue(object: Record<string, unknown>): boolean {
-  return Object.values(object).some(value => value !== undefined);
+  return Object.values(object).every(value => value !== undefined);
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedLabel 'should return false when value has no…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
zod/validators/localization/localization.zod.validators.ts:11:46
 import type { Locale } from "@shared/domain/value-objects/locale/locale.types";
 
 function hasAtLeastOneLocaleValue(object: Record<string, unknown>): boolean {
-  return Object.values(object).some(value => value !== undefined);
+  return Object.values(object).some(value => false);
 }
 
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedLabel 'should return true when value is a va…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:29:10
   const localeLabel = LOCALE_LABELS[locale];
   const localeExample = LOCALE_EXAMPLES[locale];
 
-  return z.string()
-    .trim()
-    .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
-    .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH)
+  return z.string().trim().min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH).min(LOCALIZED_TEXT_ENTRY_MAX_LENGTH)
     .optional()
     .describe(`Text in ${localeLabel}`)
killedBy: Localization Zod Validators zLocalizedTextEntry 'should return true when localized tex…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:29:10
   const localeLabel = LOCALE_LABELS[locale];
   const localeExample = LOCALE_EXAMPLES[locale];
 
-  return z.string()
-    .trim()
+  return z.string()
     .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
     .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH)
killedBy: Localization Zod Validators zLocalizedTextEntry 'should return false when localized te…'
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:42:32
   const localeLabel = LOCALE_LABELS[locale];
   const localeExample = LOCALE_EXAMPLES[locale];
 
-  const zLocalizedTextsValue = z.string()
-    .trim()
+  const zLocalizedTextsValue = z.string()
     .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
     .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH);
killedBy: Localization Zod Validators zLocalizedTextsEntry 'should return false when localized te…'
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:42:32
   const localeLabel = LOCALE_LABELS[locale];
   const localeExample = LOCALE_EXAMPLES[locale];
 
-  const zLocalizedTextsValue = z.string()
-    .trim()
-    .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
+  const zLocalizedTextsValue = z.string().trim().max(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
     .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH);
 
killedBy: Localization Zod Validators zLocalizedTextsEntry 'should return true when localized tex…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:47:10
     .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
     .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH);
 
-  return z.array(zLocalizedTextsValue)
-    .min(LOCALIZED_TEXTS_MIN_LENGTH)
+  return z.array(zLocalizedTextsValue).max(LOCALIZED_TEXTS_MIN_LENGTH)
     .max(LOCALIZED_TEXTS_MAX_LENGTH)
     .optional()
killedBy: Localization Zod Validators zLocalizedTextsEntry 'should return true when localized tex…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/localization/localization.zod.validators.ts:47:10
     .min(LOCALIZED_TEXT_ENTRY_MIN_LENGTH)
     .max(LOCALIZED_TEXT_ENTRY_MAX_LENGTH);
 
-  return z.array(zLocalizedTextsValue)
-    .min(LOCALIZED_TEXTS_MIN_LENGTH)
-    .max(LOCALIZED_TEXTS_MAX_LENGTH)
+  return z.array(zLocalizedTextsValue).min(LOCALIZED_TEXTS_MIN_LENGTH).min(LOCALIZED_TEXTS_MAX_LENGTH)
     .optional()
     .describe(`Texts in ${localeLabel}`)
killedBy: Question Theme DTO Zod Validators zQuestionThemeLocalizedAliases 'should return true when value is a va…'
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
zod/validators/localization/localization.zod.validators.ts:59:15
   const localeEntries: Record<Locale, ZodOptional<ZodString>> = createZLocaleEntries(zLocalizedTextEntry);
 
   return z.strictObject(localeEntries)
-    .describe("Localized text object with translations for multiple languages")
+    .describe("")
     .refine(
       object => hasAtLeastOneLocaleValue(object),
killedBy: Localization Zod Validators zLocalizedText should have correct description when called.
statusReason: expected '' to be 'Localized text object with translatio…' // Object.is equality

[Killed] ArrowFunction
zod/validators/localization/localization.zod.validators.ts:61:7
   return z.strictObject(localeEntries)
     .describe("Localized text object with translations for multiple languages")
     .refine(
-      object => hasAtLeastOneLocaleValue(object),
+      () => undefined,
       { message: LOCALIZED_TEXT_EMPTY_ERROR_MESSAGE },
     );
killedBy: Localization Zod Validators zLocalizedText 'should return true when localized tex…'
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
zod/validators/localization/localization.zod.validators.ts:62:7
     .describe("Localized text object with translations for multiple languages")
     .refine(
       object => hasAtLeastOneLocaleValue(object),
-      { message: LOCALIZED_TEXT_EMPTY_ERROR_MESSAGE },
+      {},
     );
 }
killedBy: Localization Zod Validators zLocalizedText should provide correct error message when all locales are undefined.
statusReason: expected 'Invalid input' to be 'At least one locale must be provided' // Object.is equality
