[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:9:10
 import type { ZodString, ZodISODateTime } from "zod";
 
 function zSlug(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
-    .min(SLUG_MIN_LENGTH)
+  return z.string().trim().max(SLUG_MIN_LENGTH)
     .max(SLUG_MAX_LENGTH)
     .regex(SLUG_REGEX, {
killedBy: AppMetadata DTO Shape should pass validation when assigned valid values.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:9:10
 import type { ZodString, ZodISODateTime } from "zod";
 
 function zSlug(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
-    .min(SLUG_MIN_LENGTH)
-    .max(SLUG_MAX_LENGTH)
+  return z.string().trim().min(SLUG_MIN_LENGTH).min(SLUG_MAX_LENGTH)
     .regex(SLUG_REGEX, {
       error: "Invalid kebab-case value",
killedBy: AppMetadata DTO Shape should pass validation when assigned valid values.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "string",\n    …' was thrown

[Killed] StringLiteral
zod/validators/string/string.zod.validators.ts:17:22
       error: "Invalid kebab-case value",
       ...options,
     })
-    .meta({ example: "example-slug-value" });
+    .meta({ example: "" });
 }
 
killedBy: zSlug should have correct example metadata when accessing the metadata.
statusReason: expected { example: '' } to have property "example" with value 'example-slug-value'

[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:21:10
 }
 
 function zMongoId(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
+  return z.string()
     .regex(MONGO_ID_REGEX, {
       error: "Invalid ObjectId value",
killedBy: zMongoId 'should return true when MongoDB Objec…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:21:10
 }
 
 function zMongoId(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
-    .regex(MONGO_ID_REGEX, {
-      error: "Invalid ObjectId value",
-      ...options,
-    })
-    .toLowerCase()
+  return z.string().trim().regex(MONGO_ID_REGEX, {
+  error: "Invalid ObjectId value",
+  ...options
+}).toUpperCase()
     .meta({ example: "60af924f4f1a2563f8e8b456" });
 }
killedBy: zMongoId should trim spaces from the MongoDB ObjectId value when parsing.
statusReason: expected '507F1F77BCF86CD799439011' to be '507f1f77bcf86cd799439011' // Object.is equality

[Killed] ObjectLiteral
zod/validators/string/string.zod.validators.ts:23:28
 function zMongoId(options: Partial<$ZodCustomParams> = {}): ZodString {
   return z.string()
     .trim()
-    .regex(MONGO_ID_REGEX, {
-      error: "Invalid ObjectId value",
-      ...options,
-    })
+    .regex(MONGO_ID_REGEX, {})
     .toLowerCase()
     .meta({ example: "60af924f4f1a2563f8e8b456" });
killedBy: zMongoId should default error message when MongoDB ObjectId is invalid.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'Invalid ObjectId value' // Object.is equality

[Killed] ObjectLiteral
zod/validators/string/string.zod.validators.ts:36:11
     error: "Invalid ISO 8601 datetime value",
     ...options,
   })
-    .meta({ example: ISO_DATE_TIME_EXAMPLE });
+    .meta({});
 }
 
killedBy: zIsoDateTime should have correct example metadata when accessing the metadata.
statusReason: Cannot convert undefined or null to object

[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:40:10
 }
 
 function zHexColor(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
+  return z.string()
     .regex(HEX_COLOR_REGEX, {
       error: "Invalid hex color; must be 6 hexadecimal digits with # prefix (e.g., #FF5733)",
killedBy: zHexColor 'should return true when hex color is …'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
zod/validators/string/string.zod.validators.ts:40:10
 }
 
 function zHexColor(options: Partial<$ZodCustomParams> = {}): ZodString {
-  return z.string()
-    .trim()
-    .regex(HEX_COLOR_REGEX, {
-      error: "Invalid hex color; must be 6 hexadecimal digits with # prefix (e.g., #FF5733)",
-      ...options,
-    })
-    .toUpperCase()
+  return z.string().trim().regex(HEX_COLOR_REGEX, {
+  error: "Invalid hex color; must be 6 hexadecimal digits with # prefix (e.g., #FF5733)",
+  ...options
+}).toLowerCase()
     .meta({ example: HEX_COLOR_EXAMPLE });
 }
killedBy: zHexColor should trim spaces from the hex color value when parsing.
statusReason: expected '#ff5733' to be '#FF5733' // Object.is equality

[Killed] ObjectLiteral
zod/validators/string/string.zod.validators.ts:42:29
 function zHexColor(options: Partial<$ZodCustomParams> = {}): ZodString {
   return z.string()
     .trim()
-    .regex(HEX_COLOR_REGEX, {
-      error: "Invalid hex color; must be 6 hexadecimal digits with # prefix (e.g., #FF5733)",
-      ...options,
-    })
+    .regex(HEX_COLOR_REGEX, {})
     .toUpperCase()
     .meta({ example: HEX_COLOR_EXAMPLE });
killedBy: zHexColor should default error message when hex color is invalid.
statusReason: expected 'Invalid string: must match pattern /^…' to be 'Invalid hex color; must be 6 hexadeci…' // Object.is equality

[Killed] ObjectLiteral
zod/validators/string/string.zod.validators.ts:47:11
       ...options,
     })
     .toUpperCase()
-    .meta({ example: HEX_COLOR_EXAMPLE });
+    .meta({});
 }
 
killedBy: zHexColor should have correct example metadata when accessing the metadata.
statusReason: Cannot convert undefined or null to object
