[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:6:51
 import type { ZodBoolean, ZodCodec, ZodNumber, ZodObject, ZodOptional, ZodString } from "zod";
 
 function zIsFullyTranslated(): ZodOptional<ZodCodec<ZodString, ZodBoolean>> {
-  return z.stringbool({ truthy: ["true"], falsy: ["false"] })
+  return z.stringbool({ truthy: ["true"], falsy: [""] })
     .optional()
     .describe("Filters resources by translation completeness: 'true' returns only fully translated resources, 'false' returns only incomplete ones. " +
killedBy: Admin Find Questions Query DTO Shape is-fully-translated should pass validation when is-fully-translated is 'false'.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "invalid_value",\…' was thrown

[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:9:7
   return z.stringbool({ truthy: ["true"], falsy: ["false"] })
     .optional()
     .describe("Filters resources by translation completeness: 'true' returns only fully translated resources, 'false' returns only incomplete ones. " +
-      "A resource is fully translated when all mandatory LocalizedText/LocalizedTexts fields have a value " +
+      "" +
       "in every applicable locale, and all optional LocalizedText/LocalizedTexts fields are either absent (never translated) " +
       "or have a value in every applicable locale. " +
killedBy: zIsFullyTranslated should have the correct description when describing the schema.
statusReason: expected 'Filters resources by translation comp…' to be 'Filters resources by translation comp…' // Object.is equality

[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:12:7
       "A resource is fully translated when all mandatory LocalizedText/LocalizedTexts fields have a value " +
       "in every applicable locale, and all optional LocalizedText/LocalizedTexts fields are either absent (never translated) " +
       "or have a value in every applicable locale. " +
-      "Applicable locales come from the resource's applicableLocales field: if absent or empty, " +
+      "" +
       "all 6 supported locales apply (en, fr, es, de, it, pt).");
 }
killedBy: zIsFullyTranslated should have the correct description when describing the schema.
statusReason: expected 'Filters resources by translation comp…' to be 'Filters resources by translation comp…' // Object.is equality

[Killed] StringLiteral
zod/validators/translation-completeness/translation-completeness.zod.validators.ts:19:17
 function zTranslationCompletenessStats(): ZodObject<z.util.Writeable<{ fullyTranslated: ZodNumber; incomplete: ZodNumber }>, z.core.$strict> {
   return z.strictObject({
     fullyTranslated: z.number().int().nonnegative()
-      .describe("Number of resources that are fully translated across all locales"),
+      .describe(""),
     incomplete: z.number().int().nonnegative()
       .describe("Number of resources missing at least one locale in at least one field"),
killedBy: zTranslationCompletenessStats should have the correct description when describing the fullyTranslated field.
statusReason: expected '' to be 'Number of resources that are fully tr…' // Object.is equality
