[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:20:40
     return result;
   }
 
-  if (Object.keys(value).length === 0) {
-    // Acceptable as modifying the result object directly for recursion purposes
-    // oxlint-disable-next-line no-param-reassign
-    result[path] = {};
-  } else {
+  if (Object.keys(value).length === 0) {} else {
     crushDataRecursively(value, path, result);
   }
killedBy: getCrushedDataForMongoPatchUpdate 'should handle empty objects and array…'
statusReason: expected { emptyArray: [], …(1) } to strictly equal { emptyObject: {}, …(3) }

[Killed] EqualityOperator
persistence/mongoose/helpers/mongoose.helpers.ts:20:7
     return result;
   }
 
-  if (Object.keys(value).length === 0) {
+  if (Object.keys(value).length !== 0) {
     // Acceptable as modifying the result object directly for recursion purposes
     // oxlint-disable-next-line no-param-reassign
killedBy: QuestionMongooseRepository modify should call model.findByIdAndUpdate with crushed data when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000070', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000070",

[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:24:10
     // Acceptable as modifying the result object directly for recursion purposes
     // oxlint-disable-next-line no-param-reassign
     result[path] = {};
-  } else {
-    crushDataRecursively(value, path, result);
-  }
+  } else {}
   return result;
 }
killedBy: QuestionMongooseRepository modify should call model.findByIdAndUpdate with crushed data when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000070', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000070",

[Killed] CallExpression
persistence/mongoose/helpers/mongoose.helpers.ts:25:5
     // oxlint-disable-next-line no-param-reassign
     result[path] = {};
   } else {
-    crushDataRecursively(value, path, result);
+    ;
   }
   return result;
killedBy: getCrushedDataForMongoPatchUpdate 'should flatten nested objects when ca…'
statusReason: expected { name: 'Sample Name' } to strictly equal { name: 'Sample Name', …(3) }

[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:31:45
 }
 
 function crushDataRecursively(data: object, parentKey = "", result: Record<string, unknown> = {}): Record<string, unknown> {
-  for (const entry of Object.entries(data)) {
-    crushDataObjectEntry(entry, parentKey, result);
-  }
+  for (const entry of Object.entries(data)) {}
   return result;
 }
killedBy: QuestionMongooseRepository modify should call model.findByIdAndUpdate with crushed data when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '618c1f4b3a2f000000000070', …(1) ]

Received:

  1st vi.fn() call:

  [
    "618c1f4b3a2f000000000070",

[Killed] CallExpression
persistence/mongoose/helpers/mongoose.helpers.ts:32:5
 
 function crushDataRecursively(data: object, parentKey = "", result: Record<string, unknown> = {}): Record<string, unknown> {
   for (const entry of Object.entries(data)) {
-    crushDataObjectEntry(entry, parentKey, result);
+    ;
   }
   return result;
killedBy: getCrushedDataForMongoPatchUpdate 'should flatten nested objects when ca…'
statusReason: expected {} to strictly equal { name: 'Sample Name', …(3) }

[Killed] ConditionalExpression
persistence/mongoose/helpers/mongoose.helpers.ts:69:10
 type MongoSortDirection = 1 | -1;
 
 function getMongoSortDirectionFromSortOrder(sortOrder: SortOrder): MongoSortDirection {
-  return sortOrder === "asc" ? 1 : -1;
+  return false ? 1 : -1;
 }
 
killedBy: getMongoSortDirectionFromSortOrder should return 1 when sort order is undefined
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
persistence/mongoose/helpers/mongoose.helpers.ts:69:10
 type MongoSortDirection = 1 | -1;
 
 function getMongoSortDirectionFromSortOrder(sortOrder: SortOrder): MongoSortDirection {
-  return sortOrder === "asc" ? 1 : -1;
+  return true ? 1 : -1;
 }
 
killedBy: getMongoSortDirectionFromSortOrder should return -1 when sort order is undefined
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:85:36
   const direction = getMongoSortDirectionFromSortOrder(sortOptions.sortOrder);
   const semanticOrder = semanticSortOrders[sortOptions.sortBy];
 
-  if (semanticOrder !== undefined) {
-    return [
-      { $addFields: { _sortPriority: { $indexOfArray: [[...semanticOrder], `$${sortOptions.sortBy}`] } } },
-      { $sort: { _sortPriority: direction, _id: direction } },
-      { $unset: "_sortPriority" },
-    ];
-  }
+  if (semanticOrder !== undefined) {}
   return [{ $sort: { [sortOptions.sortBy]: direction, _id: direction } }];
 }
killedBy: buildMongooseAggregationSortStages when sort field has a semantic order should return $addFields, $sort, and $unset stages with ascending direction when sort order is asc.
statusReason: expected [ { '$sort': { status: 1, _id: 1 } } ] to strictly equal [ { '$addFields': { …(1) } }, …(2) ]

[Killed] ObjectLiteral
persistence/mongoose/helpers/mongoose.helpers.ts:87:21
 
   if (semanticOrder !== undefined) {
     return [
-      { $addFields: { _sortPriority: { $indexOfArray: [[...semanticOrder], `$${sortOptions.sortBy}`] } } },
+      { $addFields: {} },
       { $sort: { _sortPriority: direction, _id: direction } },
       { $unset: "_sortPriority" },
killedBy: buildMongooseAggregationSortStages when sort field has a semantic order should return $addFields, $sort, and $unset stages with ascending direction when sort order is asc.
statusReason: expected [ { '$addFields': {} }, …(2) ] to strictly equal [ { '$addFields': { …(1) } }, …(2) ]

[Killed] StringLiteral
persistence/mongoose/helpers/mongoose.helpers.ts:87:76
 
   if (semanticOrder !== undefined) {
     return [
-      { $addFields: { _sortPriority: { $indexOfArray: [[...semanticOrder], `$${sortOptions.sortBy}`] } } },
+      { $addFields: { _sortPriority: { $indexOfArray: [[...semanticOrder], ``] } } },
       { $sort: { _sortPriority: direction, _id: direction } },
       { $unset: "_sortPriority" },
killedBy: buildMongooseAggregationSortStages when sort field has a semantic order should return $addFields, $sort, and $unset stages with ascending direction when sort order is asc.
statusReason: expected [ { '$addFields': { …(1) } }, …(2) ] to strictly equal [ { '$addFields': { …(1) } }, …(2) ]

[Killed] ObjectLiteral
persistence/mongoose/helpers/mongoose.helpers.ts:88:16
   if (semanticOrder !== undefined) {
     return [
       { $addFields: { _sortPriority: { $indexOfArray: [[...semanticOrder], `$${sortOptions.sortBy}`] } } },
-      { $sort: { _sortPriority: direction, _id: direction } },
+      { $sort: {} },
       { $unset: "_sortPriority" },
     ];
killedBy: buildMongooseAggregationSortStages when sort field has a semantic order should return $addFields, $sort, and $unset stages with ascending direction when sort order is asc.
statusReason: expected [ { '$addFields': { …(1) } }, …(2) ] to strictly equal [ { '$addFields': { …(1) } }, …(2) ]

[Killed] ObjectLiteral
persistence/mongoose/helpers/mongoose.helpers.ts:92:20
       { $unset: "_sortPriority" },
     ];
   }
-  return [{ $sort: { [sortOptions.sortBy]: direction, _id: direction } }];
+  return [{ $sort: {} }];
 }
 
killedBy: buildMongooseAggregationSortStages when sort field has no semantic order should return a simple $sort stage with ascending direction when sort order is asc.
statusReason: expected [ { '$sort': {} } ] to strictly equal [ { '$sort': { createdAt: 1, …(1) } } ]

[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:114:9
   matchStage: Record<string, unknown>,
   key: string,
   valueFunction: (items: T[]) => unknown,
-): void {
-  if (items !== undefined && items.length > 0) {
-    // Acceptable as modifying the match stage builder object directly
-    // oxlint-disable-next-line no-param-reassign
-    matchStage[key] = valueFunction(items);
-  }
-}
+): void {}
 
 export {
killedBy: QuestionMongooseRepository findAll should aggregate with pipeline including _id $in match stage when filters.ids is provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(1) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,18 +1,8 @@
  [

[Killed] ConditionalExpression
persistence/mongoose/helpers/mongoose.helpers.ts:115:30
   key: string,
   valueFunction: (items: T[]) => unknown,
 ): void {
-  if (items !== undefined && items.length > 0) {
+  if (items !== undefined && true) {
     // Acceptable as modifying the match stage builder object directly
     // oxlint-disable-next-line no-param-reassign
killedBy: QuestionMongooseRepository findRandom should not add filter to match stage when provided array is empty.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -51,11 +51,23 @@
            },

[Killed] BlockStatement
persistence/mongoose/helpers/mongoose.helpers.ts:115:48
   key: string,
   valueFunction: (items: T[]) => unknown,
 ): void {
-  if (items !== undefined && items.length > 0) {
-    // Acceptable as modifying the match stage builder object directly
-    // oxlint-disable-next-line no-param-reassign
-    matchStage[key] = valueFunction(items);
-  }
+  if (items !== undefined && items.length > 0) {}
 }
 
killedBy: QuestionMongooseRepository findAll should aggregate with pipeline including _id $in match stage when filters.ids is provided.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(1) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -1,18 +1,8 @@
  [
