[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:11:73
  * Used for the "this field has every locale set" check in static (no `applicableLocales`) mode.
  */
 function buildLocaleNonNullConditions(path: string, locales: readonly Locale[]): Record<string, unknown> {
-  return Object.fromEntries(locales.map(locale => [`${path}.${locale}`, { $ne: null }]));
+  return Object.fromEntries(locales.map(locale => [`${path}.${locale}`, {}]));
 }
 
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -2,40 +2,32 @@
    [

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:11:51
  * Used for the "this field has every locale set" check in static (no `applicableLocales`) mode.
  */
 function buildLocaleNonNullConditions(path: string, locales: readonly Locale[]): Record<string, unknown> {
-  return Object.fromEntries(locales.map(locale => [`${path}.${locale}`, { $ne: null }]));
+  return Object.fromEntries(locales.map(locale => []));
 }
 
killedBy: QuestionMongooseRepository findRandom should aggregate with match, sample and pipeline stages when limit is 5.
statusReason: expected "vi.fn()" to be called once with arguments: [ [ { '$match': { …(3) } }, …(7) ] ]

Received:

  1st vi.fn() call:

@@ -2,40 +2,32 @@
    [

[Killed] ConditionalExpression
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:30:7
 function buildFieldCompleteCondition(fieldSpec: TranslationCompletenessFieldSpec, locales: readonly Locale[]): Record<string, unknown> {
   const allLocalesSet = buildLocaleNonNullConditions(fieldSpec.path, locales);
 
-  if (fieldSpec.isMandatory) {
+  if (true) {
     return allLocalesSet;
   }
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$and': [ { …(6) } ] } to strictly equal { '$and': [ { '$or': [ …(2) ] } ] }

[Killed] BlockStatement
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:30:30
 function buildFieldCompleteCondition(fieldSpec: TranslationCompletenessFieldSpec, locales: readonly Locale[]): Record<string, unknown> {
   const allLocalesSet = buildLocaleNonNullConditions(fieldSpec.path, locales);
 
-  if (fieldSpec.isMandatory) {
-    return allLocalesSet;
-  }
+  if (fieldSpec.isMandatory) {}
   return { $or: [{ [fieldSpec.path]: null }, allLocalesSet] };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$and': [ { '$or': [ …(2) ] } ] } to strictly equal { '$and': [ { …(6) } ] }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:33:17
   if (fieldSpec.isMandatory) {
     return allLocalesSet;
   }
-  return { $or: [{ [fieldSpec.path]: null }, allLocalesSet] };
+  return { $or: [] };
 }
 
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$and': [ { '$or': [] } ] } to strictly equal { '$and': [ { '$or': [ …(2) ] } ] }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:33:10
   if (fieldSpec.isMandatory) {
     return allLocalesSet;
   }
-  return { $or: [{ [fieldSpec.path]: null }, allLocalesSet] };
+  return {};
 }
 
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$and': [ {} ] } to strictly equal { '$and': [ { '$or': [ …(2) ] } ] }

[Killed] BlockStatement
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:44:30
 function buildFieldIncompleteCondition(fieldSpec: TranslationCompletenessFieldSpec, locales: readonly Locale[]): Record<string, unknown> {
   const someLocaleMissing = { $or: buildLocaleNullConditions(fieldSpec.path, locales) };
 
-  if (fieldSpec.isMandatory) {
-    return someLocaleMissing;
-  }
+  if (fieldSpec.isMandatory) {}
   return { $and: [{ [fieldSpec.path]: { $ne: null } }, someLocaleMissing] };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$or': [ { '$and': [ …(2) ] } ] } to strictly equal { '$or': [ { '$or': [ …(6) ] } ] }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:47:18
   if (fieldSpec.isMandatory) {
     return someLocaleMissing;
   }
-  return { $and: [{ [fieldSpec.path]: { $ne: null } }, someLocaleMissing] };
+  return { $and: [] };
 }
 
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$or': [ { '$and': [] } ] } to strictly equal { '$or': [ { '$and': [ …(2) ] } ] }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:58:12
  */
 function buildRequiredLocalesExpression(applicableLocalesPath: string): Record<string, unknown> {
   return {
-    $cond: [
-      { $eq: [{ $size: { $ifNull: [applicableLocalesPath, []] } }, 0] },
-      LOCALES,
-      applicableLocalesPath,
-    ],
+    $cond: [],
   };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:59:14
 function buildRequiredLocalesExpression(applicableLocalesPath: string): Record<string, unknown> {
   return {
     $cond: [
-      { $eq: [{ $size: { $ifNull: [applicableLocalesPath, []] } }, 0] },
+      { $eq: [] },
       LOCALES,
       applicableLocalesPath,
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:59:15
 function buildRequiredLocalesExpression(applicableLocalesPath: string): Record<string, unknown> {
   return {
     $cond: [
-      { $eq: [{ $size: { $ifNull: [applicableLocalesPath, []] } }, 0] },
+      { $eq: [{}, 0] },
       LOCALES,
       applicableLocalesPath,
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] StringLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:73:14
 function buildDynamicLocaleFieldExpression(path: string, localeVariable: string): Record<string, unknown> {
   return {
     $getField: {
-      field: `$$${localeVariable}`,
+      field: ``,
       input: `$${path}`,
     },
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:86:29
  * Resolves applicable locales dynamically from the document's `applicableLocalesPath`.
  */
 function buildDynamicFieldCompleteCondition(fieldSpec: TranslationCompletenessFieldSpec, applicableLocalesPath: string): Record<string, unknown> {
-  const allLocalesNonNull = {
-    $allElementsTrue: [
-      {
-        $map: {
-          input: buildRequiredLocalesExpression(applicableLocalesPath),
-          as: "locale",
-          in: {
-            $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null],
-          },
-        },
-      },
-    ],
-  };
+  const allLocalesNonNull = {};
 
   if (fieldSpec.isMandatory) {
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ {} ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:89:15
   const allLocalesNonNull = {
     $allElementsTrue: [
       {
-        $map: {
-          input: buildRequiredLocalesExpression(applicableLocalesPath),
-          as: "locale",
-          in: {
-            $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null],
-          },
-        },
+        $map: {},
       },
     ],
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:92:15
         $map: {
           input: buildRequiredLocalesExpression(applicableLocalesPath),
           as: "locale",
-          in: {
-            $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null],
-          },
+          in: {},
         },
       },
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:93:18
           input: buildRequiredLocalesExpression(applicableLocalesPath),
           as: "locale",
           in: {
-            $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null],
+            $gt: [],
           },
         },
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] BlockStatement
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:100:30
     ],
   };
 
-  if (fieldSpec.isMandatory) {
-    return allLocalesNonNull;
-  }
+  if (fieldSpec.isMandatory) {}
   return {
     $or: [{ $not: { $gt: [`$${fieldSpec.path}`, null] } }, allLocalesNonNull],
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ConditionalExpression
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:100:7
     ],
   };
 
-  if (fieldSpec.isMandatory) {
+  if (false) {
     return allLocalesNonNull;
   }
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:103:10
   if (fieldSpec.isMandatory) {
     return allLocalesNonNull;
   }
-  return {
-    $or: [{ $not: { $gt: [`$${fieldSpec.path}`, null] } }, allLocalesNonNull],
-  };
+  return {};
 }
 
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with optional field semantics when isFullyTranslated is true and field is optional.
statusReason: expected { '$expr': { '$and': [ {} ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:104:26
     return allLocalesNonNull;
   }
   return {
-    $or: [{ $not: { $gt: [`$${fieldSpec.path}`, null] } }, allLocalesNonNull],
+    $or: [{ $not: { $gt: [] } }, allLocalesNonNull],
   };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with optional field semantics when isFullyTranslated is true and field is optional.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ArrayDeclaration
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:104:10
     return allLocalesNonNull;
   }
   return {
-    $or: [{ $not: { $gt: [`$${fieldSpec.path}`, null] } }, allLocalesNonNull],
+    $or: [],
   };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with optional field semantics when isFullyTranslated is true and field is optional.
statusReason: expected { '$expr': { '$and': [ { …(1) } ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:118:15
   const someLocaleNull = {
     $anyElementTrue: [
       {
-        $map: {
-          input: buildRequiredLocalesExpression(applicableLocalesPath),
-          as: "locale",
-          in: {
-            $not: { $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null] },
-          },
-        },
+        $map: {},
       },
     ],
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with mandatory incomplete semantics when isFullyTranslated is false.
statusReason: expected { '$expr': { '$or': [ { …(1) } ] } } to strictly equal { '$expr': { '$or': [ { …(1) } ] } }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:122:19
           input: buildRequiredLocalesExpression(applicableLocalesPath),
           as: "locale",
           in: {
-            $not: { $gt: [buildDynamicLocaleFieldExpression(fieldSpec.path, "locale"), null] },
+            $not: {},
           },
         },
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with mandatory incomplete semantics when isFullyTranslated is false.
statusReason: expected { '$expr': { '$or': [ { …(1) } ] } } to strictly equal { '$expr': { '$or': [ { …(1) } ] } }

[Killed] BlockStatement
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:129:30
     ],
   };
 
-  if (fieldSpec.isMandatory) {
-    return someLocaleNull;
-  }
+  if (fieldSpec.isMandatory) {}
   return {
     $and: [{ $gt: [`$${fieldSpec.path}`, null] }, someLocaleNull],
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with mandatory incomplete semantics when isFullyTranslated is false.
statusReason: expected { '$expr': { '$or': [ { …(1) } ] } } to strictly equal { '$expr': { '$or': [ { …(1) } ] } }

[Killed] StringLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:133:20
     return someLocaleNull;
   }
   return {
-    $and: [{ $gt: [`$${fieldSpec.path}`, null] }, someLocaleNull],
+    $and: [{ $gt: [``, null] }, someLocaleNull],
   };
 }
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with optional incomplete semantics when isFullyTranslated is false and field is optional.
statusReason: expected { '$expr': { '$or': [ { …(1) } ] } } to strictly equal { '$expr': { '$or': [ { …(1) } ] } }

[Killed] ArrowFunction
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:164:60
   applicableLocalesPath?: string,
 ): Record<string, unknown> {
   if (applicableLocalesPath === undefined) {
-    const staticCompleteCondition = { $and: fieldSpecs.map(fieldSpec => buildFieldCompleteCondition(fieldSpec, LOCALES)) };
+    const staticCompleteCondition = { $and: fieldSpecs.map(() => undefined) };
     const staticIncompleteCondition = { $or: fieldSpecs.map(fieldSpec => buildFieldIncompleteCondition(fieldSpec, LOCALES)) };
 
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$and': [ undefined ] } to strictly equal { '$and': [ { …(6) } ] }

[Killed] ArrowFunction
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:165:61
 ): Record<string, unknown> {
   if (applicableLocalesPath === undefined) {
     const staticCompleteCondition = { $and: fieldSpecs.map(fieldSpec => buildFieldCompleteCondition(fieldSpec, LOCALES)) };
-    const staticIncompleteCondition = { $or: fieldSpecs.map(fieldSpec => buildFieldIncompleteCondition(fieldSpec, LOCALES)) };
+    const staticIncompleteCondition = { $or: fieldSpecs.map(() => undefined) };
 
     return isFullyTranslated ? staticCompleteCondition : staticIncompleteCondition;
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected { '$or': [ undefined ] } to strictly equal { '$or': [ { '$or': [ …(6) ] } ] }

[Killed] ObjectLiteral
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:165:39
 ): Record<string, unknown> {
   if (applicableLocalesPath === undefined) {
     const staticCompleteCondition = { $and: fieldSpecs.map(fieldSpec => buildFieldCompleteCondition(fieldSpec, LOCALES)) };
-    const staticIncompleteCondition = { $or: fieldSpecs.map(fieldSpec => buildFieldIncompleteCondition(fieldSpec, LOCALES)) };
+    const staticIncompleteCondition = {};
 
     return isFullyTranslated ? staticCompleteCondition : staticIncompleteCondition;
killedBy: buildIsFullyTranslatedMatchCondition should return expected condition when undefined
statusReason: expected {} to strictly equal { '$or': [ { '$or': [ …(6) ] } ] }

[Killed] ArrowFunction
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:170:46
     return isFullyTranslated ? staticCompleteCondition : staticIncompleteCondition;
   }
 
-  const completeExpressions = fieldSpecs.map(spec => buildDynamicFieldCompleteCondition(spec, applicableLocalesPath));
+  const completeExpressions = fieldSpecs.map(() => undefined);
   const incompleteExpressions = fieldSpecs.map(spec => buildDynamicFieldIncompleteCondition(spec, applicableLocalesPath));
 
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition using applicableLocalesPath when third argument is provided and isFullyTranslated is true.
statusReason: expected { '$expr': { '$and': [ undefined ] } } to strictly equal { '$expr': { '$and': [ { …(1) } ] } }

[Killed] ArrowFunction
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:171:48
   }
 
   const completeExpressions = fieldSpecs.map(spec => buildDynamicFieldCompleteCondition(spec, applicableLocalesPath));
-  const incompleteExpressions = fieldSpecs.map(spec => buildDynamicFieldIncompleteCondition(spec, applicableLocalesPath));
+  const incompleteExpressions = fieldSpecs.map(() => undefined);
 
   return {
killedBy: buildIsFullyTranslatedMatchCondition should return an $expr condition with mandatory incomplete semantics when isFullyTranslated is false.
statusReason: expected { '$expr': { '$or': [ undefined ] } } to strictly equal { '$expr': { '$or': [ { …(1) } ] } }

[Killed] ArrowFunction
persistence/mongoose/helpers/translation-completeness.mongoose.helpers.ts:198:33
   fieldSpecs: TranslationCompletenessFieldSpec[],
   locale: Locale,
 ): Record<string, unknown> {
-  return { $and: fieldSpecs.map(fieldSpec => buildFieldCompleteCondition(fieldSpec, [locale])) };
+  return { $and: fieldSpecs.map(() => undefined) };
 }
 
killedBy: buildIsFullyTranslatedForLocaleMatchCondition should return expected condition when specs are undefined
statusReason: expected { '$and': [ undefined ] } to strictly equal { Object ($and) }
