[Killed] BlockStatement
persistence/mongoose/mappers/question.mongoose.mappers.ts:14:39
 
 function createQuestionAuthorFromAggregate(questionAggregate: QuestionAggregate): QuestionAuthor {
   const { _id, author: questionAuthor } = questionAggregate;
-  if (questionAuthor.role !== "game") {
-    return {
-      role: questionAuthor.role,
-      name: questionAuthor.name,
-    };
-  }
+  if (questionAuthor.role !== "game") {}
   if (!("gameId" in questionAuthor) || questionAuthor.gameId === undefined) {
     throw new QuestionPersistenceMappingError(_id.toString(), `Missing gameId for question author with role 'game'`);
killedBy: createQuestionAuthorFromAggregate should correctly map a question author when role is 'ai'.
statusReason: Failed to map Question with ID '6ab6b0ae5c420233cf62b44b' from persistence layer. Cause: Missing gameId for question author with role 'game'

[Killed] BooleanLiteral
persistence/mongoose/mappers/question.mongoose.mappers.ts:20:7
       name: questionAuthor.name,
     };
   }
-  if (!("gameId" in questionAuthor) || questionAuthor.gameId === undefined) {
+  if ("gameId" in questionAuthor || questionAuthor.gameId === undefined) {
     throw new QuestionPersistenceMappingError(_id.toString(), `Missing gameId for question author with role 'game'`);
   }
killedBy: createQuestionAuthorFromAggregate should correctly map a question author when role is 'game' and gameId is provided.
statusReason: Failed to map Question with ID '6ab6b0d8fa7dd2e74525de45' from persistence layer. Cause: Missing gameId for question author with role 'game'
