[Killed] MethodExpression
application/dto/question/question.dto.shape.ts:13:11
 const QUESTION_DTO = z.strictObject({
   id: zQuestionId(),
   category: zQuestionCategory(),
-  themes: z.array(QUESTION_THEME_ASSIGNMENT_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
+  themes: z.array(QUESTION_THEME_ASSIGNMENT_DTO).max(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .describe("Question's themes"),
killedBy: Question DTO Shape themes should throw zod error when themes is empty.
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
application/dto/question/question.dto.shape.ts:13:11
 const QUESTION_DTO = z.strictObject({
   id: zQuestionId(),
   category: zQuestionCategory(),
-  themes: z.array(QUESTION_THEME_ASSIGNMENT_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
-    .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
+  themes: z.array(QUESTION_THEME_ASSIGNMENT_DTO).min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS).min(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .describe("Question's themes"),
   content: QUESTION_CONTENT_DTO,
killedBy: Question DTO Shape should pass validation when a valid QuestionDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown
