[Killed] MethodExpression
application/dto/question-creation/question-creation.dto.shape.ts:13:11
 
 const QUESTION_CREATION_DTO = z.object({
   category: zQuestionCategory(),
-  themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
+  themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO).max(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
killedBy: Question Creation DTO Shape themes should have correct error message when themes have non-unique themeIds.
statusReason: expected 'Too big: expected array to have <=1 i…' to be 'Theme IDs must be unique' // Object.is equality

[Killed] MethodExpression
application/dto/question-creation/question-creation.dto.shape.ts:13:11
 
 const QUESTION_CREATION_DTO = z.object({
   category: zQuestionCategory(),
-  themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO)
-    .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
-    .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
+  themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO).min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS).min(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
     .refine(themes => hasExactlyOneByKey(themes, "isPrimary", true), { message: "There must be exactly one primary theme" })
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown

[Killed] ArrowFunction
application/dto/question-creation/question-creation.dto.shape.ts:16:13
   themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO)
     .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
-    .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
+    .refine(() => undefined, { message: "Theme IDs must be unique" })
     .refine(themes => hasExactlyOneByKey(themes, "isPrimary", true), { message: "There must be exactly one primary theme" })
     .describe("Question's themes"),
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown

[Killed] ObjectLiteral
application/dto/question-creation/question-creation.dto.shape.ts:16:64
   themes: z.array(QUESTION_THEME_ASSIGNMENT_CREATION_DTO)
     .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
-    .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
+    .refine(themes => areValuesUniqueByKey(themes, "themeId"), {})
     .refine(themes => hasExactlyOneByKey(themes, "isPrimary", true), { message: "There must be exactly one primary theme" })
     .describe("Question's themes"),
killedBy: Question Creation DTO Shape themes should have correct error message when themes have non-unique themeIds.
statusReason: expected 'Invalid input' to be 'Theme IDs must be unique' // Object.is equality

[Killed] BooleanLiteral
application/dto/question-creation/question-creation.dto.shape.ts:17:63
     .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
-    .refine(themes => hasExactlyOneByKey(themes, "isPrimary", true), { message: "There must be exactly one primary theme" })
+    .refine(themes => hasExactlyOneByKey(themes, "isPrimary", false), { message: "There must be exactly one primary theme" })
     .describe("Question's themes"),
   content: QUESTION_CONTENT_CREATION_DTO,
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown

[Killed] ArrowFunction
application/dto/question-creation/question-creation.dto.shape.ts:17:13
     .min(QUESTION_THEME_ASSIGNMENTS_MIN_ITEMS)
     .max(QUESTION_THEME_ASSIGNMENTS_MAX_ITEMS)
     .refine(themes => areValuesUniqueByKey(themes, "themeId"), { message: "Theme IDs must be unique" })
-    .refine(themes => hasExactlyOneByKey(themes, "isPrimary", true), { message: "There must be exactly one primary theme" })
+    .refine(() => undefined, { message: "There must be exactly one primary theme" })
     .describe("Question's themes"),
   content: QUESTION_CONTENT_CREATION_DTO,
killedBy: Question Creation DTO Shape should pass validation when a valid QuestionCreationDto is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "code": "custom",\n    "p…' was thrown
