[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:30:15
 
 function zQuestionStatus(): ZodEnum<QuestionStatusEnum> {
   return z.enum(QUESTION_STATUSES)
-    .describe("Question's status");
+    .describe("");
 }
 
killedBy: Admin Question DTO Shape status should have correct metadata when accessing the metadata.
statusReason: expected { description: '' } to strictly equal { description: 'Question\'s status' }

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:39:10
 }
 
 function zQuestionApplicableLocales(minItems = 1): ZodOptional<ZodArray<ZodEnum<LocaleEnum>>> {
-  return z.array(z.enum(LOCALES))
-    .min(minItems)
+  return z.array(z.enum(LOCALES)).max(minItems)
     .max(LOCALES.length)
     .refine(areValuesUniqueFromStrings, { message: "Locales must be unique" })
killedBy: Question DTO Zod Validators zQuestionApplicableLocales 'should return true when all locales a…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:39:10
 }
 
 function zQuestionApplicableLocales(minItems = 1): ZodOptional<ZodArray<ZodEnum<LocaleEnum>>> {
-  return z.array(z.enum(LOCALES))
-    .min(minItems)
-    .max(LOCALES.length)
+  return z.array(z.enum(LOCALES)).min(minItems).min(LOCALES.length)
     .refine(areValuesUniqueFromStrings, { message: "Locales must be unique" })
     .optional()
killedBy: Admin Question DTO Shape applicableLocales should pass validation when a valid subset of locales is provided.
statusReason: expected [Function] to not throw an error but '[\n  {\n    "origin": "array",\n    "…' was thrown

[Killed] ObjectLiteral
shared/zod/validators/question.dto.zod.validators.ts:42:41
   return z.array(z.enum(LOCALES))
     .min(minItems)
     .max(LOCALES.length)
-    .refine(areValuesUniqueFromStrings, { message: "Locales must be unique" })
+    .refine(areValuesUniqueFromStrings, {})
     .optional()
     .describe("Subset of locales this question is relevant for; omit if relevant for all locales");
killedBy: Question DTO Zod Validators zQuestionApplicableLocales should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected 'Invalid input' to be 'Locales must be unique' // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:48:10
 }
 
 function zQuestionSourceUrls(): ZodArray<ZodURL> {
-  return z.array(z.url())
-    .min(QUESTION_SOURCE_URLS_MIN_ITEMS)
+  return z.array(z.url()).max(QUESTION_SOURCE_URLS_MIN_ITEMS)
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
killedBy: Question DTO Zod Validators zQuestionSourceUrls 'should return true when array of vali…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:48:10
 }
 
 function zQuestionSourceUrls(): ZodArray<ZodURL> {
-  return z.array(z.url())
-    .min(QUESTION_SOURCE_URLS_MIN_ITEMS)
-    .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
+  return z.array(z.url()).min(QUESTION_SOURCE_URLS_MIN_ITEMS).min(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
     .describe("List of unique source URLs for the question")
killedBy: Question DTO Zod Validators zQuestionSourceUrls 'should return true when array of vali…'
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
shared/zod/validators/question.dto.zod.validators.ts:51:41
   return z.array(z.url())
     .min(QUESTION_SOURCE_URLS_MIN_ITEMS)
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
-    .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
+    .refine(areValuesUniqueFromStrings, {})
     .describe("List of unique source URLs for the question")
     .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected 'Invalid input' to be 'Source URLs must be unique' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:52:15
     .min(QUESTION_SOURCE_URLS_MIN_ITEMS)
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
-    .describe("List of unique source URLs for the question")
+    .describe("")
     .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
 }
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct metadata when accessed.
statusReason: expected { description: '', example: [ …(2) ] } to strictly equal { …(2) }

[Killed] ArrayDeclaration
shared/zod/validators/question.dto.zod.validators.ts:53:22
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
     .describe("List of unique source URLs for the question")
-    .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
+    .meta({ example: [] });
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct metadata when accessed.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:53:23
     .max(QUESTION_SOURCE_URLS_MAX_ITEMS)
     .refine(areValuesUniqueFromStrings, { message: "Source URLs must be unique" })
     .describe("List of unique source URLs for the question")
-    .meta({ example: ["https://example.com/source1", "https://example.com/source2"] });
+    .meta({ example: ["", "https://example.com/source2"] });
 }
 
killedBy: Question DTO Zod Validators zQuestionSourceUrls should have the correct metadata when accessed.
statusReason: expected { …(2) } to strictly equal { …(2) }

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:58:25
 
 function zQuestionExcludedIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return zCreateFilterArray(
-    zMongoId().describe("Question ID to exclude"),
+    zMongoId().describe(""),
     "Excluded IDs must be unique",
     "List of question IDs to exclude from the random pool",
killedBy: Question DTO Zod Validators zQuestionExcludedIdsFilter should have the correct inner element description when called.
statusReason: expected '' to be 'Question ID to exclude' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:59:5
 function zQuestionExcludedIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return zCreateFilterArray(
     zMongoId().describe("Question ID to exclude"),
-    "Excluded IDs must be unique",
+    "",
     "List of question IDs to exclude from the random pool",
     FIND_RANDOM_QUESTIONS_BODY_EXCLUDED_IDS_MINIMUM,
killedBy: Question DTO Zod Validators zQuestionExcludedIdsFilter should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected '' to be 'Excluded IDs must be unique' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:78:5
 function zQuestionCognitiveDifficultiesFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodEnum<QuestionCognitiveDifficultyEnum>>>> {
   return zCreateFilterArray(
     z.enum(QUESTION_COGNITIVE_DIFFICULTIES),
-    "Cognitive difficulties must be unique",
+    "",
     "List of cognitive difficulties to include (OR logic)",
     1,
killedBy: Question DTO Zod Validators zQuestionCognitiveDifficultiesFilter should have the correct refinement message for uniqueness when duplicates are present.
statusReason: expected '' to be 'Cognitive difficulties must be unique' // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:87:5
 function zQuestionThemeIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return z.preprocess(
     normalizeToArray,
-    z.array(zMongoId().describe("Theme ID to filter questions by")).min(1),
+    z.array(zMongoId().describe("Theme ID to filter questions by")).max(1),
   )
     .optional()
killedBy: Question DTO Zod Validators zQuestionThemeIdsFilter 'should return true when an array with…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:96:5
 function zQuestionIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return z.preprocess(
     normalizeToArray,
-    z.array(zMongoId().describe("Question ID to filter by"))
-      .min(QUESTION_IDS_FILTER_MINIMUM)
+    z.array(zMongoId().describe("Question ID to filter by")).max(QUESTION_IDS_FILTER_MINIMUM)
       .max(QUESTION_IDS_FILTER_MAXIMUM)
       .refine(areValuesUniqueFromStrings, { message: "IDs must be unique" }),
killedBy: Question DTO Zod Validators zQuestionIdsFilter 'should return true when an array with…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
shared/zod/validators/question.dto.zod.validators.ts:96:5
 function zQuestionIdsFilter(): ZodOptional<ZodPreprocess<ZodArray<ZodString>>> {
   return z.preprocess(
     normalizeToArray,
-    z.array(zMongoId().describe("Question ID to filter by"))
-      .min(QUESTION_IDS_FILTER_MINIMUM)
-      .max(QUESTION_IDS_FILTER_MAXIMUM)
+    z.array(zMongoId().describe("Question ID to filter by")).min(QUESTION_IDS_FILTER_MINIMUM).min(QUESTION_IDS_FILTER_MAXIMUM)
       .refine(areValuesUniqueFromStrings, { message: "IDs must be unique" }),
   )
killedBy: Question DTO Zod Validators zQuestionIdsFilter 'should return true when an array with…'
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:102:15
       .refine(areValuesUniqueFromStrings, { message: "IDs must be unique" }),
   )
     .optional()
-    .describe("List of question IDs to filter by (OR logic)");
+    .describe("");
 }
 
killedBy: Question DTO Zod Validators zQuestionIdsFilter should have the correct description when called.
statusReason: expected '' to be 'List of question IDs to filter by (OR…' // Object.is equality

[Killed] StringLiteral
shared/zod/validators/question.dto.zod.validators.ts:122:15
 
 function zQuestionIsAdultContent(): ZodBoolean {
   return z.boolean()
-    .describe("Whether the question contains adult content");
+    .describe("");
 }
 
killedBy: Question DTO Zod Validators zQuestionIsAdultContent should have the correct description when called.
statusReason: expected '' to be 'Whether the question contains adult c…' // Object.is equality
