[Killed] ArrayDeclaration
question/application/mappers/question.mappers.ts:78:17
     isAdultContent: question.isAdultContent,
     author: question.author,
     rejection: question.rejection,
-    sourceUrls: [...question.sourceUrls],
+    sourceUrls: [],
     applicableLocales: question.applicableLocales,
     status: question.status,
killedBy: createAdminQuestionDtoFromEntity should map a Question entity to an Admin Question DTO when called.
statusReason: expected { …(13) } to strictly equal { …(13) }
